TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 31 17:26:39 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

     503 00000378 021002E6             LDW     .D2T2   *B4,B4            ; |103| 
     504 0000037c 01886162             ADDKPC  .S2     RL3,B3,3          ; |103| 
     505                    RL3:       ; CALL OCCURS {_QUE_put}          ; |103| 
     506                    ;** --------------------------------------------------------------------------*
     507                    L6:    
     508                            .dwpsn  "alg_test_v2.c",106,2
     509 00000380 023C42E4             LDW     .D2T1   *+SP(8),A4        ; |106| 
     510 00000384 00006000             NOP             4
     511                            .dwpsn  "alg_test_v2.c",107,1
     512 00000388 01BC92E6             LDW     .D2T2   *++SP(16),B3      ; |107| 
     513 0000038c 00006000             NOP             4
     514                            .dwcfa  0xc0, 19
     515                            .dwcfa  0x0e, 0
     516 00000390 008CA362             RETNOP  .S2     B3,5              ; |107| 
     517                               ; BRANCH OCCURS {B3}              ; |107| 
     518                            .dwattr DW$20, DW_AT_end_file("alg_test_v2.c")
     519                            .dwattr DW$20, DW_AT_end_line(0x6b)
     520                            .dwattr DW$20, DW_AT_end_column(0x01)
     521                            .dwendentry
     522                            .dwendtag DW$20
     523                    
     524                    ;******************************************************************************
     525                    ;* UNDEFINED EXTERNAL REFERENCES                                              *
     526                    ;******************************************************************************
     527                            .global _QUE_put
     528                            .global _tsk_used_reg
     529                            .global _dsp_used_reg
     530                            .global _IMG_FEATURE_LEFT_STRUCT_ADDR
     531                            .global _IMG_FEATURE_RIGHT_STRUCT_ADDR
     532                            .global _img_queue
     533                    
     534                    ;******************************************************************************
     535                    ;* TYPE INFORMATION                                                           *
     536                    ;******************************************************************************
     537                    DW$T$88 .dwtag  DW_TAG_typedef, DW_AT_name("Ptr"), DW_AT_type(*DW$T$3)
     538                            .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
     539                    
     540                    DW$T$90 .dwtag  DW_TAG_subroutine_type
     541                            .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
     542                    DW$24   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$89)
     543                    DW$25   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$88)
     544                            .dwendtag DW$T$90
     545                    
     546                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     547                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     548                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     549                    
     550                    DW$T$94 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   11

     551                            .dwattr DW$T$94, DW_AT_language(DW_LANG_C)
     552                    DW$26   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$93)
     553                            .dwendtag DW$T$94
     554                    
     555                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     556                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     557                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     558                    DW$T$96 .dwtag  DW_TAG_typedef, DW_AT_name("LgUns"), DW_AT_type(*DW$T$11)
     559                            .dwattr DW$T$96, DW_AT_language(DW_LANG_C)
     560                    DW$T$89 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Handle"), DW_AT_type(*DW$T$19)
     561                            .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
     562                    DW$T$97 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
     563                            .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
     564                    DW$T$93 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$92)
     565                            .dwattr DW$T$93, DW_AT_address_class(0x20)
     566                    DW$T$99 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$98)
     567                            .dwattr DW$T$99, DW_AT_address_class(0x20)
     568                    DW$T$100        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_reg_t"), DW_AT_type(*DW$T$84)
     569                            .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
     570                    DW$T$102        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$101)
     571                            .dwattr DW$T$102, DW_AT_address_class(0x20)
     572                    DW$T$3  .dwtag  DW_TAG_pointer_type
     573                            .dwattr DW$T$3, DW_AT_address_class(0x20)
     574                    
     575                    DW$T$20 .dwtag  DW_TAG_structure_type
     576                            .dwattr DW$T$20, DW_AT_name("QUE_Elem")
     577                            .dwattr DW$T$20, DW_AT_byte_size(0x08)
     578                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     579                            .dwattr DW$27, DW_AT_name("next"), DW_AT_symbol_name("_next")
     580                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     581                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     582                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     583                            .dwattr DW$28, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
     584                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     585                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     586                            .dwendtag DW$T$20
     587                    
     588                    DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     589                            .dwattr DW$T$19, DW_AT_address_class(0x20)
     590                    DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_procimg_t"), DW_AT_type(*DW$T$32)
     591                            .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
     592                    DW$T$98 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$70)
     593                            .dwattr DW$T$98, DW_AT_language(DW_LANG_C)
     594                    
     595                    DW$T$84 .dwtag  DW_TAG_structure_type
     596                            .dwattr DW$T$84, DW_AT_name("dsp_reg_t")
     597                            .dwattr DW$T$84, DW_AT_byte_size(0xb4)
     598                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
     599                            .dwattr DW$29, DW_AT_name("status_reg"), DW_AT_symbol_name("_status_reg")
     600                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     601                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     602                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
     603                            .dwattr DW$30, DW_AT_name("distance_reg"), DW_AT_symbol_name("_distance_reg")
     604                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     605                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   12

     606                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
     607                            .dwattr DW$31, DW_AT_name("policy_reg"), DW_AT_symbol_name("_policy_reg")
     608                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     609                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     610                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
     611                            .dwattr DW$32, DW_AT_name("sound_reg"), DW_AT_symbol_name("_sound_reg")
     612                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     613                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     614                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
     615                            .dwattr DW$33, DW_AT_name("result_reg"), DW_AT_symbol_name("_result_reg")
     616                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
     617                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     618                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
     619                            .dwattr DW$34, DW_AT_name("quality_value"), DW_AT_symbol_name("_quality_value")
     620                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     621                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     622                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     623                            .dwattr DW$35, DW_AT_name("quality_count"), DW_AT_symbol_name("_quality_count")
     624                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
     625                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     626                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     627                            .dwattr DW$36, DW_AT_name("alg_control_count"), DW_AT_symbol_name("_alg_control_count")
     628                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
     629                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     630                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     631                            .dwattr DW$37, DW_AT_name("last_img_quality"), DW_AT_symbol_name("_last_img_quality")
     632                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
     633                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     634                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     635                            .dwattr DW$38, DW_AT_name("last_icon_id"), DW_AT_symbol_name("_last_icon_id")
     636                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
     637                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     638                    DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     639                            .dwattr DW$39, DW_AT_name("match_input_count"), DW_AT_symbol_name("_match_input_count")
     640                            .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
     641                            .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     642                            .dwendtag DW$T$84
     643                    
     644                    DW$T$101        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_iden_feature_t"), DW_AT_type(*DW$T$8
     645                            .dwattr DW$T$101, DW_AT_language(DW_LANG_C)
     646                    
     647                    DW$T$83 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
     648                            .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
     649                            .dwattr DW$T$83, DW_AT_byte_size(0x28)
     650                    DW$40   .dwtag  DW_TAG_subrange_type
     651                            .dwattr DW$40, DW_AT_upper_bound(0x09)
     652                            .dwendtag DW$T$83
     653                    
     654                    
     655                    DW$T$32 .dwtag  DW_TAG_structure_type
     656                            .dwattr DW$T$32, DW_AT_name("dsp_procimg_t")
     657                            .dwattr DW$T$32, DW_AT_byte_size(0x1c)
     658                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     659                            .dwattr DW$41, DW_AT_name("img_msg"), DW_AT_symbol_name("_img_msg")
     660                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   13

     661                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     662                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     663                            .dwattr DW$42, DW_AT_name("result_msg"), DW_AT_symbol_name("_result_msg")
     664                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     665                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     666                    DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     667                            .dwattr DW$43, DW_AT_name("last_flag"), DW_AT_symbol_name("_last_flag")
     668                            .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     669                            .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     670                    DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     671                            .dwattr DW$44, DW_AT_name("img_grab_count"), DW_AT_symbol_name("_img_grab_count")
     672                            .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     673                            .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     674                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     675                            .dwattr DW$45, DW_AT_name("begin_quality"), DW_AT_symbol_name("_begin_quality")
     676                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     677                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     678                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     679                            .dwattr DW$46, DW_AT_name("need_eye"), DW_AT_symbol_name("_need_eye")
     680                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     681                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     682                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     683                            .dwattr DW$47, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
     684                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     685                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     686                            .dwendtag DW$T$32
     687                    
     688                    
     689                    DW$T$70 .dwtag  DW_TAG_structure_type
     690                            .dwattr DW$T$70, DW_AT_name("dsp_tsk_totalreg_t")
     691                            .dwattr DW$T$70, DW_AT_byte_size(0x138)
     692                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
     693                            .dwattr DW$48, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
     694                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     696                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
     697                            .dwattr DW$49, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
     698                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     699                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     700                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
     701                            .dwattr DW$50, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
     702                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     703                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     704                    DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     705                            .dwattr DW$51, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
     706                            .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     707                            .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     708                    DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
     709                            .dwattr DW$52, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
     710                            .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     711                            .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     712                    DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     713                            .dwattr DW$53, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
     714                            .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     715                            .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   14

     716                    DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
     717                            .dwattr DW$54, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
     718                            .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
     719                            .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     720                    DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
     721                            .dwattr DW$55, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
     722                            .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
     723                            .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     724                    DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
     725                            .dwattr DW$56, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
     726                            .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
     727                            .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     728                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
     729                            .dwattr DW$57, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
     730                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
     731                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     732                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
     733                            .dwattr DW$58, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
     734                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
     735                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     736                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
     737                            .dwattr DW$59, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg"
     738                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
     739                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     740                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
     741                            .dwattr DW$60, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
     742                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
     743                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     744                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
     745                            .dwattr DW$61, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
     746                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
     747                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     748                            .dwendtag DW$T$70
     749                    
     750                    DW$T$78 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_status_t"), DW_AT_type(*DW$T$71)
     751                            .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
     752                    DW$T$79 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_t"), DW_AT_type(*DW$T$72)
     753                            .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
     754                    DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("policy_t"), DW_AT_type(*DW$T$74)
     755                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
     756                    DW$T$81 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_sound_t"), DW_AT_type(*DW$T$75)
     757                            .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
     758                    DW$T$82 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_t"), DW_AT_type(*DW$T$77)
     759                            .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
     760                    
     761                    DW$T$87 .dwtag  DW_TAG_structure_type
     762                            .dwattr DW$T$87, DW_AT_name("dsp_algorithm_iden_feature_t")
     763                            .dwattr DW$T$87, DW_AT_byte_size(0x10)
     764                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     765                            .dwattr DW$62, DW_AT_name("single_feature_len"), DW_AT_symbol_name("_single_feature_len")
     766                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     767                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     768                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     769                            .dwattr DW$63, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
     770                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   15

     771                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     772                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
     773                            .dwattr DW$64, DW_AT_name("iden_feature_data"), DW_AT_symbol_name("_iden_feature_data")
     774                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     775                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     776                            .dwendtag DW$T$87
     777                    
     778                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$30)
     779                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     780                    DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     781                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     782                    DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("IMAGE_MSG"), DW_AT_type(*DW$T$25)
     783                            .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     784                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("RESULT_MSG"), DW_AT_type(*DW$T$27)
     785                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     786                    DW$T$57 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$33)
     787                            .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
     788                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$34)
     789                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     790                    DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$37)
     791                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
     792                    DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$39)
     793                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
     794                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$40)
     795                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
     796                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$42)
     797                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
     798                    DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$43)
     799                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
     800                    DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$44)
     801                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
     802                    DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$46)
     803                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
     804                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$48)
     805                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
     806                    DW$T$66 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$51)
     807                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
     808                    DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$52)
     809                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
     810                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$55)
     811                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
     812                    DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$56)
     813                            .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
     814                    
     815                    DW$T$71 .dwtag  DW_TAG_structure_type
     816                            .dwattr DW$T$71, DW_AT_name("dsp_status_t")
     817                            .dwattr DW$T$71, DW_AT_byte_size(0x18)
     818                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     819                            .dwattr DW$65, DW_AT_name("tsk_img_status"), DW_AT_symbol_name("_tsk_img_status")
     820                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     821                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     822                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     823                            .dwattr DW$66, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
     824                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     825                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   16

     826                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     827                            .dwattr DW$67, DW_AT_name("tsk_alg_saved_status"), DW_AT_symbol_name("_tsk_alg_saved_status")
     828                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     829                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     830                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     831                            .dwattr DW$68, DW_AT_name("tsk_alg_inuse"), DW_AT_symbol_name("_tsk_alg_inuse")
     832                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     833                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     834                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     835                            .dwattr DW$69, DW_AT_name("proc_start_time"), DW_AT_symbol_name("_proc_start_time")
     836                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     837                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     838                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     839                            .dwattr DW$70, DW_AT_name("proc_timeout"), DW_AT_symbol_name("_proc_timeout")
     840                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     841                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     842                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     843                            .dwattr DW$71, DW_AT_name("tsk_testimg_tag_left"), DW_AT_symbol_name("_tsk_testimg_tag_left")
     844                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     845                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     846                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     847                            .dwattr DW$72, DW_AT_name("tsk_testimg_tag_right"), DW_AT_symbol_name("_tsk_testimg_tag_right"
     848                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     849                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     850                            .dwendtag DW$T$71
     851                    
     852                    
     853                    DW$T$72 .dwtag  DW_TAG_structure_type
     854                            .dwattr DW$T$72, DW_AT_name("dsp_distance_t")
     855                            .dwattr DW$T$72, DW_AT_byte_size(0x24)
     856                    DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     857                            .dwattr DW$73, DW_AT_name("same_count"), DW_AT_symbol_name("_same_count")
     858                            .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                            .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     860                    DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     861                            .dwattr DW$74, DW_AT_name("last_distance"), DW_AT_symbol_name("_last_distance")
     862                            .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     863                            .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     864                    DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     865                            .dwattr DW$75, DW_AT_name("if_has_people"), DW_AT_symbol_name("_if_has_people")
     866                            .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     867                            .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     868                    DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     869                            .dwattr DW$76, DW_AT_name("last_if_has"), DW_AT_symbol_name("_last_if_has")
     870                            .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     871                            .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     872                    DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     873                            .dwattr DW$77, DW_AT_name("no_count"), DW_AT_symbol_name("_no_count")
     874                            .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     875                            .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     876                    DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     877                            .dwattr DW$78, DW_AT_name("has_count"), DW_AT_symbol_name("_has_count")
     878                            .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     879                            .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     880                    DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   17

     881                            .dwattr DW$79, DW_AT_name("disp_count"), DW_AT_symbol_name("_disp_count")
     882                            .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     883                            .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     884                    DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     885                            .dwattr DW$80, DW_AT_name("if_disp_image"), DW_AT_symbol_name("_if_disp_image")
     886                            .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     887                            .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     888                    DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     889                            .dwattr DW$81, DW_AT_name("wait_frame"), DW_AT_symbol_name("_wait_frame")
     890                            .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     891                            .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     892                            .dwendtag DW$T$72
     893                    
     894                    
     895                    DW$T$74 .dwtag  DW_TAG_structure_type
     896                            .dwattr DW$T$74, DW_AT_name("policy_t")
     897                            .dwattr DW$T$74, DW_AT_byte_size(0x28)
     898                    DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     899                            .dwattr DW$82, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
     900                            .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     901                            .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     902                    DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     903                            .dwattr DW$83, DW_AT_name("iden_count"), DW_AT_symbol_name("_iden_count")
     904                            .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     905                            .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     906                    DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     907                            .dwattr DW$84, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
     908                            .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     909                            .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     910                    DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     911                            .dwattr DW$85, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
     912                            .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     913                            .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     914                    DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
     915                            .dwattr DW$86, DW_AT_name("enroll_score_l"), DW_AT_symbol_name("_enroll_score_l")
     916                            .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     917                            .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     918                    DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
     919                            .dwattr DW$87, DW_AT_name("enroll_score_r"), DW_AT_symbol_name("_enroll_score_r")
     920                            .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     921                            .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     922                            .dwendtag DW$T$74
     923                    
     924                    
     925                    DW$T$75 .dwtag  DW_TAG_structure_type
     926                            .dwattr DW$T$75, DW_AT_name("dsp_sound_t")
     927                            .dwattr DW$T$75, DW_AT_byte_size(0x08)
     928                    DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     929                            .dwattr DW$88, DW_AT_name("last_sound_time"), DW_AT_symbol_name("_last_sound_time")
     930                            .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     931                            .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     932                    DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     933                            .dwattr DW$89, DW_AT_name("last_sound_value"), DW_AT_symbol_name("_last_sound_value")
     934                            .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     935                            .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   18

     936                            .dwendtag DW$T$75
     937                    
     938                    
     939                    DW$T$77 .dwtag  DW_TAG_structure_type
     940                            .dwattr DW$T$77, DW_AT_name("dsp_result_t")
     941                            .dwattr DW$T$77, DW_AT_byte_size(0x0c)
     942                    DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
     943                            .dwattr DW$90, DW_AT_name("count"), DW_AT_symbol_name("_count")
     944                            .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     945                            .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     946                    DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
     947                            .dwattr DW$91, DW_AT_name("result"), DW_AT_symbol_name("_result")
     948                            .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     949                            .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
     950                    DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
     951                            .dwattr DW$92, DW_AT_name("grab_iden_result"), DW_AT_symbol_name("_grab_iden_result")
     952                            .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     953                            .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
     954                            .dwendtag DW$T$77
     955                    
     956                    DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_byte_data_t"), DW_AT_type(*DW$T$85)
     957                            .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
     958                    
     959                    DW$T$76 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
     960                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
     961                            .dwattr DW$T$76, DW_AT_byte_size(0x04)
     962                    DW$93   .dwtag  DW_TAG_subrange_type
     963                            .dwattr DW$93, DW_AT_upper_bound(0x01)
     964                            .dwendtag DW$T$76
     965                    
     966                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     967                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     968                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     969                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
     970                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     971                    
     972                    DW$T$73 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
     973                            .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
     974                            .dwattr DW$T$73, DW_AT_byte_size(0x10)
     975                    DW$94   .dwtag  DW_TAG_subrange_type
     976                            .dwattr DW$94, DW_AT_upper_bound(0x03)
     977                            .dwendtag DW$T$73
     978                    
     979                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
     980                            .dwattr DW$T$25, DW_AT_address_class(0x20)
     981                    DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     982                            .dwattr DW$T$27, DW_AT_address_class(0x20)
     983                    
     984                    DW$T$33 .dwtag  DW_TAG_structure_type
     985                            .dwattr DW$T$33, DW_AT_name("dsp_tsk_control_t")
     986                            .dwattr DW$T$33, DW_AT_byte_size(0x0c)
     987                    DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     988                            .dwattr DW$95, DW_AT_name("tsk_img_control"), DW_AT_symbol_name("_tsk_img_control")
     989                            .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                            .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   19

     991                    DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     992                            .dwattr DW$96, DW_AT_name("tsk_img_control_count"), DW_AT_symbol_name("_tsk_img_control_count"
     993                            .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     994                            .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     995                    DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     996                            .dwattr DW$97, DW_AT_name("tsk_alg_control"), DW_AT_symbol_name("_tsk_alg_control")
     997                            .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     998                            .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     999                    DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1000                            .dwattr DW$98, DW_AT_name("tsk_alg_control_count"), DW_AT_symbol_name("_tsk_alg_control_count"
    1001                            .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1002                            .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1003                    DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1004                            .dwattr DW$99, DW_AT_name("tsk_adc_value"), DW_AT_symbol_name("_tsk_adc_value")
    1005                            .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1006                            .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1007                            .dwendtag DW$T$33
    1008                    
    1009                    
    1010                    DW$T$34 .dwtag  DW_TAG_structure_type
    1011                            .dwattr DW$T$34, DW_AT_name("dsp_tsk_policy_t")
    1012                            .dwattr DW$T$34, DW_AT_byte_size(0x0c)
    1013                    DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1014                            .dwattr DW$100, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    1015                            .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                            .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1017                    DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1018                            .dwattr DW$101, DW_AT_name("try_count"), DW_AT_symbol_name("_try_count")
    1019                            .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1020                            .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1021                    DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1022                            .dwattr DW$102, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    1023                            .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1024                            .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1025                    DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1026                            .dwattr DW$103, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    1027                            .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1028                            .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1029                    DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1030                            .dwattr DW$104, DW_AT_name("policy_flag"), DW_AT_symbol_name("_policy_flag")
    1031                            .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1032                            .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1033                            .dwendtag DW$T$34
    1034                    
    1035                    
    1036                    DW$T$37 .dwtag  DW_TAG_structure_type
    1037                            .dwattr DW$T$37, DW_AT_name("dsp_tsk_flag_t")
    1038                            .dwattr DW$T$37, DW_AT_byte_size(0x1c)
    1039                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1040                            .dwattr DW$105, DW_AT_name("tsk_img_resp"), DW_AT_symbol_name("_tsk_img_resp")
    1041                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1043                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1044                            .dwattr DW$106, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    1045                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   20

    1046                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1047                    DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1048                            .dwattr DW$107, DW_AT_name("tsk_alg_status_count"), DW_AT_symbol_name("_tsk_alg_status_count")
    1049                            .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1050                            .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1051                    DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1052                            .dwattr DW$108, DW_AT_name("req_tsk_alg_control"), DW_AT_symbol_name("_req_tsk_alg_control")
    1053                            .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1054                            .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1055                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1056                            .dwattr DW$109, DW_AT_name("req_tsk_alg_control_count"), DW_AT_symbol_name("_req_tsk_alg_contr
    1057                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1058                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1059                    DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1060                            .dwattr DW$110, DW_AT_name("left_data"), DW_AT_symbol_name("_left_data")
    1061                            .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1062                            .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1063                    DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1064                            .dwattr DW$111, DW_AT_name("right_data"), DW_AT_symbol_name("_right_data")
    1065                            .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1066                            .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1067                            .dwendtag DW$T$37
    1068                    
    1069                    
    1070                    DW$T$39 .dwtag  DW_TAG_structure_type
    1071                            .dwattr DW$T$39, DW_AT_name("dsp_algorithm_result_t")
    1072                            .dwattr DW$T$39, DW_AT_byte_size(0x20)
    1073                    DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1074                            .dwattr DW$112, DW_AT_name("result_type"), DW_AT_symbol_name("_result_type")
    1075                            .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                            .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1077                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1078                            .dwattr DW$113, DW_AT_name("policy"), DW_AT_symbol_name("_policy")
    1079                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1080                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1081                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1082                            .dwattr DW$114, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    1083                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1084                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1085                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1086                            .dwattr DW$115, DW_AT_name("left_result"), DW_AT_symbol_name("_left_result")
    1087                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1088                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1089                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1090                            .dwattr DW$116, DW_AT_name("right_result"), DW_AT_symbol_name("_right_result")
    1091                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1092                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1093                    DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1094                            .dwattr DW$117, DW_AT_name("result_data"), DW_AT_symbol_name("_result_data")
    1095                            .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1096                            .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1097                            .dwendtag DW$T$39
    1098                    
    1099                    
    1100                    DW$T$40 .dwtag  DW_TAG_structure_type
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   21

    1101                            .dwattr DW$T$40, DW_AT_name("dsp_algorithm_sound_t")
    1102                            .dwattr DW$T$40, DW_AT_byte_size(0x08)
    1103                    DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1104                            .dwattr DW$118, DW_AT_name("sound_value"), DW_AT_symbol_name("_sound_value")
    1105                            .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                            .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1107                    DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1108                            .dwattr DW$119, DW_AT_name("sound_count"), DW_AT_symbol_name("_sound_count")
    1109                            .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1110                            .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1111                            .dwendtag DW$T$40
    1112                    
    1113                    
    1114                    DW$T$42 .dwtag  DW_TAG_structure_type
    1115                            .dwattr DW$T$42, DW_AT_name("dsp_algorithm_devparam_t")
    1116                            .dwattr DW$T$42, DW_AT_byte_size(0x54)
    1117                    DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1118                            .dwattr DW$120, DW_AT_name("param_count"), DW_AT_symbol_name("_param_count")
    1119                            .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1120                            .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1121                    DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    1122                            .dwattr DW$121, DW_AT_name("device_param"), DW_AT_symbol_name("_device_param")
    1123                            .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1124                            .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1125                            .dwendtag DW$T$42
    1126                    
    1127                    
    1128                    DW$T$43 .dwtag  DW_TAG_structure_type
    1129                            .dwattr DW$T$43, DW_AT_name("dsp_tsk_watchdog_t")
    1130                            .dwattr DW$T$43, DW_AT_byte_size(0x08)
    1131                    DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1132                            .dwattr DW$122, DW_AT_name("tsk_img_watchdog"), DW_AT_symbol_name("_tsk_img_watchdog")
    1133                            .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                            .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1135                    DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1136                            .dwattr DW$123, DW_AT_name("tsk_alg_watchdog"), DW_AT_symbol_name("_tsk_alg_watchdog")
    1137                            .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1138                            .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1139                            .dwendtag DW$T$43
    1140                    
    1141                    
    1142                    DW$T$44 .dwtag  DW_TAG_structure_type
    1143                            .dwattr DW$T$44, DW_AT_name("dsp_icon_t")
    1144                            .dwattr DW$T$44, DW_AT_byte_size(0x14)
    1145                    DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1146                            .dwattr DW$124, DW_AT_name("req_icon_control"), DW_AT_symbol_name("_req_icon_control")
    1147                            .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148                            .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1149                    DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1150                            .dwattr DW$125, DW_AT_name("req_icon_id"), DW_AT_symbol_name("_req_icon_id")
    1151                            .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1152                            .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1153                    DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1154                            .dwattr DW$126, DW_AT_name("dsp_icon_state"), DW_AT_symbol_name("_dsp_icon_state")
    1155                            .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   22

    1156                            .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1157                    DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1158                            .dwattr DW$127, DW_AT_name("icon_data"), DW_AT_symbol_name("_icon_data")
    1159                            .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1160                            .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1161                            .dwendtag DW$T$44
    1162                    
    1163                    
    1164                    DW$T$46 .dwtag  DW_TAG_structure_type
    1165                            .dwattr DW$T$46, DW_AT_name("dsp_mac_t")
    1166                            .dwattr DW$T$46, DW_AT_byte_size(0x08)
    1167                    DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    1168                            .dwattr DW$128, DW_AT_name("mac_val"), DW_AT_symbol_name("_mac_val")
    1169                            .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                            .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1171                            .dwendtag DW$T$46
    1172                    
    1173                    
    1174                    DW$T$48 .dwtag  DW_TAG_structure_type
    1175                            .dwattr DW$T$48, DW_AT_name("dsp_copyimg_t")
    1176                            .dwattr DW$T$48, DW_AT_byte_size(0x08)
    1177                    DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    1178                            .dwattr DW$129, DW_AT_name("left_param"), DW_AT_symbol_name("_left_param")
    1179                            .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1180                            .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1181                    DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    1182                            .dwattr DW$130, DW_AT_name("right_param"), DW_AT_symbol_name("_right_param")
    1183                            .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1184                            .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1185                            .dwendtag DW$T$48
    1186                    
    1187                    
    1188                    DW$T$51 .dwtag  DW_TAG_structure_type
    1189                            .dwattr DW$T$51, DW_AT_name("dsp_testimg_t")
    1190                            .dwattr DW$T$51, DW_AT_byte_size(0x28)
    1191                    DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    1192                            .dwattr DW$131, DW_AT_name("left_eye"), DW_AT_symbol_name("_left_eye")
    1193                            .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1194                            .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1195                    DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    1196                            .dwattr DW$132, DW_AT_name("right_eye"), DW_AT_symbol_name("_right_eye")
    1197                            .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1198                            .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1199                            .dwendtag DW$T$51
    1200                    
    1201                    
    1202                    DW$T$52 .dwtag  DW_TAG_structure_type
    1203                            .dwattr DW$T$52, DW_AT_name("dsp_distance_ctrl_t")
    1204                            .dwattr DW$T$52, DW_AT_byte_size(0x10)
    1205                    DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1206                            .dwattr DW$133, DW_AT_name("adc_noperson"), DW_AT_symbol_name("_adc_noperson")
    1207                            .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                            .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1209                    DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1210                            .dwattr DW$134, DW_AT_name("adc_toofar"), DW_AT_symbol_name("_adc_toofar")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   23

    1211                            .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1212                            .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1213                    DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1214                            .dwattr DW$135, DW_AT_name("adc_ok"), DW_AT_symbol_name("_adc_ok")
    1215                            .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1216                            .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1217                    DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1218                            .dwattr DW$136, DW_AT_name("adc_tooclose"), DW_AT_symbol_name("_adc_tooclose")
    1219                            .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1220                            .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1221                    DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1222                            .dwattr DW$137, DW_AT_name("adc_smooth"), DW_AT_symbol_name("_adc_smooth")
    1223                            .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1224                            .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1225                    DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1226                            .dwattr DW$138, DW_AT_name("adc_noperson_disp"), DW_AT_symbol_name("_adc_noperson_disp")
    1227                            .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1228                            .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1229                    DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1230                            .dwattr DW$139, DW_AT_name("adc_play_sound"), DW_AT_symbol_name("_adc_play_sound")
    1231                            .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1232                            .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1233                    DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1234                            .dwattr DW$140, DW_AT_name("adc_nouse"), DW_AT_symbol_name("_adc_nouse")
    1235                            .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1236                            .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1237                            .dwendtag DW$T$52
    1238                    
    1239                    
    1240                    DW$T$55 .dwtag  DW_TAG_structure_type
    1241                            .dwattr DW$T$55, DW_AT_name("dsp_buildtime_t")
    1242                            .dwattr DW$T$55, DW_AT_byte_size(0x20)
    1243                    DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    1244                            .dwattr DW$141, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
    1245                            .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                            .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1247                            .dwendtag DW$T$55
    1248                    
    1249                    
    1250                    DW$T$56 .dwtag  DW_TAG_structure_type
    1251                            .dwattr DW$T$56, DW_AT_name("switch_control_t")
    1252                            .dwattr DW$T$56, DW_AT_byte_size(0x04)
    1253                    DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1254                            .dwattr DW$142, DW_AT_name("ctrls"), DW_AT_symbol_name("_ctrls")
    1255                            .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                            .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1257                            .dwendtag DW$T$56
    1258                    
    1259                    
    1260                    DW$T$85 .dwtag  DW_TAG_structure_type
    1261                            .dwattr DW$T$85, DW_AT_name("dsp_byte_data_t")
    1262                            .dwattr DW$T$85, DW_AT_byte_size(0x08)
    1263                    DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1264                            .dwattr DW$143, DW_AT_name("data_len"), DW_AT_symbol_name("_data_len")
    1265                            .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   24

    1266                            .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1267                    DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1268                            .dwattr DW$144, DW_AT_name("data_byte"), DW_AT_symbol_name("_data_byte")
    1269                            .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1270                            .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1271                            .dwendtag DW$T$85
    1272                    
    1273                    DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
    1274                            .dwattr DW$T$22, DW_AT_address_class(0x20)
    1275                    
    1276                    DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    1277                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    1278                            .dwattr DW$T$45, DW_AT_byte_size(0x08)
    1279                    DW$145  .dwtag  DW_TAG_subrange_type
    1280                            .dwattr DW$145, DW_AT_upper_bound(0x07)
    1281                            .dwendtag DW$T$45
    1282                    
    1283                    DW$T$8  .dwtag  DW_TAG_base_type, DW_AT_name("short")
    1284                            .dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1285                            .dwattr DW$T$8, DW_AT_byte_size(0x02)
    1286                    
    1287                    DW$T$41 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    1288                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1289                            .dwattr DW$T$41, DW_AT_byte_size(0x50)
    1290                    DW$146  .dwtag  DW_TAG_subrange_type
    1291                            .dwattr DW$146, DW_AT_upper_bound(0x13)
    1292                            .dwendtag DW$T$41
    1293                    
    1294                    
    1295                    DW$T$23 .dwtag  DW_TAG_structure_type
    1296                            .dwattr DW$T$23, DW_AT_name("dsp_image_msg_t")
    1297                            .dwattr DW$T$23, DW_AT_byte_size(0x34)
    1298                    DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1299                            .dwattr DW$147, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    1300                            .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1301                            .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1302                    DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1303                            .dwattr DW$148, DW_AT_name("img_saved_score_l"), DW_AT_symbol_name("_img_saved_score_l")
    1304                            .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1305                            .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1306                    DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1307                            .dwattr DW$149, DW_AT_name("img_saved_score_r"), DW_AT_symbol_name("_img_saved_score_r")
    1308                            .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1309                            .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1310                    DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1311                            .dwattr DW$150, DW_AT_name("img_ptr_l"), DW_AT_symbol_name("_img_ptr_l")
    1312                            .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1313                            .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1314                    DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1315                            .dwattr DW$151, DW_AT_name("img_ptr_r"), DW_AT_symbol_name("_img_ptr_r")
    1316                            .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1317                            .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1318                    DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1319                            .dwattr DW$152, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    1320                            .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   25

    1321                            .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1322                    DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1323                            .dwattr DW$153, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    1324                            .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1325                            .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1326                    DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1327                            .dwattr DW$154, DW_AT_name("img_saved_count_l"), DW_AT_symbol_name("_img_saved_count_l")
    1328                            .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1329                            .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1330                    DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1331                            .dwattr DW$155, DW_AT_name("img_saved_count_r"), DW_AT_symbol_name("_img_saved_count_r")
    1332                            .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1333                            .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1334                    DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1335                            .dwattr DW$156, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    1336                            .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1337                            .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1338                    DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1339                            .dwattr DW$157, DW_AT_name("data_type_l"), DW_AT_symbol_name("_data_type_l")
    1340                            .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1341                            .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1342                    DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1343                            .dwattr DW$158, DW_AT_name("data_type_r"), DW_AT_symbol_name("_data_type_r")
    1344                            .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1345                            .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1346                            .dwendtag DW$T$23
    1347                    
    1348                    
    1349                    DW$T$24 .dwtag  DW_TAG_structure_type
    1350                            .dwattr DW$T$24, DW_AT_name("dsp_result_msg_t")
    1351                            .dwattr DW$T$24, DW_AT_byte_size(0x1c)
    1352                    DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1353                            .dwattr DW$159, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    1354                            .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355                            .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1356                    DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1357                            .dwattr DW$160, DW_AT_name("result_left"), DW_AT_symbol_name("_result_left")
    1358                            .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1359                            .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1360                    DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1361                            .dwattr DW$161, DW_AT_name("result_right"), DW_AT_symbol_name("_result_right")
    1362                            .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1363                            .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1364                    DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1365                            .dwattr DW$162, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    1366                            .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1367                            .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1368                    DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1369                            .dwattr DW$163, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    1370                            .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1371                            .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1372                    DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1373                            .dwattr DW$164, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    1374                            .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1375                            .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   26

    1376                            .dwendtag DW$T$24
    1377                    
    1378                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_memory_t"), DW_AT_type(*DW$T$35)
    1379                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    1380                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    1381                            .dwattr DW$T$47, DW_AT_address_class(0x20)
    1382                    DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_img_t"), DW_AT_type(*DW$T$49)
    1383                            .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    1384                    
    1385                    DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$53)
    1386                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1387                            .dwattr DW$T$54, DW_AT_byte_size(0x20)
    1388                    DW$165  .dwtag  DW_TAG_subrange_type
    1389                            .dwattr DW$165, DW_AT_upper_bound(0x1f)
    1390                            .dwendtag DW$T$54
    1391                    
    1392                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1393                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1394                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1395                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
    1396                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1397                    
    1398                    DW$T$35 .dwtag  DW_TAG_structure_type
    1399                            .dwattr DW$T$35, DW_AT_name("dsp_tsk_memory_t")
    1400                            .dwattr DW$T$35, DW_AT_byte_size(0x08)
    1401                    DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1402                            .dwattr DW$166, DW_AT_name("dataptr_len"), DW_AT_symbol_name("_dataptr_len")
    1403                            .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1404                            .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1405                    DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    1406                            .dwattr DW$167, DW_AT_name("data_ptr"), DW_AT_symbol_name("_data_ptr")
    1407                            .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1408                            .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1409                            .dwendtag DW$T$35
    1410                    
    1411                    
    1412                    DW$T$49 .dwtag  DW_TAG_structure_type
    1413                            .dwattr DW$T$49, DW_AT_name("dsp_img_t")
    1414                            .dwattr DW$T$49, DW_AT_byte_size(0x14)
    1415                    DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1416                            .dwattr DW$168, DW_AT_name("tag_arm"), DW_AT_symbol_name("_tag_arm")
    1417                            .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1418                            .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1419                    DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1420                            .dwattr DW$169, DW_AT_name("tag_dsp"), DW_AT_symbol_name("_tag_dsp")
    1421                            .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1422                            .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1423                    DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1424                            .dwattr DW$170, DW_AT_name("type"), DW_AT_symbol_name("_type")
    1425                            .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1426                            .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1427                    DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1428                            .dwattr DW$171, DW_AT_name("img_data"), DW_AT_symbol_name("_img_data")
    1429                            .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1430                            .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   27

    1431                            .dwendtag DW$T$49
    1432                    
    1433                    DW$T$53 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1434                            .dwattr DW$T$53, DW_AT_encoding(DW_ATE_signed_char)
    1435                            .dwattr DW$T$53, DW_AT_byte_size(0x01)
    1436                    
    1437                            .dwattr DW$9, DW_AT_external(0x01)
    1438                            .dwattr DW$9, DW_AT_type(*DW$T$10)
    1439                            .dwattr DW$16, DW_AT_external(0x01)
    1440                            .dwattr DW$16, DW_AT_type(*DW$T$10)
    1441                            .dwattr DW$20, DW_AT_external(0x01)
    1442                            .dwattr DW$20, DW_AT_type(*DW$T$10)
    1443                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1444                    
    1445                    ;***************************************************************
    1446                    ;* DWARF CIE ENTRIES                                           *
    1447                    ;***************************************************************
    1448                    
    1449                    DW$CIE  .dwcie 1, 126
    1450                            .dwcfa  0x0c, 31, 0
    1451                            .dwcfa  0x07, 0
    1452                            .dwcfa  0x07, 1
    1453                            .dwcfa  0x07, 2
    1454                            .dwcfa  0x07, 3
    1455                            .dwcfa  0x07, 4
    1456                            .dwcfa  0x07, 5
    1457                            .dwcfa  0x07, 6
    1458                            .dwcfa  0x07, 7
    1459                            .dwcfa  0x07, 8
    1460                            .dwcfa  0x07, 9
    1461                            .dwcfa  0x08, 10
    1462                            .dwcfa  0x08, 11
    1463                            .dwcfa  0x08, 12
    1464                            .dwcfa  0x08, 13
    1465                            .dwcfa  0x08, 14
    1466                            .dwcfa  0x08, 15
    1467                            .dwcfa  0x07, 16
    1468                            .dwcfa  0x07, 17
    1469                            .dwcfa  0x07, 18
    1470                            .dwcfa  0x07, 19
    1471                            .dwcfa  0x07, 20
    1472                            .dwcfa  0x07, 21
    1473                            .dwcfa  0x07, 22
    1474                            .dwcfa  0x07, 23
    1475                            .dwcfa  0x07, 24
    1476                            .dwcfa  0x07, 25
    1477                            .dwcfa  0x08, 26
    1478                            .dwcfa  0x08, 27
    1479                            .dwcfa  0x08, 28
    1480                            .dwcfa  0x08, 29
    1481                            .dwcfa  0x08, 30
    1482                            .dwcfa  0x08, 31
    1483                            .dwcfa  0x08, 32
    1484                            .dwcfa  0x07, 33
    1485                            .dwcfa  0x07, 34
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:26:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE   28

    1486                            .dwcfa  0x07, 35
    1487                            .dwcfa  0x07, 36
    1488                            .dwcfa  0x07, 37
    1489                            .dwcfa  0x07, 38
    1490                            .dwcfa  0x07, 39
