TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 31 17:05:34 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

     657                    DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
     658                    DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     659                    DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     660                            .dwendtag DW$T$63
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   13

     661                    
     662                    
     663                    DW$T$65 .dwtag  DW_TAG_subroutine_type
     664                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
     665                    DW$57   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     666                            .dwendtag DW$T$65
     667                    
     668                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     669                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     670                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     671                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
     672                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     673                    DW$T$24 .dwtag  DW_TAG_volatile_type
     674                            .dwattr DW$T$24, DW_AT_type(*DW$T$19)
     675                    DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
     676                            .dwattr DW$T$38, DW_AT_address_class(0x20)
     677                    DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("EMIFA_Config"), DW_AT_type(*DW$T$32)
     678                            .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     679                    DW$T$44 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
     680                            .dwattr DW$T$44, DW_AT_address_class(0x20)
     681                    DW$T$68 .dwtag  DW_TAG_const_type
     682                            .dwattr DW$T$68, DW_AT_type(*DW$T$43)
     683                    DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$47)
     684                            .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     685                    
     686                    DW$T$69 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$48)
     687                            .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
     688                    DW$58   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     689                    DW$59   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     690                            .dwendtag DW$T$69
     691                    
     692                    DW$T$51 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Config"), DW_AT_type(*DW$T$34)
     693                            .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     694                    DW$T$52 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
     695                            .dwattr DW$T$52, DW_AT_address_class(0x20)
     696                    DW$T$71 .dwtag  DW_TAG_const_type
     697                            .dwattr DW$T$71, DW_AT_type(*DW$T$51)
     698                    DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle"), DW_AT_type(*DW$T$55)
     699                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
     700                    
     701                    DW$T$72 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$56)
     702                            .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
     703                    DW$60   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     704                    DW$61   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     705                            .dwendtag DW$T$72
     706                    
     707                    DW$T$57 .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Config"), DW_AT_type(*DW$T$36)
     708                            .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
     709                    DW$T$58 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
     710                            .dwattr DW$T$58, DW_AT_address_class(0x20)
     711                    DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$61)
     712                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
     713                    DW$T$75 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_L2Mode"), DW_AT_type(*DW$T$74)
     714                            .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
     715                    
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   14

     716                    DW$T$76 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$75)
     717                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
     718                    DW$62   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$75)
     719                            .dwendtag DW$T$76
     720                    
     721                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     722                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     723                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     724                    DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("_CSL_Config"), DW_AT_type(*DW$T$31)
     725                            .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     726                    
     727                    DW$T$32 .dwtag  DW_TAG_structure_type
     728                            .dwattr DW$T$32, DW_AT_byte_size(0x30)
     729                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     730                            .dwattr DW$63, DW_AT_name("gblctl"), DW_AT_symbol_name("_gblctl")
     731                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     733                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     734                            .dwattr DW$64, DW_AT_name("cectl0"), DW_AT_symbol_name("_cectl0")
     735                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     736                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     737                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     738                            .dwattr DW$65, DW_AT_name("cectl1"), DW_AT_symbol_name("_cectl1")
     739                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     740                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     741                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     742                            .dwattr DW$66, DW_AT_name("cectl2"), DW_AT_symbol_name("_cectl2")
     743                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     744                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     745                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     746                            .dwattr DW$67, DW_AT_name("cectl3"), DW_AT_symbol_name("_cectl3")
     747                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     748                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     749                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     750                            .dwattr DW$68, DW_AT_name("sdctl"), DW_AT_symbol_name("_sdctl")
     751                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     752                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     753                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     754                            .dwattr DW$69, DW_AT_name("sdtim"), DW_AT_symbol_name("_sdtim")
     755                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     756                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     757                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     758                            .dwattr DW$70, DW_AT_name("sdext"), DW_AT_symbol_name("_sdext")
     759                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     760                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     761                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     762                            .dwattr DW$71, DW_AT_name("cesec0"), DW_AT_symbol_name("_cesec0")
     763                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     764                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     765                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     766                            .dwattr DW$72, DW_AT_name("cesec1"), DW_AT_symbol_name("_cesec1")
     767                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     768                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     769                    DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     770                            .dwattr DW$73, DW_AT_name("cesec2"), DW_AT_symbol_name("_cesec2")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   15

     771                            .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     772                            .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     773                    DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     774                            .dwattr DW$74, DW_AT_name("cesec3"), DW_AT_symbol_name("_cesec3")
     775                            .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     776                            .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     777                            .dwendtag DW$T$32
     778                    
     779                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
     780                            .dwattr DW$T$47, DW_AT_address_class(0x20)
     781                    
     782                    DW$T$34 .dwtag  DW_TAG_structure_type
     783                            .dwattr DW$T$34, DW_AT_byte_size(0x20)
     784                    DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     785                            .dwattr DW$75, DW_AT_name("i2coar"), DW_AT_symbol_name("_i2coar")
     786                            .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787                            .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     788                    DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     789                            .dwattr DW$76, DW_AT_name("i2cier"), DW_AT_symbol_name("_i2cier")
     790                            .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     791                            .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     792                    DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     793                            .dwattr DW$77, DW_AT_name("i2cclkl"), DW_AT_symbol_name("_i2cclkl")
     794                            .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     795                            .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     796                    DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     797                            .dwattr DW$78, DW_AT_name("i2cclkh"), DW_AT_symbol_name("_i2cclkh")
     798                            .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     799                            .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     800                    DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     801                            .dwattr DW$79, DW_AT_name("i2ccnt"), DW_AT_symbol_name("_i2ccnt")
     802                            .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     803                            .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     804                    DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     805                            .dwattr DW$80, DW_AT_name("i2csar"), DW_AT_symbol_name("_i2csar")
     806                            .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     807                            .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     808                    DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     809                            .dwattr DW$81, DW_AT_name("i2cmdr"), DW_AT_symbol_name("_i2cmdr")
     810                            .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     811                            .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     812                    DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     813                            .dwattr DW$82, DW_AT_name("i2cpsc"), DW_AT_symbol_name("_i2cpsc")
     814                            .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     815                            .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     816                            .dwendtag DW$T$34
     817                    
     818                    DW$T$55 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     819                            .dwattr DW$T$55, DW_AT_address_class(0x20)
     820                    
     821                    DW$T$36 .dwtag  DW_TAG_structure_type
     822                            .dwattr DW$T$36, DW_AT_byte_size(0x1c)
     823                    DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     824                            .dwattr DW$83, DW_AT_name("gpgc"), DW_AT_symbol_name("_gpgc")
     825                            .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   16

     826                            .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     827                    DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     828                            .dwattr DW$84, DW_AT_name("gpen"), DW_AT_symbol_name("_gpen")
     829                            .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     830                            .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     831                    DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     832                            .dwattr DW$85, DW_AT_name("gpdir"), DW_AT_symbol_name("_gpdir")
     833                            .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     834                            .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     835                    DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     836                            .dwattr DW$86, DW_AT_name("gpval"), DW_AT_symbol_name("_gpval")
     837                            .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     838                            .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     839                    DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     840                            .dwattr DW$87, DW_AT_name("gphm"), DW_AT_symbol_name("_gphm")
     841                            .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     842                            .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     843                    DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     844                            .dwattr DW$88, DW_AT_name("gplm"), DW_AT_symbol_name("_gplm")
     845                            .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     846                            .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     847                    DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     848                            .dwattr DW$89, DW_AT_name("gppol"), DW_AT_symbol_name("_gppol")
     849                            .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     850                            .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     851                            .dwendtag DW$T$36
     852                    
     853                    
     854                    DW$T$61 .dwtag  DW_TAG_enumeration_type
     855                            .dwattr DW$T$61, DW_AT_byte_size(0x04)
     856                    DW$90   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
     857                    DW$91   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
     858                    DW$92   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
     859                    DW$93   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
     860                    DW$94   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
     861                    DW$95   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
     862                            .dwendtag DW$T$61
     863                    
     864                    
     865                    DW$T$74 .dwtag  DW_TAG_enumeration_type
     866                            .dwattr DW$T$74, DW_AT_byte_size(0x04)
     867                    DW$96   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_256KSRAM"), DW_AT_const_value(0x00)
     868                    DW$97   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_0KCACHE"), DW_AT_const_value(0x00)
     869                    DW$98   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_224KSRAM"), DW_AT_const_value(0x01)
     870                    DW$99   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_32KCACHE"), DW_AT_const_value(0x01)
     871                    DW$100  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_192KSRAM"), DW_AT_const_value(0x02)
     872                    DW$101  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_64KCACHE"), DW_AT_const_value(0x02)
     873                    DW$102  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_128KSRAM"), DW_AT_const_value(0x03)
     874                    DW$103  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_128KCACHE"), DW_AT_const_value(0x03)
     875                    DW$104  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_0KSRAM"), DW_AT_const_value(0x07)
     876                    DW$105  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_256KCACHE"), DW_AT_const_value(0x07)
     877                            .dwendtag DW$T$74
     878                    
     879                    
     880                    DW$T$31 .dwtag  DW_TAG_union_type
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   17

     881                            .dwattr DW$T$31, DW_AT_byte_size(0x10)
     882                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     883                            .dwattr DW$106, DW_AT_name("args"), DW_AT_symbol_name("_args")
     884                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     885                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     886                    DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     887                            .dwattr DW$107, DW_AT_name("ret"), DW_AT_symbol_name("_ret")
     888                            .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889                            .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     890                            .dwendtag DW$T$31
     891                    
     892                    
     893                    DW$T$33 .dwtag  DW_TAG_structure_type
     894                            .dwattr DW$T$33, DW_AT_byte_size(0x14)
     895                    DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     896                            .dwattr DW$108, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     897                            .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     898                            .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     899                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     900                            .dwattr DW$109, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
     901                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     902                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     903                    DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     904                            .dwattr DW$110, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     905                            .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     906                            .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
     907                    DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     908                            .dwattr DW$111, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
     909                            .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     910                            .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
     911                    DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     912                            .dwattr DW$112, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
     913                            .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     914                            .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
     915                            .dwendtag DW$T$33
     916                    
     917                    
     918                    DW$T$35 .dwtag  DW_TAG_structure_type
     919                            .dwattr DW$T$35, DW_AT_byte_size(0x0c)
     920                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     921                            .dwattr DW$113, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     922                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     923                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     924                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     925                            .dwattr DW$114, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     926                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     927                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     928                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     929                            .dwattr DW$115, DW_AT_name("pinAllocMask"), DW_AT_symbol_name("_pinAllocMask")
     930                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     931                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     932                            .dwendtag DW$T$35
     933                    
     934                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     935                            .dwattr DW$T$25, DW_AT_address_class(0x20)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   18

     936                    
     937                    DW$T$23 .dwtag  DW_TAG_structure_type
     938                            .dwattr DW$T$23, DW_AT_byte_size(0x10)
     939                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     940                            .dwattr DW$116, DW_AT_name("biosPresent"), DW_AT_symbol_name("_biosPresent")
     941                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     943                    DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     944                            .dwattr DW$117, DW_AT_name("dispatchTable"), DW_AT_symbol_name("_dispatchTable")
     945                            .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     946                            .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
     947                    DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     948                            .dwattr DW$118, DW_AT_name("timerUsed"), DW_AT_symbol_name("_timerUsed")
     949                            .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     950                            .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
     951                    DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     952                            .dwattr DW$119, DW_AT_name("timerNum"), DW_AT_symbol_name("_timerNum")
     953                            .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     954                            .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
     955                            .dwendtag DW$T$23
     956                    
     957                    
     958                    DW$T$30 .dwtag  DW_TAG_structure_type
     959                            .dwattr DW$T$30, DW_AT_byte_size(0x0c)
     960                    DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     961                            .dwattr DW$120, DW_AT_name("hTimer"), DW_AT_symbol_name("_hTimer")
     962                            .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                            .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
     964                    DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     965                            .dwattr DW$121, DW_AT_name("event2IntTbl"), DW_AT_symbol_name("_event2IntTbl")
     966                            .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     967                            .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
     968                    DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     969                            .dwattr DW$122, DW_AT_name("int2EventTbl"), DW_AT_symbol_name("_int2EventTbl")
     970                            .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     971                            .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
     972                            .dwendtag DW$T$30
     973                    
     974                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
     975                            .dwattr DW$T$29, DW_AT_address_class(0x20)
     976                    DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
     977                            .dwattr DW$T$22, DW_AT_address_class(0x20)
     978                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_Handle"), DW_AT_type(*DW$T$27)
     979                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     980                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("_IRQ_Dispatch"), DW_AT_type(*DW$T$20)
     981                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     982                    DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     983                            .dwattr DW$T$27, DW_AT_address_class(0x20)
     984                    
     985                    DW$T$20 .dwtag  DW_TAG_structure_type
     986                            .dwattr DW$T$20, DW_AT_byte_size(0x10)
     987                    DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     988                            .dwattr DW$123, DW_AT_name("funcAddr"), DW_AT_symbol_name("_funcAddr")
     989                            .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     990                            .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   19

     991                    DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     992                            .dwattr DW$124, DW_AT_name("ieMask"), DW_AT_symbol_name("_ieMask")
     993                            .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     994                            .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
     995                    DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     996                            .dwattr DW$125, DW_AT_name("ccMask"), DW_AT_symbol_name("_ccMask")
     997                            .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     998                            .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
     999                    DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1000                            .dwattr DW$126, DW_AT_name("funcArg"), DW_AT_symbol_name("_funcArg")
    1001                            .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1002                            .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1003                            .dwendtag DW$T$20
    1004                    
    1005                    
    1006                    DW$T$26 .dwtag  DW_TAG_structure_type
    1007                            .dwattr DW$T$26, DW_AT_byte_size(0x0c)
    1008                    DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1009                            .dwattr DW$127, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    1010                            .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1011                            .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1012                    DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1013                            .dwattr DW$128, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    1014                            .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1015                            .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1016                    DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1017                            .dwattr DW$129, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    1018                            .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1019                            .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1020                            .dwendtag DW$T$26
    1021                    
    1022                    
    1023                            .dwattr DW$42, DW_AT_external(0x01)
    1024                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1025                    
    1026                    ;***************************************************************
    1027                    ;* DWARF CIE ENTRIES                                           *
    1028                    ;***************************************************************
    1029                    
    1030                    DW$CIE  .dwcie 1, 126
    1031                            .dwcfa  0x0c, 31, 0
    1032                            .dwcfa  0x07, 0
    1033                            .dwcfa  0x07, 1
    1034                            .dwcfa  0x07, 2
    1035                            .dwcfa  0x07, 3
    1036                            .dwcfa  0x07, 4
    1037                            .dwcfa  0x07, 5
    1038                            .dwcfa  0x07, 6
    1039                            .dwcfa  0x07, 7
    1040                            .dwcfa  0x07, 8
    1041                            .dwcfa  0x07, 9
    1042                            .dwcfa  0x08, 10
    1043                            .dwcfa  0x08, 11
    1044                            .dwcfa  0x08, 12
    1045                            .dwcfa  0x08, 13
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1442                          PAGE   20

    1046                            .dwcfa  0x08, 14
    1047                            .dwcfa  0x08, 15
    1048                            .dwcfa  0x07, 16
    1049                            .dwcfa  0x07, 17
    1050                            .dwcfa  0x07, 18
    1051                            .dwcfa  0x07, 19
    1052                            .dwcfa  0x07, 20
    1053                            .dwcfa  0x07, 21
    1054                            .dwcfa  0x07, 22
    1055                            .dwcfa  0x07, 23
    1056                            .dwcfa  0x07, 24
    1057                            .dwcfa  0x07, 25
    1058                            .dwcfa  0x08, 26
    1059                            .dwcfa  0x08, 27
    1060                            .dwcfa  0x08, 28
    1061                            .dwcfa  0x08, 29
    1062                            .dwcfa  0x08, 30
    1063                            .dwcfa  0x08, 31
    1064                            .dwcfa  0x08, 32
    1065                            .dwcfa  0x07, 33
    1066                            .dwcfa  0x07, 34
    1067                            .dwcfa  0x07, 35
    1068                            .dwcfa  0x07, 36
    1069                            .dwcfa  0x07, 37
    1070                            .dwcfa  0x07, 38
    1071                            .dwcfa  0x07, 39
    1072                            .dwcfa  0x07, 40
    1073                            .dwcfa  0x07, 41
    1074                            .dwcfa  0x07, 42
    1075                            .dwcfa  0x07, 43
    1076                            .dwcfa  0x07, 44
    1077                            .dwcfa  0x07, 45
    1078                            .dwcfa  0x07, 46
    1079                            .dwcfa  0x07, 47
    1080                            .dwcfa  0x07, 48
    1081                            .dwcfa  0x07, 49
    1082                            .dwcfa  0x07, 50
    1083                            .dwcfa  0x07, 51
    1084                            .dwcfa  0x07, 52
    1085                            .dwcfa  0x07, 53
    1086                            .dwcfa  0x07, 54
