TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 31 17:05:35 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

     374                            .dwendtag DW$T$63
     375                    
     376                    
     377                    DW$T$65 .dwtag  DW_TAG_subroutine_type
     378                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
     379                    
     380                    DW$T$67 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
     381                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
     382                            .dwattr DW$T$67, DW_AT_byte_size(0x06)
     383                    DW$35   .dwtag  DW_TAG_subrange_type
     384                            .dwattr DW$35, DW_AT_upper_bound(0x05)
     385                            .dwendtag DW$T$67
     386                    
     387                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     388                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     389                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     390                    
     391                    DW$T$70 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     392                            .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
     393                    DW$36   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     394                    DW$37   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE    9

     395                    DW$38   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     396                            .dwendtag DW$T$70
     397                    
     398                    
     399                    DW$T$74 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     400                            .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
     401                    DW$39   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$73)
     402                            .dwendtag DW$T$74
     403                    
     404                    
     405                    DW$T$77 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     406                            .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
     407                    DW$40   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$76)
     408                    DW$41   .dwtag  DW_TAG_unspecified_parameters
     409                            .dwendtag DW$T$77
     410                    
     411                    
     412                    DW$T$79 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     413                            .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
     414                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
     415                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     416                    
     417                    DW$T$81 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     418                            .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
     419                    DW$42   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$62)
     420                    DW$43   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     421                    DW$44   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     422                            .dwendtag DW$T$81
     423                    
     424                    DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle"), DW_AT_type(*DW$T$61)
     425                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
     426                    DW$T$73 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$72)
     427                            .dwattr DW$T$73, DW_AT_address_class(0x20)
     428                    DW$T$76 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
     429                            .dwattr DW$T$76, DW_AT_address_class(0x20)
     430                    DW$T$86 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$85)
     431                            .dwattr DW$T$86, DW_AT_address_class(0x20)
     432                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     433                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     434                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
     435                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     436                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     437                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     438                    DW$T$61 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
     439                            .dwattr DW$T$61, DW_AT_address_class(0x20)
     440                    DW$T$43 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     441                            .dwattr DW$T$43, DW_AT_encoding(DW_ATE_signed_char)
     442                            .dwattr DW$T$43, DW_AT_byte_size(0x01)
     443                    DW$T$72 .dwtag  DW_TAG_const_type
     444                            .dwattr DW$T$72, DW_AT_type(*DW$T$43)
     445                    DW$T$85 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$60)
     446                            .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
     447                    
     448                    DW$T$22 .dwtag  DW_TAG_structure_type
     449                            .dwattr DW$T$22, DW_AT_byte_size(0x0c)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   10

     450                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     451                            .dwattr DW$45, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     452                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     453                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     454                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     455                            .dwattr DW$46, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     456                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     457                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     458                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     459                            .dwattr DW$47, DW_AT_name("pinAllocMask"), DW_AT_symbol_name("_pinAllocMask")
     460                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     461                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     462                            .dwendtag DW$T$22
     463                    
     464                    
     465                    DW$T$60 .dwtag  DW_TAG_structure_type
     466                            .dwattr DW$T$60, DW_AT_name("dsp_tsk_totalreg_t")
     467                            .dwattr DW$T$60, DW_AT_byte_size(0x138)
     468                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
     469                            .dwattr DW$48, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
     470                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     471                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     472                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     473                            .dwattr DW$49, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
     474                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     475                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     476                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
     477                            .dwattr DW$50, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
     478                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     479                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     480                    DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
     481                            .dwattr DW$51, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
     482                            .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     483                            .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     484                    DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
     485                            .dwattr DW$52, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
     486                            .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     487                            .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     488                    DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
     489                            .dwattr DW$53, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
     490                            .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     491                            .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     492                    DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
     493                            .dwattr DW$54, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
     494                            .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
     495                            .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     496                    DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
     497                            .dwattr DW$55, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
     498                            .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
     499                            .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     500                    DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
     501                            .dwattr DW$56, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
     502                            .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
     503                            .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     504                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   11

     505                            .dwattr DW$57, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
     506                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
     507                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     508                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
     509                            .dwattr DW$58, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
     510                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
     511                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     512                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
     513                            .dwattr DW$59, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg"
     514                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
     515                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     516                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
     517                            .dwattr DW$60, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
     518                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
     519                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     520                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     521                            .dwattr DW$61, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
     522                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
     523                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     524                            .dwendtag DW$T$60
     525                    
     526                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     527                            .dwattr DW$T$21, DW_AT_address_class(0x20)
     528                    DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$23)
     529                            .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
     530                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$24)
     531                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     532                    DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$27)
     533                            .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     534                    DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$29)
     535                            .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     536                    DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$30)
     537                            .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
     538                    DW$T$51 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$32)
     539                            .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     540                    DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$33)
     541                            .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
     542                    DW$T$53 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$34)
     543                            .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
     544                    DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$36)
     545                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
     546                    DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$38)
     547                            .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
     548                    DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$41)
     549                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
     550                    DW$T$57 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$42)
     551                            .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
     552                    DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$45)
     553                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
     554                    DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$46)
     555                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
     556                    DW$T$20 .dwtag  DW_TAG_volatile_type
     557                            .dwattr DW$T$20, DW_AT_type(*DW$T$19)
     558                    
     559                    DW$T$23 .dwtag  DW_TAG_structure_type
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   12

     560                            .dwattr DW$T$23, DW_AT_name("dsp_tsk_control_t")
     561                            .dwattr DW$T$23, DW_AT_byte_size(0x0c)
     562                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     563                            .dwattr DW$62, DW_AT_name("tsk_img_control"), DW_AT_symbol_name("_tsk_img_control")
     564                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     565                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     566                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     567                            .dwattr DW$63, DW_AT_name("tsk_img_control_count"), DW_AT_symbol_name("_tsk_img_control_count"
     568                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     569                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     570                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     571                            .dwattr DW$64, DW_AT_name("tsk_alg_control"), DW_AT_symbol_name("_tsk_alg_control")
     572                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     573                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     574                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     575                            .dwattr DW$65, DW_AT_name("tsk_alg_control_count"), DW_AT_symbol_name("_tsk_alg_control_count"
     576                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     577                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     578                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     579                            .dwattr DW$66, DW_AT_name("tsk_adc_value"), DW_AT_symbol_name("_tsk_adc_value")
     580                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     581                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     582                            .dwendtag DW$T$23
     583                    
     584                    
     585                    DW$T$24 .dwtag  DW_TAG_structure_type
     586                            .dwattr DW$T$24, DW_AT_name("dsp_tsk_policy_t")
     587                            .dwattr DW$T$24, DW_AT_byte_size(0x0c)
     588                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     589                            .dwattr DW$67, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
     590                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     591                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     592                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     593                            .dwattr DW$68, DW_AT_name("try_count"), DW_AT_symbol_name("_try_count")
     594                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     595                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     596                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     597                            .dwattr DW$69, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
     598                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     599                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     600                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     601                            .dwattr DW$70, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
     602                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     603                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     604                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     605                            .dwattr DW$71, DW_AT_name("policy_flag"), DW_AT_symbol_name("_policy_flag")
     606                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     607                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     608                            .dwendtag DW$T$24
     609                    
     610                    
     611                    DW$T$27 .dwtag  DW_TAG_structure_type
     612                            .dwattr DW$T$27, DW_AT_name("dsp_tsk_flag_t")
     613                            .dwattr DW$T$27, DW_AT_byte_size(0x1c)
     614                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   13

     615                            .dwattr DW$72, DW_AT_name("tsk_img_resp"), DW_AT_symbol_name("_tsk_img_resp")
     616                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     617                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     618                    DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     619                            .dwattr DW$73, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
     620                            .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     621                            .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     622                    DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     623                            .dwattr DW$74, DW_AT_name("tsk_alg_status_count"), DW_AT_symbol_name("_tsk_alg_status_count")
     624                            .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     625                            .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     626                    DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     627                            .dwattr DW$75, DW_AT_name("req_tsk_alg_control"), DW_AT_symbol_name("_req_tsk_alg_control")
     628                            .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     629                            .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     630                    DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     631                            .dwattr DW$76, DW_AT_name("req_tsk_alg_control_count"), DW_AT_symbol_name("_req_tsk_alg_contro
     632                            .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     633                            .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     634                    DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     635                            .dwattr DW$77, DW_AT_name("left_data"), DW_AT_symbol_name("_left_data")
     636                            .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     637                            .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     638                    DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     639                            .dwattr DW$78, DW_AT_name("right_data"), DW_AT_symbol_name("_right_data")
     640                            .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     641                            .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     642                            .dwendtag DW$T$27
     643                    
     644                    
     645                    DW$T$29 .dwtag  DW_TAG_structure_type
     646                            .dwattr DW$T$29, DW_AT_name("dsp_algorithm_result_t")
     647                            .dwattr DW$T$29, DW_AT_byte_size(0x20)
     648                    DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     649                            .dwattr DW$79, DW_AT_name("result_type"), DW_AT_symbol_name("_result_type")
     650                            .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     651                            .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     652                    DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     653                            .dwattr DW$80, DW_AT_name("policy"), DW_AT_symbol_name("_policy")
     654                            .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     655                            .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     656                    DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     657                            .dwattr DW$81, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
     658                            .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     659                            .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     660                    DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     661                            .dwattr DW$82, DW_AT_name("left_result"), DW_AT_symbol_name("_left_result")
     662                            .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     663                            .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     664                    DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     665                            .dwattr DW$83, DW_AT_name("right_result"), DW_AT_symbol_name("_right_result")
     666                            .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     667                            .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     668                    DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     669                            .dwattr DW$84, DW_AT_name("result_data"), DW_AT_symbol_name("_result_data")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   14

     670                            .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     671                            .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     672                            .dwendtag DW$T$29
     673                    
     674                    
     675                    DW$T$30 .dwtag  DW_TAG_structure_type
     676                            .dwattr DW$T$30, DW_AT_name("dsp_algorithm_sound_t")
     677                            .dwattr DW$T$30, DW_AT_byte_size(0x08)
     678                    DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     679                            .dwattr DW$85, DW_AT_name("sound_value"), DW_AT_symbol_name("_sound_value")
     680                            .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                            .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     682                    DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     683                            .dwattr DW$86, DW_AT_name("sound_count"), DW_AT_symbol_name("_sound_count")
     684                            .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     685                            .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     686                            .dwendtag DW$T$30
     687                    
     688                    
     689                    DW$T$32 .dwtag  DW_TAG_structure_type
     690                            .dwattr DW$T$32, DW_AT_name("dsp_algorithm_devparam_t")
     691                            .dwattr DW$T$32, DW_AT_byte_size(0x54)
     692                    DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     693                            .dwattr DW$87, DW_AT_name("param_count"), DW_AT_symbol_name("_param_count")
     694                            .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                            .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     696                    DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
     697                            .dwattr DW$88, DW_AT_name("device_param"), DW_AT_symbol_name("_device_param")
     698                            .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     699                            .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     700                            .dwendtag DW$T$32
     701                    
     702                    
     703                    DW$T$33 .dwtag  DW_TAG_structure_type
     704                            .dwattr DW$T$33, DW_AT_name("dsp_tsk_watchdog_t")
     705                            .dwattr DW$T$33, DW_AT_byte_size(0x08)
     706                    DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     707                            .dwattr DW$89, DW_AT_name("tsk_img_watchdog"), DW_AT_symbol_name("_tsk_img_watchdog")
     708                            .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709                            .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     710                    DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     711                            .dwattr DW$90, DW_AT_name("tsk_alg_watchdog"), DW_AT_symbol_name("_tsk_alg_watchdog")
     712                            .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     713                            .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     714                            .dwendtag DW$T$33
     715                    
     716                    
     717                    DW$T$34 .dwtag  DW_TAG_structure_type
     718                            .dwattr DW$T$34, DW_AT_name("dsp_icon_t")
     719                            .dwattr DW$T$34, DW_AT_byte_size(0x14)
     720                    DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     721                            .dwattr DW$91, DW_AT_name("req_icon_control"), DW_AT_symbol_name("_req_icon_control")
     722                            .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723                            .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
     724                    DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   15

     725                            .dwattr DW$92, DW_AT_name("req_icon_id"), DW_AT_symbol_name("_req_icon_id")
     726                            .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     727                            .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
     728                    DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     729                            .dwattr DW$93, DW_AT_name("dsp_icon_state"), DW_AT_symbol_name("_dsp_icon_state")
     730                            .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     731                            .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
     732                    DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     733                            .dwattr DW$94, DW_AT_name("icon_data"), DW_AT_symbol_name("_icon_data")
     734                            .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     735                            .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
     736                            .dwendtag DW$T$34
     737                    
     738                    
     739                    DW$T$36 .dwtag  DW_TAG_structure_type
     740                            .dwattr DW$T$36, DW_AT_name("dsp_mac_t")
     741                            .dwattr DW$T$36, DW_AT_byte_size(0x08)
     742                    DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
     743                            .dwattr DW$95, DW_AT_name("mac_val"), DW_AT_symbol_name("_mac_val")
     744                            .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     745                            .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     746                            .dwendtag DW$T$36
     747                    
     748                    
     749                    DW$T$38 .dwtag  DW_TAG_structure_type
     750                            .dwattr DW$T$38, DW_AT_name("dsp_copyimg_t")
     751                            .dwattr DW$T$38, DW_AT_byte_size(0x08)
     752                    DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
     753                            .dwattr DW$96, DW_AT_name("left_param"), DW_AT_symbol_name("_left_param")
     754                            .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     755                            .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     756                    DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
     757                            .dwattr DW$97, DW_AT_name("right_param"), DW_AT_symbol_name("_right_param")
     758                            .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     759                            .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     760                            .dwendtag DW$T$38
     761                    
     762                    
     763                    DW$T$41 .dwtag  DW_TAG_structure_type
     764                            .dwattr DW$T$41, DW_AT_name("dsp_testimg_t")
     765                            .dwattr DW$T$41, DW_AT_byte_size(0x28)
     766                    DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
     767                            .dwattr DW$98, DW_AT_name("left_eye"), DW_AT_symbol_name("_left_eye")
     768                            .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769                            .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     770                    DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
     771                            .dwattr DW$99, DW_AT_name("right_eye"), DW_AT_symbol_name("_right_eye")
     772                            .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     773                            .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     774                            .dwendtag DW$T$41
     775                    
     776                    
     777                    DW$T$42 .dwtag  DW_TAG_structure_type
     778                            .dwattr DW$T$42, DW_AT_name("dsp_distance_ctrl_t")
     779                            .dwattr DW$T$42, DW_AT_byte_size(0x10)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   16

     780                    DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     781                            .dwattr DW$100, DW_AT_name("adc_noperson"), DW_AT_symbol_name("_adc_noperson")
     782                            .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     783                            .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     784                    DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     785                            .dwattr DW$101, DW_AT_name("adc_toofar"), DW_AT_symbol_name("_adc_toofar")
     786                            .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     787                            .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     788                    DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     789                            .dwattr DW$102, DW_AT_name("adc_ok"), DW_AT_symbol_name("_adc_ok")
     790                            .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     791                            .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     792                    DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     793                            .dwattr DW$103, DW_AT_name("adc_tooclose"), DW_AT_symbol_name("_adc_tooclose")
     794                            .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     795                            .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     796                    DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     797                            .dwattr DW$104, DW_AT_name("adc_smooth"), DW_AT_symbol_name("_adc_smooth")
     798                            .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     799                            .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     800                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     801                            .dwattr DW$105, DW_AT_name("adc_noperson_disp"), DW_AT_symbol_name("_adc_noperson_disp")
     802                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     803                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     804                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     805                            .dwattr DW$106, DW_AT_name("adc_play_sound"), DW_AT_symbol_name("_adc_play_sound")
     806                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     807                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     808                    DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
     809                            .dwattr DW$107, DW_AT_name("adc_nouse"), DW_AT_symbol_name("_adc_nouse")
     810                            .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     811                            .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     812                            .dwendtag DW$T$42
     813                    
     814                    
     815                    DW$T$45 .dwtag  DW_TAG_structure_type
     816                            .dwattr DW$T$45, DW_AT_name("dsp_buildtime_t")
     817                            .dwattr DW$T$45, DW_AT_byte_size(0x20)
     818                    DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
     819                            .dwattr DW$108, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
     820                            .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     821                            .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     822                            .dwendtag DW$T$45
     823                    
     824                    
     825                    DW$T$46 .dwtag  DW_TAG_structure_type
     826                            .dwattr DW$T$46, DW_AT_name("switch_control_t")
     827                            .dwattr DW$T$46, DW_AT_byte_size(0x04)
     828                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     829                            .dwattr DW$109, DW_AT_name("ctrls"), DW_AT_symbol_name("_ctrls")
     830                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     832                            .dwendtag DW$T$46
     833                    
     834                    DW$T$3  .dwtag  DW_TAG_pointer_type
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   17

     835                            .dwattr DW$T$3, DW_AT_address_class(0x20)
     836                    
     837                    DW$T$35 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
     838                            .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     839                            .dwattr DW$T$35, DW_AT_byte_size(0x08)
     840                    DW$110  .dwtag  DW_TAG_subrange_type
     841                            .dwattr DW$110, DW_AT_upper_bound(0x07)
     842                            .dwendtag DW$T$35
     843                    
     844                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     845                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     846                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     847                    
     848                    DW$T$31 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
     849                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     850                            .dwattr DW$T$31, DW_AT_byte_size(0x50)
     851                    DW$111  .dwtag  DW_TAG_subrange_type
     852                            .dwattr DW$111, DW_AT_upper_bound(0x13)
     853                            .dwendtag DW$T$31
     854                    
     855                    DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_memory_t"), DW_AT_type(*DW$T$25)
     856                            .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
     857                    DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     858                            .dwattr DW$T$37, DW_AT_address_class(0x20)
     859                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_img_t"), DW_AT_type(*DW$T$39)
     860                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     861                    
     862                    DW$T$44 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$43)
     863                            .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     864                            .dwattr DW$T$44, DW_AT_byte_size(0x20)
     865                    DW$112  .dwtag  DW_TAG_subrange_type
     866                            .dwattr DW$112, DW_AT_upper_bound(0x1f)
     867                            .dwendtag DW$T$44
     868                    
     869                    
     870                    DW$T$25 .dwtag  DW_TAG_structure_type
     871                            .dwattr DW$T$25, DW_AT_name("dsp_tsk_memory_t")
     872                            .dwattr DW$T$25, DW_AT_byte_size(0x08)
     873                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     874                            .dwattr DW$113, DW_AT_name("dataptr_len"), DW_AT_symbol_name("_dataptr_len")
     875                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     877                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     878                            .dwattr DW$114, DW_AT_name("data_ptr"), DW_AT_symbol_name("_data_ptr")
     879                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     880                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     881                            .dwendtag DW$T$25
     882                    
     883                    
     884                    DW$T$39 .dwtag  DW_TAG_structure_type
     885                            .dwattr DW$T$39, DW_AT_name("dsp_img_t")
     886                            .dwattr DW$T$39, DW_AT_byte_size(0x14)
     887                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     888                            .dwattr DW$115, DW_AT_name("tag_arm"), DW_AT_symbol_name("_tag_arm")
     889                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   18

     890                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     891                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     892                            .dwattr DW$116, DW_AT_name("tag_dsp"), DW_AT_symbol_name("_tag_dsp")
     893                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     894                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     895                    DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     896                            .dwattr DW$117, DW_AT_name("type"), DW_AT_symbol_name("_type")
     897                            .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     898                            .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
     899                    DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     900                            .dwattr DW$118, DW_AT_name("img_data"), DW_AT_symbol_name("_img_data")
     901                            .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     902                            .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
     903                            .dwendtag DW$T$39
     904                    
     905                    
     906                            .dwattr DW$25, DW_AT_external(0x01)
     907                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     908                    
     909                    ;***************************************************************
     910                    ;* DWARF CIE ENTRIES                                           *
     911                    ;***************************************************************
     912                    
     913                    DW$CIE  .dwcie 1, 126
     914                            .dwcfa  0x0c, 31, 0
     915                            .dwcfa  0x07, 0
     916                            .dwcfa  0x07, 1
     917                            .dwcfa  0x07, 2
     918                            .dwcfa  0x07, 3
     919                            .dwcfa  0x07, 4
     920                            .dwcfa  0x07, 5
     921                            .dwcfa  0x07, 6
     922                            .dwcfa  0x07, 7
     923                            .dwcfa  0x07, 8
     924                            .dwcfa  0x07, 9
     925                            .dwcfa  0x08, 10
     926                            .dwcfa  0x08, 11
     927                            .dwcfa  0x08, 12
     928                            .dwcfa  0x08, 13
     929                            .dwcfa  0x08, 14
     930                            .dwcfa  0x08, 15
     931                            .dwcfa  0x07, 16
     932                            .dwcfa  0x07, 17
     933                            .dwcfa  0x07, 18
     934                            .dwcfa  0x07, 19
     935                            .dwcfa  0x07, 20
     936                            .dwcfa  0x07, 21
     937                            .dwcfa  0x07, 22
     938                            .dwcfa  0x07, 23
     939                            .dwcfa  0x07, 24
     940                            .dwcfa  0x07, 25
     941                            .dwcfa  0x08, 26
     942                            .dwcfa  0x08, 27
     943                            .dwcfa  0x08, 28
     944                            .dwcfa  0x08, 29
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:36 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8842                          PAGE   19

     945                            .dwcfa  0x08, 30
     946                            .dwcfa  0x08, 31
     947                            .dwcfa  0x08, 32
     948                            .dwcfa  0x07, 33
     949                            .dwcfa  0x07, 34
     950                            .dwcfa  0x07, 35
     951                            .dwcfa  0x07, 36
     952                            .dwcfa  0x07, 37
     953                            .dwcfa  0x07, 38
     954                            .dwcfa  0x07, 39
     955                            .dwcfa  0x07, 40
     956                            .dwcfa  0x07, 41
     957                            .dwcfa  0x07, 42
     958                            .dwcfa  0x07, 43
     959                            .dwcfa  0x07, 44
     960                            .dwcfa  0x07, 45
     961                            .dwcfa  0x07, 46
     962                            .dwcfa  0x07, 47
     963                            .dwcfa  0x07, 48
     964                            .dwcfa  0x07, 49
     965                            .dwcfa  0x07, 50
     966                            .dwcfa  0x07, 51
     967                            .dwcfa  0x07, 52
     968                            .dwcfa  0x07, 53
     969                            .dwcfa  0x07, 54
