TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 31 17:05:39 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    8190                    DW$T$12 .dwtag  DW_TAG_base_type, DW_AT_name("long")
    8191                            .dwattr DW$T$12, DW_AT_encoding(DW_ATE_signed)
    8192                            .dwattr DW$T$12, DW_AT_byte_size(0x08)
    8193                            .dwattr DW$T$12, DW_AT_bit_size(0x28)
    8194                            .dwattr DW$T$12, DW_AT_bit_offset(0x18)
    8195                    DW$T$114        .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Handle"), DW_AT_type(*DW$T$19)
    8196                            .dwattr DW$T$114, DW_AT_language(DW_LANG_C)
    8197                    DW$T$178        .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
    8198                            .dwattr DW$T$178, DW_AT_language(DW_LANG_C)
    8199                    DW$T$133        .dwtag  DW_TAG_typedef, DW_AT_name("pIrisImageInfo"), DW_AT_type(*DW$T$132)
    8200                            .dwattr DW$T$133, DW_AT_language(DW_LANG_C)
    8201                    
    8202                    DW$T$180        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$179)
    8203                            .dwattr DW$T$180, DW_AT_language(DW_LANG_C)
    8204                            .dwattr DW$T$180, DW_AT_byte_size(0x1e0)
    8205                    DW$340  .dwtag  DW_TAG_subrange_type
    8206                            .dwattr DW$340, DW_AT_upper_bound(0x03)
    8207                            .dwendtag DW$T$180
    8208                    
    8209                    DW$T$150        .dwtag  DW_TAG_typedef, DW_AT_name("MatchInput"), DW_AT_type(*DW$T$24)
    8210                            .dwattr DW$T$150, DW_AT_language(DW_LANG_C)
    8211                    DW$T$152        .dwtag  DW_TAG_typedef, DW_AT_name("pMatchOutput"), DW_AT_type(*DW$T$151)
    8212                            .dwattr DW$T$152, DW_AT_language(DW_LANG_C)
    8213                    DW$T$131        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$130)
    8214                            .dwattr DW$T$131, DW_AT_address_class(0x20)
    8215                    DW$T$169        .dwtag  DW_TAG_typedef, DW_AT_name("IMAGE_MSG"), DW_AT_type(*DW$T$168)
    8216                            .dwattr DW$T$169, DW_AT_language(DW_LANG_C)
    8217                    DW$T$119        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
    8218                            .dwattr DW$T$119, DW_AT_address_class(0x20)
    8219                    DW$T$120        .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$119)
    8220                            .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
    8221                    DW$T$184        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$183)
    8222                            .dwattr DW$T$184, DW_AT_address_class(0x20)
    8223                    DW$T$185        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_reg_t"), DW_AT_type(*DW$T$88)
    8224                            .dwattr DW$T$185, DW_AT_language(DW_LANG_C)
    8225                    DW$T$187        .dwtag  DW_TAG_typedef, DW_AT_name("PBITMAPFILEHEADER"), DW_AT_type(*DW$T$186)
    8226                            .dwattr DW$T$187, DW_AT_language(DW_LANG_C)
    8227                    DW$T$189        .dwtag  DW_TAG_typedef, DW_AT_name("PBITMAPINFOHEADER"), DW_AT_type(*DW$T$188)
    8228                            .dwattr DW$T$189, DW_AT_language(DW_LANG_C)
    8229                    DW$T$191        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$190)
    8230                            .dwattr DW$T$191, DW_AT_address_class(0x20)
    8231                    DW$T$193        .dwtag  DW_TAG_typedef, DW_AT_name("RESULT_MSG"), DW_AT_type(*DW$T$192)
    8232                            .dwattr DW$T$193, DW_AT_language(DW_LANG_C)
    8233                    DW$T$195        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$194)
    8234                            .dwattr DW$T$195, DW_AT_address_class(0x20)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  153

    8235                    DW$T$196        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$101)
    8236                            .dwattr DW$T$196, DW_AT_address_class(0x20)
    8237                    DW$T$198        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$197)
    8238                            .dwattr DW$T$198, DW_AT_address_class(0x20)
    8239                    DW$T$200        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$199)
    8240                            .dwattr DW$T$200, DW_AT_address_class(0x20)
    8241                    DW$T$202        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$201)
    8242                            .dwattr DW$T$202, DW_AT_address_class(0x20)
    8243                    DW$T$104        .dwtag  DW_TAG_const_type
    8244                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    8245                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    8246                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    8247                    DW$T$90 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
    8248                            .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
    8249                    DW$T$140        .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    8250                            .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    8251                    
    8252                    DW$T$20 .dwtag  DW_TAG_structure_type
    8253                            .dwattr DW$T$20, DW_AT_name("QUE_Elem")
    8254                            .dwattr DW$T$20, DW_AT_byte_size(0x08)
    8255                    DW$341  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    8256                            .dwattr DW$341, DW_AT_name("next"), DW_AT_symbol_name("_next")
    8257                            .dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8258                            .dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
    8259                    DW$342  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    8260                            .dwattr DW$342, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
    8261                            .dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8262                            .dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
    8263                            .dwendtag DW$T$20
    8264                    
    8265                    DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    8266                            .dwattr DW$T$19, DW_AT_address_class(0x20)
    8267                    DW$T$132        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
    8268                            .dwattr DW$T$132, DW_AT_address_class(0x20)
    8269                    DW$T$179        .dwtag  DW_TAG_typedef, DW_AT_name("IrisImageInfo"), DW_AT_type(*DW$T$22)
    8270                            .dwattr DW$T$179, DW_AT_language(DW_LANG_C)
    8271                    
    8272                    DW$T$24 .dwtag  DW_TAG_structure_type
    8273                            .dwattr DW$T$24, DW_AT_name("MatchInputStruct")
    8274                            .dwattr DW$T$24, DW_AT_byte_size(0x10)
    8275                    DW$343  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8276                            .dwattr DW$343, DW_AT_name("findMode"), DW_AT_symbol_name("_findMode")
    8277                            .dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8278                            .dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
    8279                    DW$344  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8280                            .dwattr DW$344, DW_AT_name("matchTh"), DW_AT_symbol_name("_matchTh")
    8281                            .dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8282                            .dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
    8283                    DW$345  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    8284                            .dwattr DW$345, DW_AT_name("angRotate"), DW_AT_symbol_name("_angRotate")
    8285                            .dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8286                            .dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
    8287                    DW$346  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8288                            .dwattr DW$346, DW_AT_name("matchStrategy"), DW_AT_symbol_name("_matchStrategy")
    8289                            .dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  154

    8290                            .dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
    8291                            .dwendtag DW$T$24
    8292                    
    8293                    DW$T$151        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
    8294                            .dwattr DW$T$151, DW_AT_address_class(0x20)
    8295                    DW$T$130        .dwtag  DW_TAG_typedef, DW_AT_name("iris_code_t"), DW_AT_type(*DW$T$34)
    8296                            .dwattr DW$T$130, DW_AT_language(DW_LANG_C)
    8297                    DW$T$168        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    8298                            .dwattr DW$T$168, DW_AT_address_class(0x20)
    8299                    DW$T$57 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    8300                            .dwattr DW$T$57, DW_AT_encoding(DW_ATE_signed_char)
    8301                            .dwattr DW$T$57, DW_AT_byte_size(0x01)
    8302                    DW$T$183        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$74)
    8303                            .dwattr DW$T$183, DW_AT_language(DW_LANG_C)
    8304                    
    8305                    DW$T$88 .dwtag  DW_TAG_structure_type
    8306                            .dwattr DW$T$88, DW_AT_name("dsp_reg_t")
    8307                            .dwattr DW$T$88, DW_AT_byte_size(0xb4)
    8308                    DW$347  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    8309                            .dwattr DW$347, DW_AT_name("status_reg"), DW_AT_symbol_name("_status_reg")
    8310                            .dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8311                            .dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
    8312                    DW$348  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
    8313                            .dwattr DW$348, DW_AT_name("distance_reg"), DW_AT_symbol_name("_distance_reg")
    8314                            .dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8315                            .dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
    8316                    DW$349  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    8317                            .dwattr DW$349, DW_AT_name("policy_reg"), DW_AT_symbol_name("_policy_reg")
    8318                            .dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    8319                            .dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
    8320                    DW$350  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
    8321                            .dwattr DW$350, DW_AT_name("sound_reg"), DW_AT_symbol_name("_sound_reg")
    8322                            .dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    8323                            .dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
    8324                    DW$351  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    8325                            .dwattr DW$351, DW_AT_name("result_reg"), DW_AT_symbol_name("_result_reg")
    8326                            .dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8327                            .dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
    8328                    DW$352  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
    8329                            .dwattr DW$352, DW_AT_name("quality_value"), DW_AT_symbol_name("_quality_value")
    8330                            .dwattr DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    8331                            .dwattr DW$352, DW_AT_accessibility(DW_ACCESS_public)
    8332                    DW$353  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8333                            .dwattr DW$353, DW_AT_name("quality_count"), DW_AT_symbol_name("_quality_count")
    8334                            .dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    8335                            .dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
    8336                    DW$354  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8337                            .dwattr DW$354, DW_AT_name("alg_control_count"), DW_AT_symbol_name("_alg_control_count")
    8338                            .dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    8339                            .dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
    8340                    DW$355  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8341                            .dwattr DW$355, DW_AT_name("last_img_quality"), DW_AT_symbol_name("_last_img_quality")
    8342                            .dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    8343                            .dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
    8344                    DW$356  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  155

    8345                            .dwattr DW$356, DW_AT_name("last_icon_id"), DW_AT_symbol_name("_last_icon_id")
    8346                            .dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    8347                            .dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
    8348                    DW$357  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8349                            .dwattr DW$357, DW_AT_name("match_input_count"), DW_AT_symbol_name("_match_input_count")
    8350                            .dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    8351                            .dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
    8352                            .dwendtag DW$T$88
    8353                    
    8354                    DW$T$186        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$91)
    8355                            .dwattr DW$T$186, DW_AT_address_class(0x20)
    8356                    DW$T$188        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$93)
    8357                            .dwattr DW$T$188, DW_AT_address_class(0x20)
    8358                    DW$T$190        .dwtag  DW_TAG_typedef, DW_AT_name("RGBQUAD"), DW_AT_type(*DW$T$95)
    8359                            .dwattr DW$T$190, DW_AT_language(DW_LANG_C)
    8360                    DW$T$192        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$96)
    8361                            .dwattr DW$T$192, DW_AT_address_class(0x20)
    8362                    DW$T$194        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_iden_feature_t"), DW_AT_type(*DW$T$9
    8363                            .dwattr DW$T$194, DW_AT_language(DW_LANG_C)
    8364                    DW$T$101        .dwtag  DW_TAG_typedef, DW_AT_name("image_strategy_t"), DW_AT_type(*DW$T$98)
    8365                            .dwattr DW$T$101, DW_AT_language(DW_LANG_C)
    8366                    DW$T$197        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_data_header_t"), DW_AT_type(*DW$T$99)
    8367                            .dwattr DW$T$197, DW_AT_language(DW_LANG_C)
    8368                    DW$T$199        .dwtag  DW_TAG_typedef, DW_AT_name("match_option_t"), DW_AT_type(*DW$T$102)
    8369                            .dwattr DW$T$199, DW_AT_language(DW_LANG_C)
    8370                    DW$T$201        .dwtag  DW_TAG_typedef, DW_AT_name("match_result_t"), DW_AT_type(*DW$T$103)
    8371                            .dwattr DW$T$201, DW_AT_language(DW_LANG_C)
    8372                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    8373                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    8374                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    8375                    
    8376                    DW$T$87 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    8377                            .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    8378                            .dwattr DW$T$87, DW_AT_byte_size(0x28)
    8379                    DW$358  .dwtag  DW_TAG_subrange_type
    8380                            .dwattr DW$358, DW_AT_upper_bound(0x09)
    8381                            .dwendtag DW$T$87
    8382                    
    8383                    DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    8384                            .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    8385                            .dwattr DW$T$16, DW_AT_byte_size(0x04)
    8386                    DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$16)
    8387                            .dwattr DW$T$23, DW_AT_address_class(0x20)
    8388                    
    8389                    DW$T$22 .dwtag  DW_TAG_structure_type
    8390                            .dwattr DW$T$22, DW_AT_name("IrisImageInfoStruct")
    8391                            .dwattr DW$T$22, DW_AT_byte_size(0x78)
    8392                    DW$359  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8393                            .dwattr DW$359, DW_AT_name("imageH"), DW_AT_symbol_name("_imageH")
    8394                            .dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8395                            .dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
    8396                    DW$360  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8397                            .dwattr DW$360, DW_AT_name("imageW"), DW_AT_symbol_name("_imageW")
    8398                            .dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8399                            .dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  156

    8400                    DW$361  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    8401                            .dwattr DW$361, DW_AT_name("imageData"), DW_AT_symbol_name("_imageData")
    8402                            .dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8403                            .dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
    8404                    DW$362  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8405                            .dwattr DW$362, DW_AT_name("locMethod"), DW_AT_symbol_name("_locMethod")
    8406                            .dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8407                            .dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
    8408                    DW$363  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8409                            .dwattr DW$363, DW_AT_name("ifSpoofDetect"), DW_AT_symbol_name("_ifSpoofDetect")
    8410                            .dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8411                            .dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
    8412                    DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8413                            .dwattr DW$364, DW_AT_name("processStatus"), DW_AT_symbol_name("_processStatus")
    8414                            .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8415                            .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    8416                    DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    8417                            .dwattr DW$365, DW_AT_name("locImage"), DW_AT_symbol_name("_locImage")
    8418                            .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8419                            .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    8420                    DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8421                            .dwattr DW$366, DW_AT_name("pupilRow"), DW_AT_symbol_name("_pupilRow")
    8422                            .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8423                            .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    8424                    DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8425                            .dwattr DW$367, DW_AT_name("pupilCol"), DW_AT_symbol_name("_pupilCol")
    8426                            .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8427                            .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    8428                    DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8429                            .dwattr DW$368, DW_AT_name("pupilRadius"), DW_AT_symbol_name("_pupilRadius")
    8430                            .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8431                            .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    8432                    DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8433                            .dwattr DW$369, DW_AT_name("irisRow"), DW_AT_symbol_name("_irisRow")
    8434                            .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8435                            .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    8436                    DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8437                            .dwattr DW$370, DW_AT_name("irisCol"), DW_AT_symbol_name("_irisCol")
    8438                            .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8439                            .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    8440                    DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8441                            .dwattr DW$371, DW_AT_name("irisRadius"), DW_AT_symbol_name("_irisRadius")
    8442                            .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8443                            .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    8444                    DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8445                            .dwattr DW$372, DW_AT_name("pupilPos"), DW_AT_symbol_name("_pupilPos")
    8446                            .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8447                            .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    8448                    DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8449                            .dwattr DW$373, DW_AT_name("pupilVisiblePercent"), DW_AT_symbol_name("_pupilVisiblePercent")
    8450                            .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    8451                            .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    8452                    DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8453                            .dwattr DW$374, DW_AT_name("irisPos"), DW_AT_symbol_name("_irisPos")
    8454                            .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  157

    8455                            .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    8456                    DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8457                            .dwattr DW$375, DW_AT_name("irisVisiblePercent"), DW_AT_symbol_name("_irisVisiblePercent")
    8458                            .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    8459                            .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    8460                    DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8461                            .dwattr DW$376, DW_AT_name("overallVisiblePercent"), DW_AT_symbol_name("_overallVisiblePercent
    8462                            .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    8463                            .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    8464                    DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8465                            .dwattr DW$377, DW_AT_name("focusScore"), DW_AT_symbol_name("_focusScore")
    8466                            .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    8467                            .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    8468                    DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8469                            .dwattr DW$378, DW_AT_name("percentVisible"), DW_AT_symbol_name("_percentVisible")
    8470                            .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    8471                            .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    8472                    DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8473                            .dwattr DW$379, DW_AT_name("numValidBits"), DW_AT_symbol_name("_numValidBits")
    8474                            .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    8475                            .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    8476                    DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8477                            .dwattr DW$380, DW_AT_name("spoofValue"), DW_AT_symbol_name("_spoofValue")
    8478                            .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    8479                            .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    8480                    DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8481                            .dwattr DW$381, DW_AT_name("SNR"), DW_AT_symbol_name("_SNR")
    8482                            .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    8483                            .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    8484                    DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8485                            .dwattr DW$382, DW_AT_name("Saturation"), DW_AT_symbol_name("_Saturation")
    8486                            .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    8487                            .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    8488                    DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8489                            .dwattr DW$383, DW_AT_name("interlaceValue"), DW_AT_symbol_name("_interlaceValue")
    8490                            .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8491                            .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    8492                    DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8493                            .dwattr DW$384, DW_AT_name("reflectionRatioInROI"), DW_AT_symbol_name("_reflectionRatioInROI")
    8494                            .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    8495                            .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    8496                    DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8497                            .dwattr DW$385, DW_AT_name("reflectionRatioInImage"), DW_AT_symbol_name("_reflectionRatioInIma
    8498                            .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8499                            .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    8500                    DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8501                            .dwattr DW$386, DW_AT_name("QualityLevel"), DW_AT_symbol_name("_QualityLevel")
    8502                            .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    8503                            .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    8504                    DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    8505                            .dwattr DW$387, DW_AT_name("irisEnrTemplate"), DW_AT_symbol_name("_irisEnrTemplate")
    8506                            .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    8507                            .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    8508                    DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    8509                            .dwattr DW$388, DW_AT_name("irisRecTemplate"), DW_AT_symbol_name("_irisRecTemplate")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  158

    8510                            .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    8511                            .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    8512                            .dwendtag DW$T$22
    8513                    
    8514                    
    8515                    DW$T$27 .dwtag  DW_TAG_structure_type
    8516                            .dwattr DW$T$27, DW_AT_name("MatchOutputStruct")
    8517                            .dwattr DW$T$27, DW_AT_byte_size(0x28)
    8518                    DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    8519                            .dwattr DW$389, DW_AT_name("matchTh"), DW_AT_symbol_name("_matchTh")
    8520                            .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8521                            .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    8522                    DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8523                            .dwattr DW$390, DW_AT_name("matchNum"), DW_AT_symbol_name("_matchNum")
    8524                            .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8525                            .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    8526                    DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    8527                            .dwattr DW$391, DW_AT_name("matchIndex"), DW_AT_symbol_name("_matchIndex")
    8528                            .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8529                            .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    8530                    DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    8531                            .dwattr DW$392, DW_AT_name("matchScore"), DW_AT_symbol_name("_matchScore")
    8532                            .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8533                            .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    8534                    DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    8535                            .dwattr DW$393, DW_AT_name("matchConfidence"), DW_AT_symbol_name("_matchConfidence")
    8536                            .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8537                            .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    8538                    DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    8539                            .dwattr DW$394, DW_AT_name("matchAng"), DW_AT_symbol_name("_matchAng")
    8540                            .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8541                            .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    8542                    DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    8543                            .dwattr DW$395, DW_AT_name("validROIPercent"), DW_AT_symbol_name("_validROIPercent")
    8544                            .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8545                            .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    8546                    DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    8547                            .dwattr DW$396, DW_AT_name("matchLevel"), DW_AT_symbol_name("_matchLevel")
    8548                            .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8549                            .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    8550                    DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    8551                            .dwattr DW$397, DW_AT_name("matchedBits"), DW_AT_symbol_name("_matchedBits")
    8552                            .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8553                            .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    8554                    DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    8555                            .dwattr DW$398, DW_AT_name("validMatchBits"), DW_AT_symbol_name("_validMatchBits")
    8556                            .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8557                            .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    8558                            .dwendtag DW$T$27
    8559                    
    8560                    
    8561                    DW$T$34 .dwtag  DW_TAG_structure_type
    8562                            .dwattr DW$T$34, DW_AT_name("iris_code_t")
    8563                            .dwattr DW$T$34, DW_AT_byte_size(0x70)
    8564                    DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  159

    8565                            .dwattr DW$399, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
    8566                            .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8567                            .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    8568                    DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8569                            .dwattr DW$400, DW_AT_name("loc_result"), DW_AT_symbol_name("_loc_result")
    8570                            .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8571                            .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    8572                    DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8573                            .dwattr DW$401, DW_AT_name("loc_milli_sec"), DW_AT_symbol_name("_loc_milli_sec")
    8574                            .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8575                            .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    8576                    DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    8577                            .dwattr DW$402, DW_AT_name("loc"), DW_AT_symbol_name("_loc")
    8578                            .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8579                            .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    8580                    DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8581                            .dwattr DW$403, DW_AT_name("code_result"), DW_AT_symbol_name("_code_result")
    8582                            .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    8583                            .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    8584                    DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8585                            .dwattr DW$404, DW_AT_name("code_milli_sec"), DW_AT_symbol_name("_code_milli_sec")
    8586                            .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    8587                            .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    8588                    DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    8589                            .dwattr DW$405, DW_AT_name("code"), DW_AT_symbol_name("_code")
    8590                            .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    8591                            .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    8592                            .dwendtag DW$T$34
    8593                    
    8594                    
    8595                    DW$T$36 .dwtag  DW_TAG_structure_type
    8596                            .dwattr DW$T$36, DW_AT_name("dsp_image_msg_t")
    8597                            .dwattr DW$T$36, DW_AT_byte_size(0x34)
    8598                    DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    8599                            .dwattr DW$406, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    8600                            .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8601                            .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    8602                    DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8603                            .dwattr DW$407, DW_AT_name("img_saved_score_l"), DW_AT_symbol_name("_img_saved_score_l")
    8604                            .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8605                            .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    8606                    DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8607                            .dwattr DW$408, DW_AT_name("img_saved_score_r"), DW_AT_symbol_name("_img_saved_score_r")
    8608                            .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8609                            .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    8610                    DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    8611                            .dwattr DW$409, DW_AT_name("img_ptr_l"), DW_AT_symbol_name("_img_ptr_l")
    8612                            .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8613                            .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    8614                    DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    8615                            .dwattr DW$410, DW_AT_name("img_ptr_r"), DW_AT_symbol_name("_img_ptr_r")
    8616                            .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8617                            .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    8618                    DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8619                            .dwattr DW$411, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  160

    8620                            .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8621                            .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    8622                    DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8623                            .dwattr DW$412, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    8624                            .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8625                            .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    8626                    DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8627                            .dwattr DW$413, DW_AT_name("img_saved_count_l"), DW_AT_symbol_name("_img_saved_count_l")
    8628                            .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    8629                            .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    8630                    DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8631                            .dwattr DW$414, DW_AT_name("img_saved_count_r"), DW_AT_symbol_name("_img_saved_count_r")
    8632                            .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8633                            .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    8634                    DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8635                            .dwattr DW$415, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    8636                            .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    8637                            .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    8638                    DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8639                            .dwattr DW$416, DW_AT_name("data_type_l"), DW_AT_symbol_name("_data_type_l")
    8640                            .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    8641                            .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    8642                    DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8643                            .dwattr DW$417, DW_AT_name("data_type_r"), DW_AT_symbol_name("_data_type_r")
    8644                            .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    8645                            .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    8646                            .dwendtag DW$T$36
    8647                    
    8648                    
    8649                    DW$T$74 .dwtag  DW_TAG_structure_type
    8650                            .dwattr DW$T$74, DW_AT_name("dsp_tsk_totalreg_t")
    8651                            .dwattr DW$T$74, DW_AT_byte_size(0x138)
    8652                    DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    8653                            .dwattr DW$418, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
    8654                            .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8655                            .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    8656                    DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    8657                            .dwattr DW$419, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
    8658                            .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8659                            .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    8660                    DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    8661                            .dwattr DW$420, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
    8662                            .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8663                            .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    8664                    DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    8665                            .dwattr DW$421, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
    8666                            .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    8667                            .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    8668                    DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    8669                            .dwattr DW$422, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
    8670                            .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    8671                            .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    8672                    DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    8673                            .dwattr DW$423, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
    8674                            .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  161

    8675                            .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    8676                    DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    8677                            .dwattr DW$424, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
    8678                            .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    8679                            .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    8680                    DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    8681                            .dwattr DW$425, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
    8682                            .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    8683                            .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    8684                    DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    8685                            .dwattr DW$426, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
    8686                            .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    8687                            .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    8688                    DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    8689                            .dwattr DW$427, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
    8690                            .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    8691                            .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    8692                    DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    8693                            .dwattr DW$428, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
    8694                            .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    8695                            .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    8696                    DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
    8697                            .dwattr DW$429, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg
    8698                            .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    8699                            .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    8700                    DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    8701                            .dwattr DW$430, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
    8702                            .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    8703                            .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    8704                    DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    8705                            .dwattr DW$431, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
    8706                            .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    8707                            .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    8708                            .dwendtag DW$T$74
    8709                    
    8710                    DW$T$82 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_status_t"), DW_AT_type(*DW$T$75)
    8711                            .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    8712                    DW$T$83 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_t"), DW_AT_type(*DW$T$76)
    8713                            .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    8714                    DW$T$84 .dwtag  DW_TAG_typedef, DW_AT_name("policy_t"), DW_AT_type(*DW$T$78)
    8715                            .dwattr DW$T$84, DW_AT_language(DW_LANG_C)
    8716                    DW$T$85 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_sound_t"), DW_AT_type(*DW$T$79)
    8717                            .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
    8718                    DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_t"), DW_AT_type(*DW$T$81)
    8719                            .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    8720                    
    8721                    DW$T$91 .dwtag  DW_TAG_structure_type
    8722                            .dwattr DW$T$91, DW_AT_name("tagBITMAPFILEHEADER")
    8723                            .dwattr DW$T$91, DW_AT_byte_size(0x0c)
    8724                    DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    8725                            .dwattr DW$432, DW_AT_name("bfSize"), DW_AT_symbol_name("_bfSize")
    8726                            .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8727                            .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    8728                    DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    8729                            .dwattr DW$433, DW_AT_name("bfReserved1"), DW_AT_symbol_name("_bfReserved1")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  162

    8730                            .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8731                            .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    8732                    DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    8733                            .dwattr DW$434, DW_AT_name("bfReserved2"), DW_AT_symbol_name("_bfReserved2")
    8734                            .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    8735                            .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    8736                    DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    8737                            .dwattr DW$435, DW_AT_name("bfOffBits"), DW_AT_symbol_name("_bfOffBits")
    8738                            .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8739                            .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    8740                            .dwendtag DW$T$91
    8741                    
    8742                    
    8743                    DW$T$93 .dwtag  DW_TAG_structure_type
    8744                            .dwattr DW$T$93, DW_AT_name("tagBITMAPINFOHEADER")
    8745                            .dwattr DW$T$93, DW_AT_byte_size(0x28)
    8746                    DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    8747                            .dwattr DW$436, DW_AT_name("biSize"), DW_AT_symbol_name("_biSize")
    8748                            .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8749                            .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    8750                    DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    8751                            .dwattr DW$437, DW_AT_name("biWidth"), DW_AT_symbol_name("_biWidth")
    8752                            .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8753                            .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    8754                    DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    8755                            .dwattr DW$438, DW_AT_name("biHeight"), DW_AT_symbol_name("_biHeight")
    8756                            .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8757                            .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    8758                    DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    8759                            .dwattr DW$439, DW_AT_name("biPlanes"), DW_AT_symbol_name("_biPlanes")
    8760                            .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8761                            .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    8762                    DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    8763                            .dwattr DW$440, DW_AT_name("biBitCount"), DW_AT_symbol_name("_biBitCount")
    8764                            .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    8765                            .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    8766                    DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    8767                            .dwattr DW$441, DW_AT_name("biCompression"), DW_AT_symbol_name("_biCompression")
    8768                            .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8769                            .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    8770                    DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    8771                            .dwattr DW$442, DW_AT_name("biSizeImage"), DW_AT_symbol_name("_biSizeImage")
    8772                            .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8773                            .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    8774                    DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    8775                            .dwattr DW$443, DW_AT_name("biXPelsPerMeter"), DW_AT_symbol_name("_biXPelsPerMeter")
    8776                            .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8777                            .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    8778                    DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    8779                            .dwattr DW$444, DW_AT_name("biYPelsPerMeter"), DW_AT_symbol_name("_biYPelsPerMeter")
    8780                            .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8781                            .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    8782                    DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    8783                            .dwattr DW$445, DW_AT_name("biClrUsed"), DW_AT_symbol_name("_biClrUsed")
    8784                            .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  163

    8785                            .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    8786                    DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    8787                            .dwattr DW$446, DW_AT_name("biClrImportant"), DW_AT_symbol_name("_biClrImportant")
    8788                            .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    8789                            .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    8790                            .dwendtag DW$T$93
    8791                    
    8792                    
    8793                    DW$T$95 .dwtag  DW_TAG_structure_type
    8794                            .dwattr DW$T$95, DW_AT_name("tagRGBQUAD")
    8795                            .dwattr DW$T$95, DW_AT_byte_size(0x04)
    8796                    DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    8797                            .dwattr DW$447, DW_AT_name("rgbBlue"), DW_AT_symbol_name("_rgbBlue")
    8798                            .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8799                            .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    8800                    DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    8801                            .dwattr DW$448, DW_AT_name("rgbGreen"), DW_AT_symbol_name("_rgbGreen")
    8802                            .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    8803                            .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    8804                    DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    8805                            .dwattr DW$449, DW_AT_name("rgbRed"), DW_AT_symbol_name("_rgbRed")
    8806                            .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    8807                            .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    8808                    DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    8809                            .dwattr DW$450, DW_AT_name("rgbReserved"), DW_AT_symbol_name("_rgbReserved")
    8810                            .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    8811                            .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    8812                            .dwendtag DW$T$95
    8813                    
    8814                    
    8815                    DW$T$96 .dwtag  DW_TAG_structure_type
    8816                            .dwattr DW$T$96, DW_AT_name("dsp_result_msg_t")
    8817                            .dwattr DW$T$96, DW_AT_byte_size(0x1c)
    8818                    DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
    8819                            .dwattr DW$451, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    8820                            .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8821                            .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    8822                    DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8823                            .dwattr DW$452, DW_AT_name("result_left"), DW_AT_symbol_name("_result_left")
    8824                            .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8825                            .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    8826                    DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8827                            .dwattr DW$453, DW_AT_name("result_right"), DW_AT_symbol_name("_result_right")
    8828                            .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8829                            .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    8830                    DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8831                            .dwattr DW$454, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    8832                            .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8833                            .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    8834                    DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8835                            .dwattr DW$455, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    8836                            .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8837                            .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    8838                    DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8839                            .dwattr DW$456, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  164

    8840                            .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8841                            .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    8842                            .dwendtag DW$T$96
    8843                    
    8844                    
    8845                    DW$T$97 .dwtag  DW_TAG_structure_type
    8846                            .dwattr DW$T$97, DW_AT_name("dsp_algorithm_iden_feature_t")
    8847                            .dwattr DW$T$97, DW_AT_byte_size(0x10)
    8848                    DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8849                            .dwattr DW$457, DW_AT_name("single_feature_len"), DW_AT_symbol_name("_single_feature_len")
    8850                            .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8851                            .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    8852                    DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8853                            .dwattr DW$458, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    8854                            .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8855                            .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    8856                    DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    8857                            .dwattr DW$459, DW_AT_name("iden_feature_data"), DW_AT_symbol_name("_iden_feature_data")
    8858                            .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8859                            .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    8860                            .dwendtag DW$T$97
    8861                    
    8862                    
    8863                    DW$T$98 .dwtag  DW_TAG_structure_type
    8864                            .dwattr DW$T$98, DW_AT_name("image_strategy_t")
    8865                            .dwattr DW$T$98, DW_AT_byte_size(0x08)
    8866                    DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8867                            .dwattr DW$460, DW_AT_name("locMethod"), DW_AT_symbol_name("_locMethod")
    8868                            .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8869                            .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    8870                    DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8871                            .dwattr DW$461, DW_AT_name("ifSpoofDetect"), DW_AT_symbol_name("_ifSpoofDetect")
    8872                            .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8873                            .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    8874                            .dwendtag DW$T$98
    8875                    
    8876                    
    8877                    DW$T$99 .dwtag  DW_TAG_structure_type
    8878                            .dwattr DW$T$99, DW_AT_name("dsp_result_data_header_t")
    8879                            .dwattr DW$T$99, DW_AT_byte_size(0x0c)
    8880                    DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8881                            .dwattr DW$462, DW_AT_name("result_count"), DW_AT_symbol_name("_result_count")
    8882                            .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8883                            .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    8884                    DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    8885                            .dwattr DW$463, DW_AT_name("result_byte_len"), DW_AT_symbol_name("_result_byte_len")
    8886                            .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8887                            .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    8888                    DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    8889                            .dwattr DW$464, DW_AT_name("result_chksum"), DW_AT_symbol_name("_result_chksum")
    8890                            .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8891                            .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    8892                    DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    8893                            .dwattr DW$465, DW_AT_name("algorithm_version"), DW_AT_symbol_name("_algorithm_version")
    8894                            .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  165

    8895                            .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    8896                            .dwendtag DW$T$99
    8897                    
    8898                    
    8899                    DW$T$102        .dwtag  DW_TAG_structure_type
    8900                            .dwattr DW$T$102, DW_AT_name("match_option_t")
    8901                            .dwattr DW$T$102, DW_AT_byte_size(0x1c)
    8902                    DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8903                            .dwattr DW$466, DW_AT_name("findMode"), DW_AT_symbol_name("_findMode")
    8904                            .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8905                            .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    8906                    DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8907                            .dwattr DW$467, DW_AT_name("matchTh"), DW_AT_symbol_name("_matchTh")
    8908                            .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8909                            .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    8910                    DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
    8911                            .dwattr DW$468, DW_AT_name("angRotate"), DW_AT_symbol_name("_angRotate")
    8912                            .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8913                            .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    8914                    DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8915                            .dwattr DW$469, DW_AT_name("matchStrategy"), DW_AT_symbol_name("_matchStrategy")
    8916                            .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8917                            .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    8918                    DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
    8919                            .dwattr DW$470, DW_AT_name("imageStrategy"), DW_AT_symbol_name("_imageStrategy")
    8920                            .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8921                            .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    8922                            .dwendtag DW$T$102
    8923                    
    8924                    
    8925                    DW$T$103        .dwtag  DW_TAG_structure_type
    8926                            .dwattr DW$T$103, DW_AT_name("match_result_t")
    8927                            .dwattr DW$T$103, DW_AT_byte_size(0x20)
    8928                    DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8929                            .dwattr DW$471, DW_AT_name("feature_id"), DW_AT_symbol_name("_feature_id")
    8930                            .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    8931                            .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    8932                    DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8933                            .dwattr DW$472, DW_AT_name("matchScore"), DW_AT_symbol_name("_matchScore")
    8934                            .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    8935                            .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    8936                    DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8937                            .dwattr DW$473, DW_AT_name("matchConfidence"), DW_AT_symbol_name("_matchConfidence")
    8938                            .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    8939                            .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
    8940                    DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8941                            .dwattr DW$474, DW_AT_name("matchAng"), DW_AT_symbol_name("_matchAng")
    8942                            .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    8943                            .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
    8944                    DW$475  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8945                            .dwattr DW$475, DW_AT_name("validROIPercent"), DW_AT_symbol_name("_validROIPercent")
    8946                            .dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    8947                            .dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
    8948                    DW$476  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8949                            .dwattr DW$476, DW_AT_name("matchLevel"), DW_AT_symbol_name("_matchLevel")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  166

    8950                            .dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    8951                            .dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
    8952                    DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8953                            .dwattr DW$477, DW_AT_name("matchedBits"), DW_AT_symbol_name("_matchedBits")
    8954                            .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    8955                            .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    8956                    DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    8957                            .dwattr DW$478, DW_AT_name("validMatchBits"), DW_AT_symbol_name("_validMatchBits")
    8958                            .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    8959                            .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    8960                            .dwendtag DW$T$103
    8961                    
    8962                    DW$T$94 .dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
    8963                            .dwattr DW$T$94, DW_AT_language(DW_LANG_C)
    8964                    DW$T$92 .dwtag  DW_TAG_typedef, DW_AT_name("Int32"), DW_AT_type(*DW$T$10)
    8965                            .dwattr DW$T$92, DW_AT_language(DW_LANG_C)
    8966                    
    8967                    DW$T$100        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    8968                            .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    8969                            .dwattr DW$T$100, DW_AT_byte_size(0x08)
    8970                    DW$479  .dwtag  DW_TAG_subrange_type
    8971                            .dwattr DW$479, DW_AT_upper_bound(0x01)
    8972                            .dwendtag DW$T$100
    8973                    
    8974                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$12)
    8975                            .dwattr DW$T$25, DW_AT_address_class(0x20)
    8976                    DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
    8977                            .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
    8978                    DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("iris_loc_t"), DW_AT_type(*DW$T$30)
    8979                            .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    8980                    DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_byte_data_t"), DW_AT_type(*DW$T$31)
    8981                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    8982                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$37)
    8983                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    8984                    DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$38)
    8985                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    8986                    DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$41)
    8987                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    8988                    DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$43)
    8989                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    8990                    DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$44)
    8991                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    8992                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$46)
    8993                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    8994                    DW$T$66 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$47)
    8995                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    8996                    DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$48)
    8997                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    8998                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$50)
    8999                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    9000                    DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$52)
    9001                            .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    9002                    DW$T$70 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$55)
    9003                            .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    9004                    DW$T$71 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$56)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  167

    9005                            .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
    9006                    DW$T$72 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$59)
    9007                            .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    9008                    DW$T$73 .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$60)
    9009                            .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    9010                    
    9011                    DW$T$75 .dwtag  DW_TAG_structure_type
    9012                            .dwattr DW$T$75, DW_AT_name("dsp_status_t")
    9013                            .dwattr DW$T$75, DW_AT_byte_size(0x18)
    9014                    DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9015                            .dwattr DW$480, DW_AT_name("tsk_img_status"), DW_AT_symbol_name("_tsk_img_status")
    9016                            .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9017                            .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    9018                    DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9019                            .dwattr DW$481, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    9020                            .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9021                            .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    9022                    DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9023                            .dwattr DW$482, DW_AT_name("tsk_alg_saved_status"), DW_AT_symbol_name("_tsk_alg_saved_status")
    9024                            .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9025                            .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    9026                    DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9027                            .dwattr DW$483, DW_AT_name("tsk_alg_inuse"), DW_AT_symbol_name("_tsk_alg_inuse")
    9028                            .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9029                            .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    9030                    DW$484  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9031                            .dwattr DW$484, DW_AT_name("proc_start_time"), DW_AT_symbol_name("_proc_start_time")
    9032                            .dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9033                            .dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
    9034                    DW$485  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9035                            .dwattr DW$485, DW_AT_name("proc_timeout"), DW_AT_symbol_name("_proc_timeout")
    9036                            .dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9037                            .dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
    9038                    DW$486  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9039                            .dwattr DW$486, DW_AT_name("tsk_testimg_tag_left"), DW_AT_symbol_name("_tsk_testimg_tag_left")
    9040                            .dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9041                            .dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
    9042                    DW$487  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9043                            .dwattr DW$487, DW_AT_name("tsk_testimg_tag_right"), DW_AT_symbol_name("_tsk_testimg_tag_right
    9044                            .dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9045                            .dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
    9046                            .dwendtag DW$T$75
    9047                    
    9048                    
    9049                    DW$T$76 .dwtag  DW_TAG_structure_type
    9050                            .dwattr DW$T$76, DW_AT_name("dsp_distance_t")
    9051                            .dwattr DW$T$76, DW_AT_byte_size(0x24)
    9052                    DW$488  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9053                            .dwattr DW$488, DW_AT_name("same_count"), DW_AT_symbol_name("_same_count")
    9054                            .dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9055                            .dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
    9056                    DW$489  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9057                            .dwattr DW$489, DW_AT_name("last_distance"), DW_AT_symbol_name("_last_distance")
    9058                            .dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9059                            .dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  168

    9060                    DW$490  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9061                            .dwattr DW$490, DW_AT_name("if_has_people"), DW_AT_symbol_name("_if_has_people")
    9062                            .dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9063                            .dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
    9064                    DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9065                            .dwattr DW$491, DW_AT_name("last_if_has"), DW_AT_symbol_name("_last_if_has")
    9066                            .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    9067                            .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    9068                    DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9069                            .dwattr DW$492, DW_AT_name("no_count"), DW_AT_symbol_name("_no_count")
    9070                            .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9071                            .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    9072                    DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9073                            .dwattr DW$493, DW_AT_name("has_count"), DW_AT_symbol_name("_has_count")
    9074                            .dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    9075                            .dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
    9076                    DW$494  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9077                            .dwattr DW$494, DW_AT_name("disp_count"), DW_AT_symbol_name("_disp_count")
    9078                            .dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9079                            .dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
    9080                    DW$495  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9081                            .dwattr DW$495, DW_AT_name("if_disp_image"), DW_AT_symbol_name("_if_disp_image")
    9082                            .dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    9083                            .dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
    9084                    DW$496  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9085                            .dwattr DW$496, DW_AT_name("wait_frame"), DW_AT_symbol_name("_wait_frame")
    9086                            .dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9087                            .dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
    9088                            .dwendtag DW$T$76
    9089                    
    9090                    
    9091                    DW$T$78 .dwtag  DW_TAG_structure_type
    9092                            .dwattr DW$T$78, DW_AT_name("policy_t")
    9093                            .dwattr DW$T$78, DW_AT_byte_size(0x28)
    9094                    DW$497  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9095                            .dwattr DW$497, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    9096                            .dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9097                            .dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
    9098                    DW$498  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9099                            .dwattr DW$498, DW_AT_name("iden_count"), DW_AT_symbol_name("_iden_count")
    9100                            .dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    9101                            .dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
    9102                    DW$499  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9103                            .dwattr DW$499, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    9104                            .dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9105                            .dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
    9106                    DW$500  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    9107                            .dwattr DW$500, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    9108                            .dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    9109                            .dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
    9110                    DW$501  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    9111                            .dwattr DW$501, DW_AT_name("enroll_score_l"), DW_AT_symbol_name("_enroll_score_l")
    9112                            .dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9113                            .dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
    9114                    DW$502  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  169

    9115                            .dwattr DW$502, DW_AT_name("enroll_score_r"), DW_AT_symbol_name("_enroll_score_r")
    9116                            .dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    9117                            .dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
    9118                            .dwendtag DW$T$78
    9119                    
    9120                    
    9121                    DW$T$79 .dwtag  DW_TAG_structure_type
    9122                            .dwattr DW$T$79, DW_AT_name("dsp_sound_t")
    9123                            .dwattr DW$T$79, DW_AT_byte_size(0x08)
    9124                    DW$503  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9125                            .dwattr DW$503, DW_AT_name("last_sound_time"), DW_AT_symbol_name("_last_sound_time")
    9126                            .dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9127                            .dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
    9128                    DW$504  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9129                            .dwattr DW$504, DW_AT_name("last_sound_value"), DW_AT_symbol_name("_last_sound_value")
    9130                            .dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9131                            .dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
    9132                            .dwendtag DW$T$79
    9133                    
    9134                    
    9135                    DW$T$81 .dwtag  DW_TAG_structure_type
    9136                            .dwattr DW$T$81, DW_AT_name("dsp_result_t")
    9137                            .dwattr DW$T$81, DW_AT_byte_size(0x0c)
    9138                    DW$505  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    9139                            .dwattr DW$505, DW_AT_name("count"), DW_AT_symbol_name("_count")
    9140                            .dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9141                            .dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
    9142                    DW$506  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    9143                            .dwattr DW$506, DW_AT_name("result"), DW_AT_symbol_name("_result")
    9144                            .dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9145                            .dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
    9146                    DW$507  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    9147                            .dwattr DW$507, DW_AT_name("grab_iden_result"), DW_AT_symbol_name("_grab_iden_result")
    9148                            .dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    9149                            .dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
    9150                            .dwendtag DW$T$81
    9151                    
    9152                    
    9153                    DW$T$80 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
    9154                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    9155                            .dwattr DW$T$80, DW_AT_byte_size(0x04)
    9156                    DW$508  .dwtag  DW_TAG_subrange_type
    9157                            .dwattr DW$508, DW_AT_upper_bound(0x01)
    9158                            .dwendtag DW$T$80
    9159                    
    9160                    
    9161                    DW$T$77 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    9162                            .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    9163                            .dwattr DW$T$77, DW_AT_byte_size(0x10)
    9164                    DW$509  .dwtag  DW_TAG_subrange_type
    9165                            .dwattr DW$509, DW_AT_upper_bound(0x03)
    9166                            .dwendtag DW$T$77
    9167                    
    9168                    
    9169                    DW$T$30 .dwtag  DW_TAG_structure_type
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  170

    9170                            .dwattr DW$T$30, DW_AT_name("iris_loc_t")
    9171                            .dwattr DW$T$30, DW_AT_byte_size(0x54)
    9172                    DW$510  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    9173                            .dwattr DW$510, DW_AT_name("pos_pupil"), DW_AT_symbol_name("_pos_pupil")
    9174                            .dwattr DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9175                            .dwattr DW$510, DW_AT_accessibility(DW_ACCESS_public)
    9176                    DW$511  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    9177                            .dwattr DW$511, DW_AT_name("pos_iris"), DW_AT_symbol_name("_pos_iris")
    9178                            .dwattr DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    9179                            .dwattr DW$511, DW_AT_accessibility(DW_ACCESS_public)
    9180                    DW$512  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9181                            .dwattr DW$512, DW_AT_name("overallVisiblePercent"), DW_AT_symbol_name("_overallVisiblePercent
    9182                            .dwattr DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    9183                            .dwattr DW$512, DW_AT_accessibility(DW_ACCESS_public)
    9184                    DW$513  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9185                            .dwattr DW$513, DW_AT_name("focusScore"), DW_AT_symbol_name("_focusScore")
    9186                            .dwattr DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    9187                            .dwattr DW$513, DW_AT_accessibility(DW_ACCESS_public)
    9188                    DW$514  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9189                            .dwattr DW$514, DW_AT_name("percentVisible"), DW_AT_symbol_name("_percentVisible")
    9190                            .dwattr DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    9191                            .dwattr DW$514, DW_AT_accessibility(DW_ACCESS_public)
    9192                    DW$515  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9193                            .dwattr DW$515, DW_AT_name("numValidBits"), DW_AT_symbol_name("_numValidBits")
    9194                            .dwattr DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    9195                            .dwattr DW$515, DW_AT_accessibility(DW_ACCESS_public)
    9196                    DW$516  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9197                            .dwattr DW$516, DW_AT_name("spoofValue"), DW_AT_symbol_name("_spoofValue")
    9198                            .dwattr DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    9199                            .dwattr DW$516, DW_AT_accessibility(DW_ACCESS_public)
    9200                    DW$517  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9201                            .dwattr DW$517, DW_AT_name("SNR"), DW_AT_symbol_name("_SNR")
    9202                            .dwattr DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    9203                            .dwattr DW$517, DW_AT_accessibility(DW_ACCESS_public)
    9204                    DW$518  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9205                            .dwattr DW$518, DW_AT_name("Saturation"), DW_AT_symbol_name("_Saturation")
    9206                            .dwattr DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    9207                            .dwattr DW$518, DW_AT_accessibility(DW_ACCESS_public)
    9208                    DW$519  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9209                            .dwattr DW$519, DW_AT_name("interlaceValue"), DW_AT_symbol_name("_interlaceValue")
    9210                            .dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    9211                            .dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
    9212                    DW$520  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9213                            .dwattr DW$520, DW_AT_name("reflectionRatioInROI"), DW_AT_symbol_name("_reflectionRatioInROI")
    9214                            .dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    9215                            .dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
    9216                    DW$521  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9217                            .dwattr DW$521, DW_AT_name("reflectionRatioInImage"), DW_AT_symbol_name("_reflectionRatioInIma
    9218                            .dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    9219                            .dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
    9220                    DW$522  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9221                            .dwattr DW$522, DW_AT_name("qualityLevel"), DW_AT_symbol_name("_qualityLevel")
    9222                            .dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    9223                            .dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
    9224                    DW$523  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:41 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI1482                          PAGE  171

    9225                            .dwattr DW$523, DW_AT_name("locMethod"), DW_AT_symbol_name("_locMethod")
    9226                            .dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    9227                            .dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
    9228                    DW$524  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    9229                            .dwattr DW$524, DW_AT_name("ifSpoofDetect"), DW_AT_symbol_name("_ifSpoofDetect")
    9230                            .dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    9231                            .dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
    9232                            .dwendtag DW$T$30
    9233                    
    9234                    
    9235                    DW$T$31 .dwtag  DW_TAG_structure_type
    9236                            .dwattr DW$T$31, DW_AT_name("dsp_byte_data_t")
    9237                            .dwattr DW$T$31, DW_AT_byte_size(0x08)
    9238                    DW$525  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    9239                            .dwattr DW$525, DW_AT_name("data_len"), DW_AT_symbol_name("_data_len")
    9240                            .dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    9241                            .dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
    9242                    DW$526  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    9243                            .dwattr DW$526, DW_AT_name("data_byte"), DW_AT_symbol_name("_data_byte")
    9244                            .dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    9245                            .dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
    9246                            .dwendtag DW$T$31
    9247                    
    9248                    
    9249                    DW$T$37 .dwtag  DW_TAG_structure_type
    9250                            .dwattr DW$T$37, DW_AT_name("dsp_tsk_control_t")
    9251                            .dwattr DW$T$37, DW_AT_byte_size(0x0c)
