TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:02 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI7802                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Tue Apr 05 17:07:02 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    1456                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
    1457                    DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
    1458                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:02 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI7802                          PAGE   28

    1459                    DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$33)
    1460                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1461                    
    1462                    DW$T$63 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
    1463                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1464                    DW$71   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1465                            .dwendtag DW$T$63
    1466                    
    1467                    
    1468                    DW$T$59 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1469                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    1470                    DW$72   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    1471                    DW$73   .dwtag  DW_TAG_unspecified_parameters
    1472                            .dwendtag DW$T$59
    1473                    
    1474                    
    1475                    DW$T$61 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1476                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    1477                    
    1478                    DW$T$64 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1479                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    1480                    DW$74   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1481                    DW$75   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1482                    DW$76   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1483                            .dwendtag DW$T$64
    1484                    
    1485                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1486                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1487                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    1488                    
    1489                    DW$T$65 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$24)
    1490                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1491                            .dwattr DW$T$65, DW_AT_byte_size(0x8c)
    1492                    DW$77   .dwtag  DW_TAG_subrange_type
    1493                            .dwattr DW$77, DW_AT_upper_bound(0x45)
    1494                            .dwendtag DW$T$65
    1495                    
    1496                    
    1497                    DW$T$66 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$24)
    1498                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    1499                            .dwattr DW$T$66, DW_AT_byte_size(0x200)
    1500                    DW$78   .dwtag  DW_TAG_subrange_type
    1501                            .dwattr DW$78, DW_AT_upper_bound(0xff)
    1502                            .dwendtag DW$T$66
    1503                    
    1504                    DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$26)
    1505                            .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    1506                    DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("OV7725_Params"), DW_AT_type(*DW$T$28)
    1507                            .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    1508                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
    1509                            .dwattr DW$T$47, DW_AT_address_class(0x20)
    1510                    DW$T$30 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1511                            .dwattr DW$T$30, DW_AT_encoding(DW_ATE_signed_char)
    1512                            .dwattr DW$T$30, DW_AT_byte_size(0x01)
    1513                    DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:02 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI7802                          PAGE   29

    1514                            .dwattr DW$T$31, DW_AT_address_class(0x20)
    1515                    DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$31)
    1516                            .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    1517                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$43)
    1518                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1519                    DW$T$3  .dwtag  DW_TAG_pointer_type
    1520                            .dwattr DW$T$3, DW_AT_address_class(0x20)
    1521                    DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$55)
    1522                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1523                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("OV7725_Reg"), DW_AT_type(*DW$T$19)
    1524                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1525                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1526                            .dwattr DW$T$26, DW_AT_address_class(0x20)
    1527                    
    1528                    DW$T$28 .dwtag  DW_TAG_structure_type
    1529                            .dwattr DW$T$28, DW_AT_byte_size(0x0c)
    1530                    DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1531                            .dwattr DW$79, DW_AT_name("num"), DW_AT_symbol_name("_num")
    1532                            .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1533                            .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1534                    DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1535                            .dwattr DW$80, DW_AT_name("reg"), DW_AT_symbol_name("_reg")
    1536                            .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1537                            .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1538                    DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1539                            .dwattr DW$81, DW_AT_name("hI2C"), DW_AT_symbol_name("_hI2C")
    1540                            .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1541                            .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1542                            .dwendtag DW$T$28
    1543                    
    1544                    
    1545                    DW$T$43 .dwtag  DW_TAG_structure_type
    1546                            .dwattr DW$T$43, DW_AT_name("EDC_Fxns")
    1547                            .dwattr DW$T$43, DW_AT_byte_size(0x0c)
    1548                    DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1549                            .dwattr DW$82, DW_AT_name("open"), DW_AT_symbol_name("_open")
    1550                            .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551                            .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1552                    DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1553                            .dwattr DW$83, DW_AT_name("close"), DW_AT_symbol_name("_close")
    1554                            .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1555                            .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1556                    DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    1557                            .dwattr DW$84, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
    1558                            .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1559                            .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1560                            .dwendtag DW$T$43
    1561                    
    1562                    DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
    1563                            .dwattr DW$T$36, DW_AT_address_class(0x20)
    1564                    DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    1565                            .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
    1566                    DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    1567                            .dwattr DW$T$39, DW_AT_address_class(0x20)
    1568                    DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$41)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:02 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI7802                          PAGE   30

    1569                            .dwattr DW$T$42, DW_AT_address_class(0x20)
    1570                    
    1571                    DW$T$19 .dwtag  DW_TAG_structure_type
    1572                            .dwattr DW$T$19, DW_AT_byte_size(0x02)
    1573                    DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1574                            .dwattr DW$85, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
    1575                            .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1576                            .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1577                    DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1578                            .dwattr DW$86, DW_AT_name("val"), DW_AT_symbol_name("_val")
    1579                            .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1580                            .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1581                            .dwendtag DW$T$19
    1582                    
    1583                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    1584                            .dwattr DW$T$25, DW_AT_address_class(0x20)
    1585                    
    1586                    DW$T$23 .dwtag  DW_TAG_structure_type
    1587                            .dwattr DW$T$23, DW_AT_byte_size(0x14)
    1588                    DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1589                            .dwattr DW$87, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    1590                            .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1591                            .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1592                    DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1593                            .dwattr DW$88, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    1594                            .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1595                            .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1596                    DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1597                            .dwattr DW$89, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    1598                            .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1599                            .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1600                    DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1601                            .dwattr DW$90, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
    1602                            .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1603                            .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1604                    DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1605                            .dwattr DW$91, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
    1606                            .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1607                            .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1608                            .dwendtag DW$T$23
    1609                    
    1610                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1611                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1612                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1613                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    1614                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1615                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    1616                    
    1617                    DW$T$38 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
    1618                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1619                    DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
    1620                            .dwendtag DW$T$38
    1621                    
    1622                    
    1623                    DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:02 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI7802                          PAGE   31

    1624                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1625                    DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
    1626                    DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
    1627                    DW$95   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1628                            .dwendtag DW$T$41
    1629                    
    1630                    DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    1631                            .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1632                    DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1633                            .dwattr DW$T$22, DW_AT_address_class(0x20)
    1634                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
    1635                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    1636                    DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("Ptr"), DW_AT_type(*DW$T$3)
    1637                            .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    1638                    DW$T$21 .dwtag  DW_TAG_volatile_type
    1639                            .dwattr DW$T$21, DW_AT_type(*DW$T$20)
    1640                    
    1641                            .dwattr DW$27, DW_AT_external(0x01)
    1642                            .dwattr DW$32, DW_AT_external(0x01)
    1643                            .dwattr DW$41, DW_AT_type(*DW$T$56)
    1644                            .dwattr DW$38, DW_AT_external(0x01)
    1645                            .dwattr DW$35, DW_AT_external(0x01)
    1646                            .dwattr DW$52, DW_AT_type(*DW$T$33)
    1647                            .dwattr DW$55, DW_AT_type(*DW$T$10)
    1648                            .dwattr DW$46, DW_AT_type(*DW$T$29)
    1649                            .dwattr DW$16, DW_AT_external(0x01)
    1650                            .dwattr DW$24, DW_AT_external(0x01)
    1651                            .dwattr DW$31, DW_AT_external(0x01)
    1652                            .dwattr DW$11, DW_AT_external(0x01)
    1653                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1654                    
    1655                    ;***************************************************************
    1656                    ;* DWARF CIE ENTRIES                                           *
    1657                    ;***************************************************************
    1658                    
