TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 31 17:05:44 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    2840                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
    2841                    
    2842                    DW$T$125        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    2843                            .dwattr DW$T$125, DW_AT_language(DW_LANG_C)
    2844                    DW$137  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$103)
    2845                    DW$138  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2846                    DW$139  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    2847                            .dwendtag DW$T$125
    2848                    
    2849                    
    2850                    DW$T$127        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    2851                            .dwattr DW$T$127, DW_AT_language(DW_LANG_C)
    2852                    DW$T$129        .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
    2853                            .dwattr DW$T$129, DW_AT_language(DW_LANG_C)
    2854                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2855                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2856                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    2857                    DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    2858                            .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    2859                    DW$T$106        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
    2860                            .dwattr DW$T$106, DW_AT_address_class(0x20)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   53

    2861                    DW$T$130        .dwtag  DW_TAG_typedef, DW_AT_name("LgUns"), DW_AT_type(*DW$T$11)
    2862                            .dwattr DW$T$130, DW_AT_language(DW_LANG_C)
    2863                    DW$T$108        .dwtag  DW_TAG_typedef, DW_AT_name("pIrisImageInfo"), DW_AT_type(*DW$T$107)
    2864                            .dwattr DW$T$108, DW_AT_language(DW_LANG_C)
    2865                    
    2866                    DW$T$132        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$131)
    2867                            .dwattr DW$T$132, DW_AT_language(DW_LANG_C)
    2868                            .dwattr DW$T$132, DW_AT_byte_size(0x1e0)
    2869                    DW$140  .dwtag  DW_TAG_subrange_type
    2870                            .dwattr DW$140, DW_AT_upper_bound(0x03)
    2871                            .dwendtag DW$T$132
    2872                    
    2873                    DW$T$114        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$113)
    2874                            .dwattr DW$T$114, DW_AT_address_class(0x20)
    2875                    DW$T$135        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$134)
    2876                            .dwattr DW$T$135, DW_AT_address_class(0x20)
    2877                    DW$T$136        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_reg_t"), DW_AT_type(*DW$T$85)
    2878                            .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    2879                    DW$T$137        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$91)
    2880                            .dwattr DW$T$137, DW_AT_address_class(0x20)
    2881                    DW$T$139        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$95)
    2882                            .dwattr DW$T$139, DW_AT_address_class(0x20)
    2883                    DW$T$141        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$140)
    2884                            .dwattr DW$T$141, DW_AT_address_class(0x20)
    2885                    DW$T$102        .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$101)
    2886                            .dwattr DW$T$102, DW_AT_language(DW_LANG_C)
    2887                    DW$T$98 .dwtag  DW_TAG_const_type
    2888                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    2889                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2890                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    2891                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    2892                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2893                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    2894                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    2895                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    2896                    DW$T$107        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    2897                            .dwattr DW$T$107, DW_AT_address_class(0x20)
    2898                    DW$T$131        .dwtag  DW_TAG_typedef, DW_AT_name("IrisImageInfo"), DW_AT_type(*DW$T$20)
    2899                            .dwattr DW$T$131, DW_AT_language(DW_LANG_C)
    2900                    DW$T$113        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_procimg_t"), DW_AT_type(*DW$T$33)
    2901                            .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
    2902                    DW$T$134        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$71)
    2903                            .dwattr DW$T$134, DW_AT_language(DW_LANG_C)
    2904                    
    2905                    DW$T$85 .dwtag  DW_TAG_structure_type
    2906                            .dwattr DW$T$85, DW_AT_name("dsp_reg_t")
    2907                            .dwattr DW$T$85, DW_AT_byte_size(0xb4)
    2908                    DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    2909                            .dwattr DW$141, DW_AT_name("status_reg"), DW_AT_symbol_name("_status_reg")
    2910                            .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911                            .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2912                    DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    2913                            .dwattr DW$142, DW_AT_name("distance_reg"), DW_AT_symbol_name("_distance_reg")
    2914                            .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2915                            .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   54

    2916                    DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
    2917                            .dwattr DW$143, DW_AT_name("policy_reg"), DW_AT_symbol_name("_policy_reg")
    2918                            .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    2919                            .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2920                    DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    2921                            .dwattr DW$144, DW_AT_name("sound_reg"), DW_AT_symbol_name("_sound_reg")
    2922                            .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    2923                            .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2924                    DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
    2925                            .dwattr DW$145, DW_AT_name("result_reg"), DW_AT_symbol_name("_result_reg")
    2926                            .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    2927                            .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2928                    DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    2929                            .dwattr DW$146, DW_AT_name("quality_value"), DW_AT_symbol_name("_quality_value")
    2930                            .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    2931                            .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2932                    DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2933                            .dwattr DW$147, DW_AT_name("quality_count"), DW_AT_symbol_name("_quality_count")
    2934                            .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    2935                            .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2936                    DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2937                            .dwattr DW$148, DW_AT_name("alg_control_count"), DW_AT_symbol_name("_alg_control_count")
    2938                            .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    2939                            .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2940                    DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2941                            .dwattr DW$149, DW_AT_name("last_img_quality"), DW_AT_symbol_name("_last_img_quality")
    2942                            .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    2943                            .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2944                    DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2945                            .dwattr DW$150, DW_AT_name("last_icon_id"), DW_AT_symbol_name("_last_icon_id")
    2946                            .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    2947                            .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2948                    DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2949                            .dwattr DW$151, DW_AT_name("match_input_count"), DW_AT_symbol_name("_match_input_count")
    2950                            .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    2951                            .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2952                            .dwendtag DW$T$85
    2953                    
    2954                    DW$T$91 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_byte_data_t"), DW_AT_type(*DW$T$86)
    2955                            .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    2956                    DW$T$95 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_eye_feature_t"), DW_AT_type(*DW$T$92)
    2957                            .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    2958                    DW$T$140        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_enroll_result_t"), DW_AT_type(*DW$T$97)
    2959                            .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    2960                    
    2961                    DW$T$101        .dwtag  DW_TAG_enumeration_type
    2962                            .dwattr DW$T$101, DW_AT_byte_size(0x04)
    2963                    DW$152  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
    2964                    DW$153  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
    2965                    DW$154  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
    2966                    DW$155  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
    2967                    DW$156  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
    2968                    DW$157  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
    2969                            .dwendtag DW$T$101
    2970                    
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   55

    2971                    
    2972                    DW$T$84 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2973                            .dwattr DW$T$84, DW_AT_language(DW_LANG_C)
    2974                            .dwattr DW$T$84, DW_AT_byte_size(0x28)
    2975                    DW$158  .dwtag  DW_TAG_subrange_type
    2976                            .dwattr DW$158, DW_AT_upper_bound(0x09)
    2977                            .dwendtag DW$T$84
    2978                    
    2979                    
    2980                    DW$T$20 .dwtag  DW_TAG_structure_type
    2981                            .dwattr DW$T$20, DW_AT_name("IrisImageInfoStruct")
    2982                            .dwattr DW$T$20, DW_AT_byte_size(0x78)
    2983                    DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2984                            .dwattr DW$159, DW_AT_name("imageH"), DW_AT_symbol_name("_imageH")
    2985                            .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2986                            .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2987                    DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2988                            .dwattr DW$160, DW_AT_name("imageW"), DW_AT_symbol_name("_imageW")
    2989                            .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2990                            .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2991                    DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2992                            .dwattr DW$161, DW_AT_name("imageData"), DW_AT_symbol_name("_imageData")
    2993                            .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2994                            .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2995                    DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2996                            .dwattr DW$162, DW_AT_name("locMethod"), DW_AT_symbol_name("_locMethod")
    2997                            .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2998                            .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2999                    DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3000                            .dwattr DW$163, DW_AT_name("ifSpoofDetect"), DW_AT_symbol_name("_ifSpoofDetect")
    3001                            .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3002                            .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    3003                    DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3004                            .dwattr DW$164, DW_AT_name("processStatus"), DW_AT_symbol_name("_processStatus")
    3005                            .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3006                            .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    3007                    DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3008                            .dwattr DW$165, DW_AT_name("locImage"), DW_AT_symbol_name("_locImage")
    3009                            .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3010                            .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    3011                    DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3012                            .dwattr DW$166, DW_AT_name("pupilRow"), DW_AT_symbol_name("_pupilRow")
    3013                            .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3014                            .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    3015                    DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3016                            .dwattr DW$167, DW_AT_name("pupilCol"), DW_AT_symbol_name("_pupilCol")
    3017                            .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3018                            .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    3019                    DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3020                            .dwattr DW$168, DW_AT_name("pupilRadius"), DW_AT_symbol_name("_pupilRadius")
    3021                            .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3022                            .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    3023                    DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3024                            .dwattr DW$169, DW_AT_name("irisRow"), DW_AT_symbol_name("_irisRow")
    3025                            .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   56

    3026                            .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    3027                    DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3028                            .dwattr DW$170, DW_AT_name("irisCol"), DW_AT_symbol_name("_irisCol")
    3029                            .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3030                            .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    3031                    DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3032                            .dwattr DW$171, DW_AT_name("irisRadius"), DW_AT_symbol_name("_irisRadius")
    3033                            .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3034                            .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    3035                    DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3036                            .dwattr DW$172, DW_AT_name("pupilPos"), DW_AT_symbol_name("_pupilPos")
    3037                            .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3038                            .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    3039                    DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3040                            .dwattr DW$173, DW_AT_name("pupilVisiblePercent"), DW_AT_symbol_name("_pupilVisiblePercent")
    3041                            .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3042                            .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    3043                    DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3044                            .dwattr DW$174, DW_AT_name("irisPos"), DW_AT_symbol_name("_irisPos")
    3045                            .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3046                            .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    3047                    DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3048                            .dwattr DW$175, DW_AT_name("irisVisiblePercent"), DW_AT_symbol_name("_irisVisiblePercent")
    3049                            .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3050                            .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    3051                    DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3052                            .dwattr DW$176, DW_AT_name("overallVisiblePercent"), DW_AT_symbol_name("_overallVisiblePercent
    3053                            .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3054                            .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    3055                    DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3056                            .dwattr DW$177, DW_AT_name("focusScore"), DW_AT_symbol_name("_focusScore")
    3057                            .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3058                            .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    3059                    DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3060                            .dwattr DW$178, DW_AT_name("percentVisible"), DW_AT_symbol_name("_percentVisible")
    3061                            .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3062                            .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    3063                    DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3064                            .dwattr DW$179, DW_AT_name("numValidBits"), DW_AT_symbol_name("_numValidBits")
    3065                            .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3066                            .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    3067                    DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3068                            .dwattr DW$180, DW_AT_name("spoofValue"), DW_AT_symbol_name("_spoofValue")
    3069                            .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3070                            .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    3071                    DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3072                            .dwattr DW$181, DW_AT_name("SNR"), DW_AT_symbol_name("_SNR")
    3073                            .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3074                            .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    3075                    DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3076                            .dwattr DW$182, DW_AT_name("Saturation"), DW_AT_symbol_name("_Saturation")
    3077                            .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3078                            .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    3079                    DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$16)
    3080                            .dwattr DW$183, DW_AT_name("interlaceValue"), DW_AT_symbol_name("_interlaceValue")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   57

    3081                            .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3082                            .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    3083                    DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3084                            .dwattr DW$184, DW_AT_name("reflectionRatioInROI"), DW_AT_symbol_name("_reflectionRatioInROI")
    3085                            .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    3086                            .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    3087                    DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3088                            .dwattr DW$185, DW_AT_name("reflectionRatioInImage"), DW_AT_symbol_name("_reflectionRatioInIma
    3089                            .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3090                            .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    3091                    DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3092                            .dwattr DW$186, DW_AT_name("QualityLevel"), DW_AT_symbol_name("_QualityLevel")
    3093                            .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    3094                            .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    3095                    DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3096                            .dwattr DW$187, DW_AT_name("irisEnrTemplate"), DW_AT_symbol_name("_irisEnrTemplate")
    3097                            .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    3098                            .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    3099                    DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3100                            .dwattr DW$188, DW_AT_name("irisRecTemplate"), DW_AT_symbol_name("_irisRecTemplate")
    3101                            .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    3102                            .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    3103                            .dwendtag DW$T$20
    3104                    
    3105                    
    3106                    DW$T$33 .dwtag  DW_TAG_structure_type
    3107                            .dwattr DW$T$33, DW_AT_name("dsp_procimg_t")
    3108                            .dwattr DW$T$33, DW_AT_byte_size(0x1c)
    3109                    DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    3110                            .dwattr DW$189, DW_AT_name("img_msg"), DW_AT_symbol_name("_img_msg")
    3111                            .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3112                            .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    3113                    DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    3114                            .dwattr DW$190, DW_AT_name("result_msg"), DW_AT_symbol_name("_result_msg")
    3115                            .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3116                            .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    3117                    DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3118                            .dwattr DW$191, DW_AT_name("last_flag"), DW_AT_symbol_name("_last_flag")
    3119                            .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3120                            .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    3121                    DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    3122                            .dwattr DW$192, DW_AT_name("img_grab_count"), DW_AT_symbol_name("_img_grab_count")
    3123                            .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3124                            .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    3125                    DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
    3126                            .dwattr DW$193, DW_AT_name("begin_quality"), DW_AT_symbol_name("_begin_quality")
    3127                            .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3128                            .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    3129                    DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3130                            .dwattr DW$194, DW_AT_name("need_eye"), DW_AT_symbol_name("_need_eye")
    3131                            .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3132                            .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    3133                    DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3134                            .dwattr DW$195, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    3135                            .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   58

    3136                            .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    3137                            .dwendtag DW$T$33
    3138                    
    3139                    
    3140                    DW$T$71 .dwtag  DW_TAG_structure_type
    3141                            .dwattr DW$T$71, DW_AT_name("dsp_tsk_totalreg_t")
    3142                            .dwattr DW$T$71, DW_AT_byte_size(0x138)
    3143                    DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    3144                            .dwattr DW$196, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
    3145                            .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3146                            .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    3147                    DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3148                            .dwattr DW$197, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
    3149                            .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3150                            .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    3151                    DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    3152                            .dwattr DW$198, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
    3153                            .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3154                            .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    3155                    DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    3156                            .dwattr DW$199, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
    3157                            .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3158                            .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    3159                    DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    3160                            .dwattr DW$200, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
    3161                            .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    3162                            .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    3163                    DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    3164                            .dwattr DW$201, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
    3165                            .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    3166                            .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    3167                    DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    3168                            .dwattr DW$202, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
    3169                            .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    3170                            .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    3171                    DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    3172                            .dwattr DW$203, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
    3173                            .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    3174                            .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    3175                    DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    3176                            .dwattr DW$204, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
    3177                            .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    3178                            .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3179                    DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    3180                            .dwattr DW$205, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
    3181                            .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    3182                            .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    3183                    DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    3184                            .dwattr DW$206, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
    3185                            .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    3186                            .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3187                    DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    3188                            .dwattr DW$207, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg
    3189                            .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    3190                            .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   59

    3191                    DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    3192                            .dwattr DW$208, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
    3193                            .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    3194                            .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3195                    DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    3196                            .dwattr DW$209, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
    3197                            .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    3198                            .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3199                            .dwendtag DW$T$71
    3200                    
    3201                    DW$T$79 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_status_t"), DW_AT_type(*DW$T$72)
    3202                            .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    3203                    DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_t"), DW_AT_type(*DW$T$73)
    3204                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    3205                    DW$T$81 .dwtag  DW_TAG_typedef, DW_AT_name("policy_t"), DW_AT_type(*DW$T$75)
    3206                            .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    3207                    DW$T$82 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_sound_t"), DW_AT_type(*DW$T$76)
    3208                            .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    3209                    DW$T$83 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_t"), DW_AT_type(*DW$T$78)
    3210                            .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    3211                    
    3212                    DW$T$86 .dwtag  DW_TAG_structure_type
    3213                            .dwattr DW$T$86, DW_AT_name("dsp_byte_data_t")
    3214                            .dwattr DW$T$86, DW_AT_byte_size(0x08)
    3215                    DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3216                            .dwattr DW$210, DW_AT_name("data_len"), DW_AT_symbol_name("_data_len")
    3217                            .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3218                            .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3219                    DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3220                            .dwattr DW$211, DW_AT_name("data_byte"), DW_AT_symbol_name("_data_byte")
    3221                            .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3222                            .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3223                            .dwendtag DW$T$86
    3224                    
    3225                    
    3226                    DW$T$92 .dwtag  DW_TAG_structure_type
    3227                            .dwattr DW$T$92, DW_AT_name("dsp_eye_feature_t")
    3228                            .dwattr DW$T$92, DW_AT_byte_size(0x70)
    3229                    DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3230                            .dwattr DW$212, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    3231                            .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3232                            .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3233                    DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    3234                            .dwattr DW$213, DW_AT_name("loc"), DW_AT_symbol_name("_loc")
    3235                            .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3236                            .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3237                    DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
    3238                            .dwattr DW$214, DW_AT_name("enroll_feature"), DW_AT_symbol_name("_enroll_feature")
    3239                            .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    3240                            .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3241                    DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
    3242                            .dwattr DW$215, DW_AT_name("enroll_img"), DW_AT_symbol_name("_enroll_img")
    3243                            .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    3244                            .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3245                    DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   60

    3246                            .dwattr DW$216, DW_AT_name("match_feature"), DW_AT_symbol_name("_match_feature")
    3247                            .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    3248                            .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3249                            .dwendtag DW$T$92
    3250                    
    3251                    
    3252                    DW$T$97 .dwtag  DW_TAG_structure_type
    3253                            .dwattr DW$T$97, DW_AT_name("dsp_enroll_result_t")
    3254                            .dwattr DW$T$97, DW_AT_byte_size(0x7c)
    3255                    DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
    3256                            .dwattr DW$217, DW_AT_name("header"), DW_AT_symbol_name("_header")
    3257                            .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3258                            .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3259                    DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$96)
    3260                            .dwattr DW$218, DW_AT_name("enroll_result"), DW_AT_symbol_name("_enroll_result")
    3261                            .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3262                            .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3263                            .dwendtag DW$T$97
    3264                    
    3265                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
    3266                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    3267                    DW$T$16 .dwtag  DW_TAG_base_type, DW_AT_name("float")
    3268                            .dwattr DW$T$16, DW_AT_encoding(DW_ATE_float)
    3269                            .dwattr DW$T$16, DW_AT_byte_size(0x04)
    3270                    DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("IMAGE_MSG"), DW_AT_type(*DW$T$26)
    3271                            .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    3272                    DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("RESULT_MSG"), DW_AT_type(*DW$T$28)
    3273                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    3274                    DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$34)
    3275                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    3276                    DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$35)
    3277                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    3278                    DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$38)
    3279                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    3280                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$40)
    3281                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    3282                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$41)
    3283                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    3284                    DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$43)
    3285                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    3286                    DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$44)
    3287                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    3288                    DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$45)
    3289                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    3290                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$47)
    3291                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    3292                    DW$T$66 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$49)
    3293                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    3294                    DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$52)
    3295                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    3296                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$53)
    3297                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    3298                    DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$56)
    3299                            .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    3300                    DW$T$70 .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$57)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   61

    3301                            .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
    3302                    
    3303                    DW$T$72 .dwtag  DW_TAG_structure_type
    3304                            .dwattr DW$T$72, DW_AT_name("dsp_status_t")
    3305                            .dwattr DW$T$72, DW_AT_byte_size(0x18)
    3306                    DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3307                            .dwattr DW$219, DW_AT_name("tsk_img_status"), DW_AT_symbol_name("_tsk_img_status")
    3308                            .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3309                            .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3310                    DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3311                            .dwattr DW$220, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    3312                            .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3313                            .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3314                    DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3315                            .dwattr DW$221, DW_AT_name("tsk_alg_saved_status"), DW_AT_symbol_name("_tsk_alg_saved_status")
    3316                            .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3317                            .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3318                    DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3319                            .dwattr DW$222, DW_AT_name("tsk_alg_inuse"), DW_AT_symbol_name("_tsk_alg_inuse")
    3320                            .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3321                            .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3322                    DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3323                            .dwattr DW$223, DW_AT_name("proc_start_time"), DW_AT_symbol_name("_proc_start_time")
    3324                            .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3325                            .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3326                    DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3327                            .dwattr DW$224, DW_AT_name("proc_timeout"), DW_AT_symbol_name("_proc_timeout")
    3328                            .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3329                            .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3330                    DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3331                            .dwattr DW$225, DW_AT_name("tsk_testimg_tag_left"), DW_AT_symbol_name("_tsk_testimg_tag_left")
    3332                            .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3333                            .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3334                    DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3335                            .dwattr DW$226, DW_AT_name("tsk_testimg_tag_right"), DW_AT_symbol_name("_tsk_testimg_tag_right
    3336                            .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3337                            .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3338                            .dwendtag DW$T$72
    3339                    
    3340                    
    3341                    DW$T$73 .dwtag  DW_TAG_structure_type
    3342                            .dwattr DW$T$73, DW_AT_name("dsp_distance_t")
    3343                            .dwattr DW$T$73, DW_AT_byte_size(0x24)
    3344                    DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3345                            .dwattr DW$227, DW_AT_name("same_count"), DW_AT_symbol_name("_same_count")
    3346                            .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3347                            .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3348                    DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3349                            .dwattr DW$228, DW_AT_name("last_distance"), DW_AT_symbol_name("_last_distance")
    3350                            .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3351                            .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3352                    DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3353                            .dwattr DW$229, DW_AT_name("if_has_people"), DW_AT_symbol_name("_if_has_people")
    3354                            .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3355                            .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   62

    3356                    DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3357                            .dwattr DW$230, DW_AT_name("last_if_has"), DW_AT_symbol_name("_last_if_has")
    3358                            .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3359                            .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3360                    DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3361                            .dwattr DW$231, DW_AT_name("no_count"), DW_AT_symbol_name("_no_count")
    3362                            .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3363                            .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3364                    DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3365                            .dwattr DW$232, DW_AT_name("has_count"), DW_AT_symbol_name("_has_count")
    3366                            .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3367                            .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3368                    DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3369                            .dwattr DW$233, DW_AT_name("disp_count"), DW_AT_symbol_name("_disp_count")
    3370                            .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3371                            .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3372                    DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3373                            .dwattr DW$234, DW_AT_name("if_disp_image"), DW_AT_symbol_name("_if_disp_image")
    3374                            .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3375                            .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3376                    DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3377                            .dwattr DW$235, DW_AT_name("wait_frame"), DW_AT_symbol_name("_wait_frame")
    3378                            .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3379                            .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3380                            .dwendtag DW$T$73
    3381                    
    3382                    
    3383                    DW$T$75 .dwtag  DW_TAG_structure_type
    3384                            .dwattr DW$T$75, DW_AT_name("policy_t")
    3385                            .dwattr DW$T$75, DW_AT_byte_size(0x28)
    3386                    DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3387                            .dwattr DW$236, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    3388                            .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3389                            .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3390                    DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3391                            .dwattr DW$237, DW_AT_name("iden_count"), DW_AT_symbol_name("_iden_count")
    3392                            .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3393                            .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3394                    DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3395                            .dwattr DW$238, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    3396                            .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3397                            .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    3398                    DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3399                            .dwattr DW$239, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    3400                            .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3401                            .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    3402                    DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3403                            .dwattr DW$240, DW_AT_name("enroll_score_l"), DW_AT_symbol_name("_enroll_score_l")
    3404                            .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3405                            .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    3406                    DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    3407                            .dwattr DW$241, DW_AT_name("enroll_score_r"), DW_AT_symbol_name("_enroll_score_r")
    3408                            .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3409                            .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    3410                            .dwendtag DW$T$75
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   63

    3411                    
    3412                    
    3413                    DW$T$76 .dwtag  DW_TAG_structure_type
    3414                            .dwattr DW$T$76, DW_AT_name("dsp_sound_t")
    3415                            .dwattr DW$T$76, DW_AT_byte_size(0x08)
    3416                    DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3417                            .dwattr DW$242, DW_AT_name("last_sound_time"), DW_AT_symbol_name("_last_sound_time")
    3418                            .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3419                            .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    3420                    DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3421                            .dwattr DW$243, DW_AT_name("last_sound_value"), DW_AT_symbol_name("_last_sound_value")
    3422                            .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3423                            .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    3424                            .dwendtag DW$T$76
    3425                    
    3426                    
    3427                    DW$T$78 .dwtag  DW_TAG_structure_type
    3428                            .dwattr DW$T$78, DW_AT_name("dsp_result_t")
    3429                            .dwattr DW$T$78, DW_AT_byte_size(0x0c)
    3430                    DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    3431                            .dwattr DW$244, DW_AT_name("count"), DW_AT_symbol_name("_count")
    3432                            .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3433                            .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    3434                    DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    3435                            .dwattr DW$245, DW_AT_name("result"), DW_AT_symbol_name("_result")
    3436                            .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3437                            .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3438                    DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    3439                            .dwattr DW$246, DW_AT_name("grab_iden_result"), DW_AT_symbol_name("_grab_iden_result")
    3440                            .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3441                            .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3442                            .dwendtag DW$T$78
    3443                    
    3444                    DW$T$90 .dwtag  DW_TAG_typedef, DW_AT_name("iris_loc_t"), DW_AT_type(*DW$T$89)
    3445                            .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
    3446                    
    3447                    DW$T$96 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$95)
    3448                            .dwattr DW$T$96, DW_AT_language(DW_LANG_C)
    3449                            .dwattr DW$T$96, DW_AT_byte_size(0x70)
    3450                    DW$247  .dwtag  DW_TAG_subrange_type
    3451                            .dwattr DW$247, DW_AT_upper_bound(0x00)
    3452                            .dwendtag DW$T$96
    3453                    
    3454                    DW$T$94 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_data_header_t"), DW_AT_type(*DW$T$93)
    3455                            .dwattr DW$T$94, DW_AT_language(DW_LANG_C)
    3456                    
    3457                    DW$T$77 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
    3458                            .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    3459                            .dwattr DW$T$77, DW_AT_byte_size(0x04)
    3460                    DW$248  .dwtag  DW_TAG_subrange_type
    3461                            .dwattr DW$248, DW_AT_upper_bound(0x01)
    3462                            .dwendtag DW$T$77
    3463                    
    3464                    
    3465                    DW$T$74 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   64

    3466                            .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    3467                            .dwattr DW$T$74, DW_AT_byte_size(0x10)
    3468                    DW$249  .dwtag  DW_TAG_subrange_type
    3469                            .dwattr DW$249, DW_AT_upper_bound(0x03)
    3470                            .dwendtag DW$T$74
    3471                    
    3472                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    3473                            .dwattr DW$T$26, DW_AT_address_class(0x20)
    3474                    DW$T$28 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
    3475                            .dwattr DW$T$28, DW_AT_address_class(0x20)
    3476                    
    3477                    DW$T$34 .dwtag  DW_TAG_structure_type
    3478                            .dwattr DW$T$34, DW_AT_name("dsp_tsk_control_t")
    3479                            .dwattr DW$T$34, DW_AT_byte_size(0x0c)
    3480                    DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3481                            .dwattr DW$250, DW_AT_name("tsk_img_control"), DW_AT_symbol_name("_tsk_img_control")
    3482                            .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3483                            .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3484                    DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3485                            .dwattr DW$251, DW_AT_name("tsk_img_control_count"), DW_AT_symbol_name("_tsk_img_control_count
    3486                            .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3487                            .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3488                    DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3489                            .dwattr DW$252, DW_AT_name("tsk_alg_control"), DW_AT_symbol_name("_tsk_alg_control")
    3490                            .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3491                            .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3492                    DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3493                            .dwattr DW$253, DW_AT_name("tsk_alg_control_count"), DW_AT_symbol_name("_tsk_alg_control_count
    3494                            .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3495                            .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3496                    DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3497                            .dwattr DW$254, DW_AT_name("tsk_adc_value"), DW_AT_symbol_name("_tsk_adc_value")
    3498                            .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3499                            .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3500                            .dwendtag DW$T$34
    3501                    
    3502                    
    3503                    DW$T$35 .dwtag  DW_TAG_structure_type
    3504                            .dwattr DW$T$35, DW_AT_name("dsp_tsk_policy_t")
    3505                            .dwattr DW$T$35, DW_AT_byte_size(0x0c)
    3506                    DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3507                            .dwattr DW$255, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    3508                            .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3509                            .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3510                    DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3511                            .dwattr DW$256, DW_AT_name("try_count"), DW_AT_symbol_name("_try_count")
    3512                            .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3513                            .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3514                    DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3515                            .dwattr DW$257, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    3516                            .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3517                            .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3518                    DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3519                            .dwattr DW$258, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    3520                            .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   65

    3521                            .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3522                    DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3523                            .dwattr DW$259, DW_AT_name("policy_flag"), DW_AT_symbol_name("_policy_flag")
    3524                            .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3525                            .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3526                            .dwendtag DW$T$35
    3527                    
    3528                    
    3529                    DW$T$38 .dwtag  DW_TAG_structure_type
    3530                            .dwattr DW$T$38, DW_AT_name("dsp_tsk_flag_t")
    3531                            .dwattr DW$T$38, DW_AT_byte_size(0x1c)
    3532                    DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3533                            .dwattr DW$260, DW_AT_name("tsk_img_resp"), DW_AT_symbol_name("_tsk_img_resp")
    3534                            .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3535                            .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3536                    DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3537                            .dwattr DW$261, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    3538                            .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3539                            .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3540                    DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3541                            .dwattr DW$262, DW_AT_name("tsk_alg_status_count"), DW_AT_symbol_name("_tsk_alg_status_count")
    3542                            .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3543                            .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3544                    DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3545                            .dwattr DW$263, DW_AT_name("req_tsk_alg_control"), DW_AT_symbol_name("_req_tsk_alg_control")
    3546                            .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3547                            .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3548                    DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3549                            .dwattr DW$264, DW_AT_name("req_tsk_alg_control_count"), DW_AT_symbol_name("_req_tsk_alg_contr
    3550                            .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3551                            .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3552                    DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3553                            .dwattr DW$265, DW_AT_name("left_data"), DW_AT_symbol_name("_left_data")
    3554                            .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3555                            .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3556                    DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3557                            .dwattr DW$266, DW_AT_name("right_data"), DW_AT_symbol_name("_right_data")
    3558                            .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3559                            .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3560                            .dwendtag DW$T$38
    3561                    
    3562                    
    3563                    DW$T$40 .dwtag  DW_TAG_structure_type
    3564                            .dwattr DW$T$40, DW_AT_name("dsp_algorithm_result_t")
    3565                            .dwattr DW$T$40, DW_AT_byte_size(0x20)
    3566                    DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3567                            .dwattr DW$267, DW_AT_name("result_type"), DW_AT_symbol_name("_result_type")
    3568                            .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3569                            .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3570                    DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    3571                            .dwattr DW$268, DW_AT_name("policy"), DW_AT_symbol_name("_policy")
    3572                            .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3573                            .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3574                    DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3575                            .dwattr DW$269, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   66

    3576                            .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3577                            .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3578                    DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3579                            .dwattr DW$270, DW_AT_name("left_result"), DW_AT_symbol_name("_left_result")
    3580                            .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3581                            .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3582                    DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3583                            .dwattr DW$271, DW_AT_name("right_result"), DW_AT_symbol_name("_right_result")
    3584                            .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3585                            .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3586                    DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    3587                            .dwattr DW$272, DW_AT_name("result_data"), DW_AT_symbol_name("_result_data")
    3588                            .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3589                            .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3590                            .dwendtag DW$T$40
    3591                    
    3592                    
    3593                    DW$T$41 .dwtag  DW_TAG_structure_type
    3594                            .dwattr DW$T$41, DW_AT_name("dsp_algorithm_sound_t")
    3595                            .dwattr DW$T$41, DW_AT_byte_size(0x08)
    3596                    DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3597                            .dwattr DW$273, DW_AT_name("sound_value"), DW_AT_symbol_name("_sound_value")
    3598                            .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3599                            .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3600                    DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3601                            .dwattr DW$274, DW_AT_name("sound_count"), DW_AT_symbol_name("_sound_count")
    3602                            .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3603                            .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3604                            .dwendtag DW$T$41
    3605                    
    3606                    
    3607                    DW$T$43 .dwtag  DW_TAG_structure_type
    3608                            .dwattr DW$T$43, DW_AT_name("dsp_algorithm_devparam_t")
    3609                            .dwattr DW$T$43, DW_AT_byte_size(0x54)
    3610                    DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3611                            .dwattr DW$275, DW_AT_name("param_count"), DW_AT_symbol_name("_param_count")
    3612                            .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3613                            .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3614                    DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    3615                            .dwattr DW$276, DW_AT_name("device_param"), DW_AT_symbol_name("_device_param")
    3616                            .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3617                            .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3618                            .dwendtag DW$T$43
    3619                    
    3620                    
    3621                    DW$T$44 .dwtag  DW_TAG_structure_type
    3622                            .dwattr DW$T$44, DW_AT_name("dsp_tsk_watchdog_t")
    3623                            .dwattr DW$T$44, DW_AT_byte_size(0x08)
    3624                    DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3625                            .dwattr DW$277, DW_AT_name("tsk_img_watchdog"), DW_AT_symbol_name("_tsk_img_watchdog")
    3626                            .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3627                            .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3628                    DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3629                            .dwattr DW$278, DW_AT_name("tsk_alg_watchdog"), DW_AT_symbol_name("_tsk_alg_watchdog")
    3630                            .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   67

    3631                            .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3632                            .dwendtag DW$T$44
    3633                    
    3634                    
    3635                    DW$T$45 .dwtag  DW_TAG_structure_type
    3636                            .dwattr DW$T$45, DW_AT_name("dsp_icon_t")
    3637                            .dwattr DW$T$45, DW_AT_byte_size(0x14)
    3638                    DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3639                            .dwattr DW$279, DW_AT_name("req_icon_control"), DW_AT_symbol_name("_req_icon_control")
    3640                            .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3641                            .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3642                    DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3643                            .dwattr DW$280, DW_AT_name("req_icon_id"), DW_AT_symbol_name("_req_icon_id")
    3644                            .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3645                            .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3646                    DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3647                            .dwattr DW$281, DW_AT_name("dsp_icon_state"), DW_AT_symbol_name("_dsp_icon_state")
    3648                            .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3649                            .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3650                    DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
    3651                            .dwattr DW$282, DW_AT_name("icon_data"), DW_AT_symbol_name("_icon_data")
    3652                            .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3653                            .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3654                            .dwendtag DW$T$45
    3655                    
    3656                    
    3657                    DW$T$47 .dwtag  DW_TAG_structure_type
    3658                            .dwattr DW$T$47, DW_AT_name("dsp_mac_t")
    3659                            .dwattr DW$T$47, DW_AT_byte_size(0x08)
    3660                    DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
    3661                            .dwattr DW$283, DW_AT_name("mac_val"), DW_AT_symbol_name("_mac_val")
    3662                            .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3663                            .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3664                            .dwendtag DW$T$47
    3665                    
    3666                    
    3667                    DW$T$49 .dwtag  DW_TAG_structure_type
    3668                            .dwattr DW$T$49, DW_AT_name("dsp_copyimg_t")
    3669                            .dwattr DW$T$49, DW_AT_byte_size(0x08)
    3670                    DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3671                            .dwattr DW$284, DW_AT_name("left_param"), DW_AT_symbol_name("_left_param")
    3672                            .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3673                            .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3674                    DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    3675                            .dwattr DW$285, DW_AT_name("right_param"), DW_AT_symbol_name("_right_param")
    3676                            .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3677                            .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3678                            .dwendtag DW$T$49
    3679                    
    3680                    
    3681                    DW$T$52 .dwtag  DW_TAG_structure_type
    3682                            .dwattr DW$T$52, DW_AT_name("dsp_testimg_t")
    3683                            .dwattr DW$T$52, DW_AT_byte_size(0x28)
    3684                    DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3685                            .dwattr DW$286, DW_AT_name("left_eye"), DW_AT_symbol_name("_left_eye")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   68

    3686                            .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3687                            .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3688                    DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
    3689                            .dwattr DW$287, DW_AT_name("right_eye"), DW_AT_symbol_name("_right_eye")
    3690                            .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3691                            .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3692                            .dwendtag DW$T$52
    3693                    
    3694                    
    3695                    DW$T$53 .dwtag  DW_TAG_structure_type
    3696                            .dwattr DW$T$53, DW_AT_name("dsp_distance_ctrl_t")
    3697                            .dwattr DW$T$53, DW_AT_byte_size(0x10)
    3698                    DW$288  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3699                            .dwattr DW$288, DW_AT_name("adc_noperson"), DW_AT_symbol_name("_adc_noperson")
    3700                            .dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3701                            .dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3702                    DW$289  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3703                            .dwattr DW$289, DW_AT_name("adc_toofar"), DW_AT_symbol_name("_adc_toofar")
    3704                            .dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    3705                            .dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3706                    DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3707                            .dwattr DW$290, DW_AT_name("adc_ok"), DW_AT_symbol_name("_adc_ok")
    3708                            .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3709                            .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3710                    DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3711                            .dwattr DW$291, DW_AT_name("adc_tooclose"), DW_AT_symbol_name("_adc_tooclose")
    3712                            .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    3713                            .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3714                    DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3715                            .dwattr DW$292, DW_AT_name("adc_smooth"), DW_AT_symbol_name("_adc_smooth")
    3716                            .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3717                            .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3718                    DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3719                            .dwattr DW$293, DW_AT_name("adc_noperson_disp"), DW_AT_symbol_name("_adc_noperson_disp")
    3720                            .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3721                            .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3722                    DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3723                            .dwattr DW$294, DW_AT_name("adc_play_sound"), DW_AT_symbol_name("_adc_play_sound")
    3724                            .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3725                            .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3726                    DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3727                            .dwattr DW$295, DW_AT_name("adc_nouse"), DW_AT_symbol_name("_adc_nouse")
    3728                            .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    3729                            .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3730                            .dwendtag DW$T$53
    3731                    
    3732                    
    3733                    DW$T$56 .dwtag  DW_TAG_structure_type
    3734                            .dwattr DW$T$56, DW_AT_name("dsp_buildtime_t")
    3735                            .dwattr DW$T$56, DW_AT_byte_size(0x20)
    3736                    DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    3737                            .dwattr DW$296, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
    3738                            .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3739                            .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3740                            .dwendtag DW$T$56
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   69

    3741                    
    3742                    
    3743                    DW$T$57 .dwtag  DW_TAG_structure_type
    3744                            .dwattr DW$T$57, DW_AT_name("switch_control_t")
    3745                            .dwattr DW$T$57, DW_AT_byte_size(0x04)
    3746                    DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3747                            .dwattr DW$297, DW_AT_name("ctrls"), DW_AT_symbol_name("_ctrls")
    3748                            .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3749                            .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3750                            .dwendtag DW$T$57
    3751                    
    3752                    
    3753                    DW$T$89 .dwtag  DW_TAG_structure_type
    3754                            .dwattr DW$T$89, DW_AT_name("iris_loc_t")
    3755                            .dwattr DW$T$89, DW_AT_byte_size(0x54)
    3756                    DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3757                            .dwattr DW$298, DW_AT_name("pos_pupil"), DW_AT_symbol_name("_pos_pupil")
    3758                            .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3759                            .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3760                    DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    3761                            .dwattr DW$299, DW_AT_name("pos_iris"), DW_AT_symbol_name("_pos_iris")
    3762                            .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3763                            .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3764                    DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3765                            .dwattr DW$300, DW_AT_name("overallVisiblePercent"), DW_AT_symbol_name("_overallVisiblePercent
    3766                            .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3767                            .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3768                    DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3769                            .dwattr DW$301, DW_AT_name("focusScore"), DW_AT_symbol_name("_focusScore")
    3770                            .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3771                            .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3772                    DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3773                            .dwattr DW$302, DW_AT_name("percentVisible"), DW_AT_symbol_name("_percentVisible")
    3774                            .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3775                            .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3776                    DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3777                            .dwattr DW$303, DW_AT_name("numValidBits"), DW_AT_symbol_name("_numValidBits")
    3778                            .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    3779                            .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3780                    DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3781                            .dwattr DW$304, DW_AT_name("spoofValue"), DW_AT_symbol_name("_spoofValue")
    3782                            .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3783                            .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3784                    DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3785                            .dwattr DW$305, DW_AT_name("SNR"), DW_AT_symbol_name("_SNR")
    3786                            .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    3787                            .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3788                    DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3789                            .dwattr DW$306, DW_AT_name("Saturation"), DW_AT_symbol_name("_Saturation")
    3790                            .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    3791                            .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3792                    DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3793                            .dwattr DW$307, DW_AT_name("interlaceValue"), DW_AT_symbol_name("_interlaceValue")
    3794                            .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    3795                            .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   70

    3796                    DW$308  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3797                            .dwattr DW$308, DW_AT_name("reflectionRatioInROI"), DW_AT_symbol_name("_reflectionRatioInROI")
    3798                            .dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    3799                            .dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3800                    DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3801                            .dwattr DW$309, DW_AT_name("reflectionRatioInImage"), DW_AT_symbol_name("_reflectionRatioInIma
    3802                            .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    3803                            .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3804                    DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3805                            .dwattr DW$310, DW_AT_name("qualityLevel"), DW_AT_symbol_name("_qualityLevel")
    3806                            .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    3807                            .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3808                    DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3809                            .dwattr DW$311, DW_AT_name("locMethod"), DW_AT_symbol_name("_locMethod")
    3810                            .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    3811                            .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3812                    DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3813                            .dwattr DW$312, DW_AT_name("ifSpoofDetect"), DW_AT_symbol_name("_ifSpoofDetect")
    3814                            .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    3815                            .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3816                            .dwendtag DW$T$89
    3817                    
    3818                    
    3819                    DW$T$93 .dwtag  DW_TAG_structure_type
    3820                            .dwattr DW$T$93, DW_AT_name("dsp_result_data_header_t")
    3821                            .dwattr DW$T$93, DW_AT_byte_size(0x0c)
    3822                    DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3823                            .dwattr DW$313, DW_AT_name("result_count"), DW_AT_symbol_name("_result_count")
    3824                            .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3825                            .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3826                    DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3827                            .dwattr DW$314, DW_AT_name("result_byte_len"), DW_AT_symbol_name("_result_byte_len")
    3828                            .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3829                            .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3830                    DW$315  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3831                            .dwattr DW$315, DW_AT_name("result_chksum"), DW_AT_symbol_name("_result_chksum")
    3832                            .dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3833                            .dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3834                    DW$316  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    3835                            .dwattr DW$316, DW_AT_name("algorithm_version"), DW_AT_symbol_name("_algorithm_version")
    3836                            .dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    3837                            .dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3838                            .dwendtag DW$T$93
    3839                    
    3840                    
    3841                    DW$T$46 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    3842                            .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    3843                            .dwattr DW$T$46, DW_AT_byte_size(0x08)
    3844                    DW$317  .dwtag  DW_TAG_subrange_type
    3845                            .dwattr DW$317, DW_AT_upper_bound(0x07)
    3846                            .dwendtag DW$T$46
    3847                    
    3848                    DW$T$8  .dwtag  DW_TAG_base_type, DW_AT_name("short")
    3849                            .dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3850                            .dwattr DW$T$8, DW_AT_byte_size(0x02)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   71

    3851                    
    3852                    DW$T$42 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    3853                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
    3854                            .dwattr DW$T$42, DW_AT_byte_size(0x50)
    3855                    DW$318  .dwtag  DW_TAG_subrange_type
    3856                            .dwattr DW$318, DW_AT_upper_bound(0x13)
    3857                            .dwendtag DW$T$42
    3858                    
    3859                    
    3860                    DW$T$24 .dwtag  DW_TAG_structure_type
    3861                            .dwattr DW$T$24, DW_AT_name("dsp_image_msg_t")
    3862                            .dwattr DW$T$24, DW_AT_byte_size(0x34)
    3863                    DW$319  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3864                            .dwattr DW$319, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    3865                            .dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3866                            .dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3867                    DW$320  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3868                            .dwattr DW$320, DW_AT_name("img_saved_score_l"), DW_AT_symbol_name("_img_saved_score_l")
    3869                            .dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3870                            .dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3871                    DW$321  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3872                            .dwattr DW$321, DW_AT_name("img_saved_score_r"), DW_AT_symbol_name("_img_saved_score_r")
    3873                            .dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3874                            .dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3875                    DW$322  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3876                            .dwattr DW$322, DW_AT_name("img_ptr_l"), DW_AT_symbol_name("_img_ptr_l")
    3877                            .dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3878                            .dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3879                    DW$323  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    3880                            .dwattr DW$323, DW_AT_name("img_ptr_r"), DW_AT_symbol_name("_img_ptr_r")
    3881                            .dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3882                            .dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3883                    DW$324  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3884                            .dwattr DW$324, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    3885                            .dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3886                            .dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3887                    DW$325  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    3888                            .dwattr DW$325, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    3889                            .dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3890                            .dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
    3891                    DW$326  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3892                            .dwattr DW$326, DW_AT_name("img_saved_count_l"), DW_AT_symbol_name("_img_saved_count_l")
    3893                            .dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3894                            .dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
    3895                    DW$327  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3896                            .dwattr DW$327, DW_AT_name("img_saved_count_r"), DW_AT_symbol_name("_img_saved_count_r")
    3897                            .dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    3898                            .dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
    3899                    DW$328  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3900                            .dwattr DW$328, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    3901                            .dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    3902                            .dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
    3903                    DW$329  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3904                            .dwattr DW$329, DW_AT_name("data_type_l"), DW_AT_symbol_name("_data_type_l")
    3905                            .dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 31 17:05:45 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8242                          PAGE   72

    3906                            .dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
    3907                    DW$330  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    3908                            .dwattr DW$330, DW_AT_name("data_type_r"), DW_AT_symbol_name("_data_type_r")
    3909                            .dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    3910                            .dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3911                            .dwendtag DW$T$24
    3912                    
    3913                    
    3914                    DW$T$25 .dwtag  DW_TAG_structure_type
    3915                            .dwattr DW$T$25, DW_AT_name("dsp_result_msg_t")
    3916                            .dwattr DW$T$25, DW_AT_byte_size(0x1c)
    3917                    DW$331  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    3918                            .dwattr DW$331, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    3919                            .dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
