TMS320C6x COFF Assembler PC v5.1.0 Fri Apr 01 12:24:11 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI0242                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Apr 01 12:24:11 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

      56 00000038 00010000          .field          1,16                    ; _EMB_vCapParamsChan._fldYStrt2 @ 400
      57 0000003c 000004FF          .field          1279,16                 ; _EMB_vCapParamsChan._fldXStop1 @ 416
      58 0000003c 01E004FF          .field          480,16                  ; _EMB_vCapParamsChan._fldYStop1 @ 432
      59 00000040 000004FF          .field          1279,16                 ; _EMB_vCapParamsChan._fldXStop2 @ 448
      60 00000040 01E004FF          .field          480,16                  ; _EMB_vCapParamsChan._fldYStop2 @ 464
      61 00000044 00000050          .field          80,16                   ; _EMB_vCapParamsChan._thrld @ 480
      62 00000044 00000050          .field          0,16
      63 00000048 00000003          .field          3,32                    ; _EMB_vCapParamsChan._numFrmBufs @ 512
      64 0000004c 00000080          .field          128,32                  ; _EMB_vCapParamsChan._alignment @ 544
      65 00000050 00000001          .field          1,32                    ; _EMB_vCapParamsChan._mergeFlds @ 576
      66 00000054 00000000          .field          0,32                    ; _EMB_vCapParamsChan._segId @ 608
      67 00000058 00000001          .field          1,32                    ; _EMB_vCapParamsChan._edmaPri @ 640
      68 0000005c 00000009          .field          9,32                    ; _EMB_vCapParamsChan._irqId @ 672
      69          00000058  IR_1:   .set    88
      70                    
      71 00000060                   .sect   ".cinit"
      72                            .align  8
      73 00000060 00000018          .field          IR_2,32
      74 00000064 00000058-         .field          _EMB_vCapParamsPort+0,32
      75 00000068 00000000          .field          0,16                    ; _EMB_vCapParamsPort._dualChanEnable @ 0
      76 00000068 00000000          .field          0,16
      77 0000006c 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc1Polarity @ 32
      78 00000070 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc2Polarity @ 64
      79 00000074 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc3Polarity @ 96
      80 00000078 00000000!         .field          _OV7725_Fxns,32         ; _EMB_vCapParamsPort._edcTbl[0] @ 128
      81 0000007c FFFFFFFF          .field          -1,32                   ; _EMB_vCapParamsPort._edcTbl[1] @ 160
      82          00000018  IR_2:   .set    24
      83                    
      84                    DW$1    .dwtag  DW_TAG_variable, DW_AT_name("OV7725_Fxns"), DW_AT_symbol_name("_OV7725_Fxns")
      85                            .dwattr DW$1, DW_AT_type(*DW$T$38)
      86                            .dwattr DW$1, DW_AT_declaration(0x01)
      87                            .dwattr DW$1, DW_AT_external(0x01)
      88                            .global _EMB_vCapParamsChan
      89 00000000           _EMB_vCapParamsChan:    .usect  ".far",88,4
      90                    DW$2    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vCapParamsChan"), DW_AT_symbol_name("_EMB_vCapParamsC
      91                            .dwattr DW$2, DW_AT_location[DW_OP_addr _EMB_vCapParamsChan]
      92                            .dwattr DW$2, DW_AT_type(*DW$T$42)
      93                            .dwattr DW$2, DW_AT_external(0x01)
      94                            .global _EMB_vCapParamsPort
      95 00000058           _EMB_vCapParamsPort:    .usect  ".far",24,4
      96                    DW$3    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vCapParamsPort"), DW_AT_symbol_name("_EMB_vCapParamsP
      97                            .dwattr DW$3, DW_AT_location[DW_OP_addr _EMB_vCapParamsPort]
      98                            .dwattr DW$3, DW_AT_type(*DW$T$43)
      99                            .dwattr DW$3, DW_AT_external(0x01)
     100                    ;       C:\CCStudio_v3.1\C6000\cgtools\bin\acp6x.exe -@C:\Users\ADMINI~1\AppData\Local\Temp\TI0244 
     101                    ;******************************************************************************
     102                    ;* UNDEFINED EXTERNAL REFERENCES                                              *
     103                    ;******************************************************************************
     104                            .global _OV7725_Fxns
     105                    
     106                    ;******************************************************************************
     107                    ;* TYPE INFORMATION                                                           *
     108                    ;******************************************************************************
     109                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$33)
     110                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Fri Apr 01 12:24:11 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI0242                          PAGE    3

     111                    DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$35)
     112                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     113                    DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("VPORT_PortParams"), DW_AT_type(*DW$T$41)
     114                            .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     115                    
     116                    DW$T$33 .dwtag  DW_TAG_structure_type
     117                            .dwattr DW$T$33, DW_AT_name("EDC_Fxns")
     118                            .dwattr DW$T$33, DW_AT_byte_size(0x0c)
     119                    DW$4    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     120                            .dwattr DW$4, DW_AT_name("open"), DW_AT_symbol_name("_open")
     121                            .dwattr DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     122                            .dwattr DW$4, DW_AT_accessibility(DW_ACCESS_public)
     123                    DW$5    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     124                            .dwattr DW$5, DW_AT_name("close"), DW_AT_symbol_name("_close")
     125                            .dwattr DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     126                            .dwattr DW$5, DW_AT_accessibility(DW_ACCESS_public)
     127                    DW$6    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
     128                            .dwattr DW$6, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
     129                            .dwattr DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     130                            .dwattr DW$6, DW_AT_accessibility(DW_ACCESS_public)
     131                            .dwendtag DW$T$33
     132                    
     133                    
     134                    DW$T$35 .dwtag  DW_TAG_structure_type
     135                            .dwattr DW$T$35, DW_AT_byte_size(0x58)
     136                    DW$7    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     137                            .dwattr DW$7, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
     138                            .dwattr DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     139                            .dwattr DW$7, DW_AT_accessibility(DW_ACCESS_public)
     140                    DW$8    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     141                            .dwattr DW$8, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
     142                            .dwattr DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     143                            .dwattr DW$8, DW_AT_accessibility(DW_ACCESS_public)
     144                    DW$9    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     145                            .dwattr DW$9, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
     146                            .dwattr DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     147                            .dwattr DW$9, DW_AT_accessibility(DW_ACCESS_public)
     148                    DW$10   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     149                            .dwattr DW$10, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
     150                            .dwattr DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     151                            .dwattr DW$10, DW_AT_accessibility(DW_ACCESS_public)
     152                    DW$11   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     153                            .dwattr DW$11, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
     154                            .dwattr DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     155                            .dwattr DW$11, DW_AT_accessibility(DW_ACCESS_public)
     156                    DW$12   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     157                            .dwattr DW$12, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
     158                            .dwattr DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     159                            .dwattr DW$12, DW_AT_accessibility(DW_ACCESS_public)
     160                    DW$13   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     161                            .dwattr DW$13, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
     162                            .dwattr DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     163                            .dwattr DW$13, DW_AT_accessibility(DW_ACCESS_public)
     164                    DW$14   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     165                            .dwattr DW$14, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
TMS320C6x COFF Assembler PC v5.1.0 Fri Apr 01 12:24:11 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI0242                          PAGE    4

     166                            .dwattr DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     167                            .dwattr DW$14, DW_AT_accessibility(DW_ACCESS_public)
     168                    DW$15   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     169                            .dwattr DW$15, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
     170                            .dwattr DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     171                            .dwattr DW$15, DW_AT_accessibility(DW_ACCESS_public)
     172                    DW$16   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     173                            .dwattr DW$16, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
     174                            .dwattr DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     175                            .dwattr DW$16, DW_AT_accessibility(DW_ACCESS_public)
     176                    DW$17   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     177                            .dwattr DW$17, DW_AT_name("sse"), DW_AT_symbol_name("_sse")
     178                            .dwattr DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     179                            .dwattr DW$17, DW_AT_accessibility(DW_ACCESS_public)
     180                    DW$18   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     181                            .dwattr DW$18, DW_AT_name("vcvblnkp"), DW_AT_symbol_name("_vcvblnkp")
     182                            .dwattr DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     183                            .dwattr DW$18, DW_AT_accessibility(DW_ACCESS_public)
     184                    DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     185                            .dwattr DW$19, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
     186                            .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     187                            .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
     188                    DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     189                            .dwattr DW$20, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
     190                            .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     191                            .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
     192                    DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     193                            .dwattr DW$21, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
     194                            .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     195                            .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
     196                    DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     197                            .dwattr DW$22, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
     198                            .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     199                            .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     200                    DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     201                            .dwattr DW$23, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
     202                            .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     203                            .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     204                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     205                            .dwattr DW$24, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
     206                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     207                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     208                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     209                            .dwattr DW$25, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
     210                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     211                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     212                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     213                            .dwattr DW$26, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
     214                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     215                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     216                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     217                            .dwattr DW$27, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
     218                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     219                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     220                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
TMS320C6x COFF Assembler PC v5.1.0 Fri Apr 01 12:24:11 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI0242                          PAGE    5

     221                            .dwattr DW$28, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
     222                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     223                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     224                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     225                            .dwattr DW$29, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
     226                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     227                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     228                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     229                            .dwattr DW$30, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
     230                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     231                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     232                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     233                            .dwattr DW$31, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
     234                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     235                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     236                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     237                            .dwattr DW$32, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
     238                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     239                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     240                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     241                            .dwattr DW$33, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
     242                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     243                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     244                            .dwendtag DW$T$35
     245                    
     246                    
     247                    DW$T$41 .dwtag  DW_TAG_structure_type
     248                            .dwattr DW$T$41, DW_AT_name("VPORT_PortParams")
     249                            .dwattr DW$T$41, DW_AT_byte_size(0x18)
     250                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
     251                            .dwattr DW$34, DW_AT_name("dualChanEnable"), DW_AT_symbol_name("_dualChanEnable")
     252                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     253                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     254                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     255                            .dwattr DW$35, DW_AT_name("vc1Polarity"), DW_AT_symbol_name("_vc1Polarity")
     256                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     257                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     258                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     259                            .dwattr DW$36, DW_AT_name("vc2Polarity"), DW_AT_symbol_name("_vc2Polarity")
     260                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     261                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     262                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     263                            .dwattr DW$37, DW_AT_name("vc3Polarity"), DW_AT_symbol_name("_vc3Polarity")
     264                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     265                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     266                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
     267                            .dwattr DW$38, DW_AT_name("edcTbl"), DW_AT_symbol_name("_edcTbl")
     268                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     269                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     270                            .dwendtag DW$T$41
     271                    
     272                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     273                            .dwattr DW$T$26, DW_AT_address_class(0x20)
     274                    DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
     275                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Fri Apr 01 12:24:11 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI0242                          PAGE    6

     276                    DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$36)
     277                            .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
     278                    DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
     279                            .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     280                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
     281                            .dwattr DW$T$29, DW_AT_address_class(0x20)
     282                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
     283                            .dwattr DW$T$32, DW_AT_address_class(0x20)
     284                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     285                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     286                    
     287                    DW$T$40 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$39)
     288                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     289                            .dwattr DW$T$40, DW_AT_byte_size(0x08)
     290                    DW$39   .dwtag  DW_TAG_subrange_type
     291                            .dwattr DW$39, DW_AT_upper_bound(0x01)
     292                            .dwendtag DW$T$40
     293                    
     294                    
     295                    DW$T$25 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     296                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
     297                    DW$40   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     298                    DW$41   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     299                            .dwendtag DW$T$25
     300                    
     301                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     302                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     303                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     304                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
     305                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     306                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     307                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     308                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     309                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$23)
     310                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     311                    
     312                    DW$T$28 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
     313                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     314                    DW$42   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     315                            .dwendtag DW$T$28
     316                    
     317                    
     318                    DW$T$31 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
