TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 16:10:43 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8082                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Tue Apr 05 16:10:42 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8082                          PAGE    2

      56 00000038 01E0027F          .field          480,16                  ; _EMB_vCapParamsChan._fldYStop1 @ 400
      57 0000003c 0000027F          .field          639,16                  ; _EMB_vCapParamsChan._fldXStop2 @ 416
      58 0000003c 01E0027F          .field          480,16                  ; _EMB_vCapParamsChan._fldYStop2 @ 432
      59 00000040 00000050          .field          80,16                   ; _EMB_vCapParamsChan._thrld @ 448
      60 00000040 00000050          .field          0,16
      61 00000044 00000003          .field          3,32                    ; _EMB_vCapParamsChan._numFrmBufs @ 480
      62 00000048 00000080          .field          128,32                  ; _EMB_vCapParamsChan._alignment @ 512
      63 0000004c 00000001          .field          1,32                    ; _EMB_vCapParamsChan._mergeFlds @ 544
      64 00000050 00000000          .field          0,32                    ; _EMB_vCapParamsChan._segId @ 576
      65 00000054 00000001          .field          1,32                    ; _EMB_vCapParamsChan._edmaPri @ 608
      66 00000058 00000008          .field          8,32                    ; _EMB_vCapParamsChan._irqId @ 640
      67 0000005c 00000001          .field          1,16                    ; _EMB_vCapParamsChan._autoSyncEnable @ 672
      68          00000056  IR_1:   .set    86
      69                    
      70 0000005e                   .sect   ".cinit"
      71                            .align  8
      72 00000060 00000018          .field          IR_2,32
      73 00000064 00000058-         .field          _EMB_vCapParamsPort+0,32
      74 00000068 00000000          .field          0,16                    ; _EMB_vCapParamsPort._dualChanEnable @ 0
      75 00000068 00000000          .field          0,16
      76 0000006c 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc1Polarity @ 32
      77 00000070 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc2Polarity @ 64
      78 00000074 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc3Polarity @ 96
      79 00000078 00000000!         .field          _OV7725_Fxns,32         ; _EMB_vCapParamsPort._edcTbl[0] @ 128
      80 0000007c FFFFFFFF          .field          -1,32                   ; _EMB_vCapParamsPort._edcTbl[1] @ 160
      81          00000018  IR_2:   .set    24
      82                    
      83                    DW$1    .dwtag  DW_TAG_variable, DW_AT_name("OV7725_Fxns"), DW_AT_symbol_name("_OV7725_Fxns")
      84                            .dwattr DW$1, DW_AT_type(*DW$T$38)
      85                            .dwattr DW$1, DW_AT_declaration(0x01)
      86                            .dwattr DW$1, DW_AT_external(0x01)
      87                            .global _EMB_vCapParamsChan
      88 00000000           _EMB_vCapParamsChan:    .usect  ".far",88,4
      89                    DW$2    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vCapParamsChan"), DW_AT_symbol_name("_EMB_vCapParamsC
      90                            .dwattr DW$2, DW_AT_location[DW_OP_addr _EMB_vCapParamsChan]
      91                            .dwattr DW$2, DW_AT_type(*DW$T$42)
      92                            .dwattr DW$2, DW_AT_external(0x01)
      93                            .global _EMB_vCapParamsPort
      94 00000058           _EMB_vCapParamsPort:    .usect  ".far",24,4
      95                    DW$3    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vCapParamsPort"), DW_AT_symbol_name("_EMB_vCapParamsP
      96                            .dwattr DW$3, DW_AT_location[DW_OP_addr _EMB_vCapParamsPort]
      97                            .dwattr DW$3, DW_AT_type(*DW$T$43)
      98                            .dwattr DW$3, DW_AT_external(0x01)
      99                    ;       C:\CCStudio_v3.1\C6000\cgtools\bin\acp6x.exe -@C:\Users\ADMINI~1\AppData\Local\Temp\TI8084 
     100                    ;******************************************************************************
     101                    ;* UNDEFINED EXTERNAL REFERENCES                                              *
     102                    ;******************************************************************************
     103                            .global _OV7725_Fxns
     104                    
     105                    ;******************************************************************************
     106                    ;* TYPE INFORMATION                                                           *
     107                    ;******************************************************************************
     108                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$33)
     109                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     110                    DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$37)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 16:10:43 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8082                          PAGE    3

     111                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     112                    DW$T$43 .dwtag  DW_TAG_typedef, DW_AT_name("VPORT_PortParams"), DW_AT_type(*DW$T$41)
     113                            .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
     114                    
     115                    DW$T$33 .dwtag  DW_TAG_structure_type
     116                            .dwattr DW$T$33, DW_AT_name("EDC_Fxns")
     117                            .dwattr DW$T$33, DW_AT_byte_size(0x0c)
     118                    DW$4    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     119                            .dwattr DW$4, DW_AT_name("open"), DW_AT_symbol_name("_open")
     120                            .dwattr DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     121                            .dwattr DW$4, DW_AT_accessibility(DW_ACCESS_public)
     122                    DW$5    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     123                            .dwattr DW$5, DW_AT_name("close"), DW_AT_symbol_name("_close")
     124                            .dwattr DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     125                            .dwattr DW$5, DW_AT_accessibility(DW_ACCESS_public)
     126                    DW$6    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
     127                            .dwattr DW$6, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
     128                            .dwattr DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     129                            .dwattr DW$6, DW_AT_accessibility(DW_ACCESS_public)
     130                            .dwendtag DW$T$33
     131                    
     132                    
     133                    DW$T$37 .dwtag  DW_TAG_structure_type
     134                            .dwattr DW$T$37, DW_AT_byte_size(0x58)
     135                    DW$7    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     136                            .dwattr DW$7, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
     137                            .dwattr DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     138                            .dwattr DW$7, DW_AT_accessibility(DW_ACCESS_public)
     139                    DW$8    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     140                            .dwattr DW$8, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
     141                            .dwattr DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     142                            .dwattr DW$8, DW_AT_accessibility(DW_ACCESS_public)
     143                    DW$9    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     144                            .dwattr DW$9, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
     145                            .dwattr DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     146                            .dwattr DW$9, DW_AT_accessibility(DW_ACCESS_public)
     147                    DW$10   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     148                            .dwattr DW$10, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
     149                            .dwattr DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     150                            .dwattr DW$10, DW_AT_accessibility(DW_ACCESS_public)
     151                    DW$11   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     152                            .dwattr DW$11, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
     153                            .dwattr DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     154                            .dwattr DW$11, DW_AT_accessibility(DW_ACCESS_public)
     155                    DW$12   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     156                            .dwattr DW$12, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
     157                            .dwattr DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     158                            .dwattr DW$12, DW_AT_accessibility(DW_ACCESS_public)
     159                    DW$13   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     160                            .dwattr DW$13, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
     161                            .dwattr DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     162                            .dwattr DW$13, DW_AT_accessibility(DW_ACCESS_public)
     163                    DW$14   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     164                            .dwattr DW$14, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
     165                            .dwattr DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 16:10:43 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8082                          PAGE    4

     166                            .dwattr DW$14, DW_AT_accessibility(DW_ACCESS_public)
     167                    DW$15   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     168                            .dwattr DW$15, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
     169                            .dwattr DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     170                            .dwattr DW$15, DW_AT_accessibility(DW_ACCESS_public)
     171                    DW$16   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     172                            .dwattr DW$16, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
     173                            .dwattr DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     174                            .dwattr DW$16, DW_AT_accessibility(DW_ACCESS_public)
     175                    DW$17   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     176                            .dwattr DW$17, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
     177                            .dwattr DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     178                            .dwattr DW$17, DW_AT_accessibility(DW_ACCESS_public)
     179                    DW$18   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     180                            .dwattr DW$18, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
     181                            .dwattr DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     182                            .dwattr DW$18, DW_AT_accessibility(DW_ACCESS_public)
     183                    DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     184                            .dwattr DW$19, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
     185                            .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     186                            .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
     187                    DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     188                            .dwattr DW$20, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
     189                            .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     190                            .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
     191                    DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     192                            .dwattr DW$21, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
     193                            .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     194                            .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
     195                    DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     196                            .dwattr DW$22, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
     197                            .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     198                            .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     199                    DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     200                            .dwattr DW$23, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
     201                            .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     202                            .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     203                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     204                            .dwattr DW$24, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
     205                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     206                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     207                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     208                            .dwattr DW$25, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
     209                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     210                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     211                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     212                            .dwattr DW$26, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
     213                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     214                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     215                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     216                            .dwattr DW$27, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
     217                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     218                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     219                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     220                            .dwattr DW$28, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 16:10:43 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8082                          PAGE    5

     221                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     222                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     223                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     224                            .dwattr DW$29, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
     225                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     226                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     227                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     228                            .dwattr DW$30, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
     229                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     230                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     231                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     232                            .dwattr DW$31, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
     233                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     234                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     235                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     236                            .dwattr DW$32, DW_AT_name("autoSyncEnable"), DW_AT_symbol_name("_autoSyncEnable")
     237                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     238                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     239                            .dwendtag DW$T$37
     240                    
     241                    
     242                    DW$T$41 .dwtag  DW_TAG_structure_type
     243                            .dwattr DW$T$41, DW_AT_name("VPORT_PortParams")
     244                            .dwattr DW$T$41, DW_AT_byte_size(0x18)
     245                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     246                            .dwattr DW$33, DW_AT_name("dualChanEnable"), DW_AT_symbol_name("_dualChanEnable")
     247                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     248                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     249                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     250                            .dwattr DW$34, DW_AT_name("vc1Polarity"), DW_AT_symbol_name("_vc1Polarity")
     251                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     252                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     253                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     254                            .dwattr DW$35, DW_AT_name("vc2Polarity"), DW_AT_symbol_name("_vc2Polarity")
     255                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     256                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     257                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     258                            .dwattr DW$36, DW_AT_name("vc3Polarity"), DW_AT_symbol_name("_vc3Polarity")
     259                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     260                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     261                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
     262                            .dwattr DW$37, DW_AT_name("edcTbl"), DW_AT_symbol_name("_edcTbl")
     263                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     264                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     265                            .dwendtag DW$T$41
     266                    
     267                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     268                            .dwattr DW$T$26, DW_AT_address_class(0x20)
     269                    DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
     270                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     271                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$35)
     272                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     273                    DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
     274                            .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     275                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 16:10:43 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI8082                          PAGE    6

     276                            .dwattr DW$T$29, DW_AT_address_class(0x20)
     277                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
     278                            .dwattr DW$T$32, DW_AT_address_class(0x20)
     279                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     280                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     281                    
     282                    DW$T$40 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$39)
     283                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     284                            .dwattr DW$T$40, DW_AT_byte_size(0x08)
     285                    DW$38   .dwtag  DW_TAG_subrange_type
     286                            .dwattr DW$38, DW_AT_upper_bound(0x01)
     287                            .dwendtag DW$T$40
     288                    
     289                    
     290                    DW$T$25 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     291                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
     292                    DW$39   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     293                    DW$40   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     294                            .dwendtag DW$T$25
     295                    
     296                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     297                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     298                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     299                    DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
     300                            .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     301                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     302                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     303                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     304                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$23)
     305                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     306                    
     307                    DW$T$28 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
     308                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     309                    DW$41   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     310                            .dwendtag DW$T$28
     311                    
     312                    
     313                    DW$T$31 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
