TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Tue Apr 05 17:07:04 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    6079                            .dwattr DW$T$247, DW_AT_address_class(0x20)
    6080                    DW$T$214        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$213)
    6081                            .dwattr DW$T$214, DW_AT_address_class(0x20)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  116

    6082                    DW$T$184        .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$183)
    6083                            .dwattr DW$T$184, DW_AT_language(DW_LANG_C)
    6084                    DW$T$157        .dwtag  DW_TAG_typedef, DW_AT_name("BUF_Handle"), DW_AT_type(*DW$T$156)
    6085                            .dwattr DW$T$157, DW_AT_language(DW_LANG_C)
    6086                    DW$T$251        .dwtag  DW_TAG_typedef, DW_AT_name("BUF_Obj"), DW_AT_type(*DW$T$69)
    6087                            .dwattr DW$T$251, DW_AT_language(DW_LANG_C)
    6088                    DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("IMAGE_MSG"), DW_AT_type(*DW$T$73)
    6089                            .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    6090                    DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("RESULT_MSG"), DW_AT_type(*DW$T$75)
    6091                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    6092                    DW$T$192        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_procimg_t"), DW_AT_type(*DW$T$79)
    6093                            .dwattr DW$T$192, DW_AT_language(DW_LANG_C)
    6094                    DW$T$193        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$192)
    6095                            .dwattr DW$T$193, DW_AT_address_class(0x20)
    6096                    DW$T$252        .dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$81)
    6097                            .dwattr DW$T$252, DW_AT_language(DW_LANG_C)
    6098                    DW$T$255        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$254)
    6099                            .dwattr DW$T$255, DW_AT_address_class(0x20)
    6100                    DW$T$108        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$97)
    6101                            .dwattr DW$T$108, DW_AT_address_class(0x20)
    6102                    DW$T$258        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$257)
    6103                            .dwattr DW$T$258, DW_AT_address_class(0x20)
    6104                    DW$T$259        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_reg_t"), DW_AT_type(*DW$T$144)
    6105                            .dwattr DW$T$259, DW_AT_language(DW_LANG_C)
    6106                    DW$T$262        .dwtag  DW_TAG_typedef, DW_AT_name("MATCH_MSG"), DW_AT_type(*DW$T$261)
    6107                            .dwattr DW$T$262, DW_AT_language(DW_LANG_C)
    6108                    DW$T$263        .dwtag  DW_TAG_typedef, DW_AT_name("VPORT_VIntCbParams"), DW_AT_type(*DW$T$149)
    6109                            .dwattr DW$T$263, DW_AT_language(DW_LANG_C)
    6110                    DW$T$264        .dwtag  DW_TAG_const_type
    6111                            .dwattr DW$T$264, DW_AT_type(*DW$T$263)
    6112                    DW$T$266        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$265)
    6113                            .dwattr DW$T$266, DW_AT_address_class(0x20)
    6114                    DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$160)
    6115                            .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    6116                    DW$T$165        .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Wait"), DW_AT_type(*DW$T$164)
    6117                            .dwattr DW$T$165, DW_AT_language(DW_LANG_C)
    6118                    DW$T$151        .dwtag  DW_TAG_const_type
    6119                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    6120                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    6121                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    6122                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    6123                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    6124                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    6125                    DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
    6126                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    6127                    DW$T$168        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
    6128                            .dwattr DW$T$168, DW_AT_address_class(0x20)
    6129                    DW$T$41 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    6130                            .dwattr DW$T$41, DW_AT_encoding(DW_ATE_signed_char)
    6131                            .dwattr DW$T$41, DW_AT_byte_size(0x01)
    6132                    DW$T$217        .dwtag  DW_TAG_const_type
    6133                            .dwattr DW$T$217, DW_AT_type(*DW$T$41)
    6134                    DW$T$207        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
    6135                            .dwattr DW$T$207, DW_AT_address_class(0x20)
    6136                    
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  117

    6137                    DW$T$62 .dwtag  DW_TAG_structure_type
    6138                            .dwattr DW$T$62, DW_AT_name("GIO_Attrs")
    6139                            .dwattr DW$T$62, DW_AT_byte_size(0x08)
    6140                    DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6141                            .dwattr DW$383, DW_AT_name("nPackets"), DW_AT_symbol_name("_nPackets")
    6142                            .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6143                            .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    6144                    DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6145                            .dwattr DW$384, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    6146                            .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6147                            .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6148                            .dwendtag DW$T$62
    6149                    
    6150                    DW$T$213        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_AppCallback"), DW_AT_type(*DW$T$66)
    6151                            .dwattr DW$T$213, DW_AT_language(DW_LANG_C)
    6152                    DW$T$183        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$67)
    6153                            .dwattr DW$T$183, DW_AT_address_class(0x20)
    6154                    
    6155                    DW$T$69 .dwtag  DW_TAG_structure_type
    6156                            .dwattr DW$T$69, DW_AT_name("BUF_Obj")
    6157                            .dwattr DW$T$69, DW_AT_byte_size(0x1c)
    6158                    DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6159                            .dwattr DW$385, DW_AT_name("startaddr"), DW_AT_symbol_name("_startaddr")
    6160                            .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6161                            .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6162                    DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    6163                            .dwattr DW$386, DW_AT_name("size"), DW_AT_symbol_name("_size")
    6164                            .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6165                            .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6166                    DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    6167                            .dwattr DW$387, DW_AT_name("postalignsize"), DW_AT_symbol_name("_postalignsize")
    6168                            .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6169                            .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6170                    DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6171                            .dwattr DW$388, DW_AT_name("nextfree"), DW_AT_symbol_name("_nextfree")
    6172                            .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6173                            .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6174                    DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6175                            .dwattr DW$389, DW_AT_name("totalbuffers"), DW_AT_symbol_name("_totalbuffers")
    6176                            .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6177                            .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6178                    DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6179                            .dwattr DW$390, DW_AT_name("freebuffers"), DW_AT_symbol_name("_freebuffers")
    6180                            .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6181                            .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6182                    DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6183                            .dwattr DW$391, DW_AT_name("segid"), DW_AT_symbol_name("_segid")
    6184                            .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6185                            .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6186                            .dwendtag DW$T$69
    6187                    
    6188                    DW$T$156        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$69)
    6189                            .dwattr DW$T$156, DW_AT_address_class(0x20)
    6190                    DW$T$73 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$71)
    6191                            .dwattr DW$T$73, DW_AT_address_class(0x20)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  118

    6192                    DW$T$75 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$72)
    6193                            .dwattr DW$T$75, DW_AT_address_class(0x20)
    6194                    
    6195                    DW$T$79 .dwtag  DW_TAG_structure_type
    6196                            .dwattr DW$T$79, DW_AT_name("dsp_procimg_t")
    6197                            .dwattr DW$T$79, DW_AT_byte_size(0x1c)
    6198                    DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    6199                            .dwattr DW$392, DW_AT_name("img_msg"), DW_AT_symbol_name("_img_msg")
    6200                            .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6201                            .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6202                    DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    6203                            .dwattr DW$393, DW_AT_name("result_msg"), DW_AT_symbol_name("_result_msg")
    6204                            .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6205                            .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6206                    DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6207                            .dwattr DW$394, DW_AT_name("last_flag"), DW_AT_symbol_name("_last_flag")
    6208                            .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6209                            .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6210                    DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6211                            .dwattr DW$395, DW_AT_name("img_grab_count"), DW_AT_symbol_name("_img_grab_count")
    6212                            .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6213                            .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6214                    DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    6215                            .dwattr DW$396, DW_AT_name("begin_quality"), DW_AT_symbol_name("_begin_quality")
    6216                            .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6217                            .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6218                    DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6219                            .dwattr DW$397, DW_AT_name("need_eye"), DW_AT_symbol_name("_need_eye")
    6220                            .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6221                            .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6222                    DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6223                            .dwattr DW$398, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    6224                            .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6225                            .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6226                            .dwendtag DW$T$79
    6227                    
    6228                    
    6229                    DW$T$81 .dwtag  DW_TAG_structure_type
    6230                            .dwattr DW$T$81, DW_AT_byte_size(0x58)
    6231                    DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6232                            .dwattr DW$399, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
    6233                            .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6234                            .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6235                    DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6236                            .dwattr DW$400, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
    6237                            .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6238                            .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6239                    DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6240                            .dwattr DW$401, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
    6241                            .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6242                            .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6243                    DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6244                            .dwattr DW$402, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
    6245                            .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6246                            .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  119

    6247                    DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6248                            .dwattr DW$403, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
    6249                            .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6250                            .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6251                    DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6252                            .dwattr DW$404, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
    6253                            .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6254                            .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6255                    DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6256                            .dwattr DW$405, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
    6257                            .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6258                            .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6259                    DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6260                            .dwattr DW$406, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
    6261                            .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6262                            .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6263                    DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6264                            .dwattr DW$407, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
    6265                            .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6266                            .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6267                    DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6268                            .dwattr DW$408, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
    6269                            .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6270                            .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6271                    DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6272                            .dwattr DW$409, DW_AT_name("sse"), DW_AT_symbol_name("_sse")
    6273                            .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6274                            .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
    6275                    DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6276                            .dwattr DW$410, DW_AT_name("vcvblnkp"), DW_AT_symbol_name("_vcvblnkp")
    6277                            .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6278                            .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6279                    DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6280                            .dwattr DW$411, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
    6281                            .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6282                            .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6283                    DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6284                            .dwattr DW$412, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
    6285                            .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6286                            .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6287                    DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6288                            .dwattr DW$413, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
    6289                            .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6290                            .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6291                    DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6292                            .dwattr DW$414, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
    6293                            .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6294                            .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6295                    DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6296                            .dwattr DW$415, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
    6297                            .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6298                            .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6299                    DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6300                            .dwattr DW$416, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
    6301                            .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  120

    6302                            .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6303                    DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6304                            .dwattr DW$417, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
    6305                            .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6306                            .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6307                    DW$418  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6308                            .dwattr DW$418, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
    6309                            .dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6310                            .dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
    6311                    DW$419  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6312                            .dwattr DW$419, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
    6313                            .dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6314                            .dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
    6315                    DW$420  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6316                            .dwattr DW$420, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
    6317                            .dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6318                            .dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
    6319                    DW$421  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6320                            .dwattr DW$421, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
    6321                            .dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6322                            .dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
    6323                    DW$422  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6324                            .dwattr DW$422, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
    6325                            .dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6326                            .dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
    6327                    DW$423  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6328                            .dwattr DW$423, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
    6329                            .dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6330                            .dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
    6331                    DW$424  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6332                            .dwattr DW$424, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
    6333                            .dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6334                            .dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
    6335                    DW$425  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6336                            .dwattr DW$425, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
    6337                            .dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6338                            .dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
    6339                            .dwendtag DW$T$81
    6340                    
    6341                    DW$T$254        .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Frame"), DW_AT_type(*DW$T$93)
    6342                            .dwattr DW$T$254, DW_AT_language(DW_LANG_C)
    6343                    DW$T$97 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_memory_t"), DW_AT_type(*DW$T$96)
    6344                            .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
    6345                    DW$T$257        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$130)
    6346                            .dwattr DW$T$257, DW_AT_language(DW_LANG_C)
    6347                    
    6348                    DW$T$144        .dwtag  DW_TAG_structure_type
    6349                            .dwattr DW$T$144, DW_AT_name("dsp_reg_t")
    6350                            .dwattr DW$T$144, DW_AT_byte_size(0xb4)
    6351                    DW$426  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$138)
    6352                            .dwattr DW$426, DW_AT_name("status_reg"), DW_AT_symbol_name("_status_reg")
    6353                            .dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6354                            .dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
    6355                    DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$139)
    6356                            .dwattr DW$427, DW_AT_name("distance_reg"), DW_AT_symbol_name("_distance_reg")
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  121

    6357                            .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6358                            .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6359                    DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$140)
    6360                            .dwattr DW$428, DW_AT_name("policy_reg"), DW_AT_symbol_name("_policy_reg")
    6361                            .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6362                            .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6363                    DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$141)
    6364                            .dwattr DW$429, DW_AT_name("sound_reg"), DW_AT_symbol_name("_sound_reg")
    6365                            .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    6366                            .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6367                    DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$142)
    6368                            .dwattr DW$430, DW_AT_name("result_reg"), DW_AT_symbol_name("_result_reg")
    6369                            .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6370                            .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6371                    DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$143)
    6372                            .dwattr DW$431, DW_AT_name("quality_value"), DW_AT_symbol_name("_quality_value")
    6373                            .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6374                            .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6375                    DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6376                            .dwattr DW$432, DW_AT_name("quality_count"), DW_AT_symbol_name("_quality_count")
    6377                            .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6378                            .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6379                    DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6380                            .dwattr DW$433, DW_AT_name("alg_control_count"), DW_AT_symbol_name("_alg_control_count")
    6381                            .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6382                            .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6383                    DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6384                            .dwattr DW$434, DW_AT_name("last_img_quality"), DW_AT_symbol_name("_last_img_quality")
    6385                            .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6386                            .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6387                    DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6388                            .dwattr DW$435, DW_AT_name("last_icon_id"), DW_AT_symbol_name("_last_icon_id")
    6389                            .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    6390                            .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6391                    DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6392                            .dwattr DW$436, DW_AT_name("match_input_count"), DW_AT_symbol_name("_match_input_count")
    6393                            .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    6394                            .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6395                            .dwendtag DW$T$144
    6396                    
    6397                    DW$T$261        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$145)
    6398                            .dwattr DW$T$261, DW_AT_address_class(0x20)
    6399                    
    6400                    DW$T$149        .dwtag  DW_TAG_structure_type
    6401                            .dwattr DW$T$149, DW_AT_name("VPORT_VIntCbParams")
    6402                            .dwattr DW$T$149, DW_AT_byte_size(0x10)
    6403                    DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6404                            .dwattr DW$437, DW_AT_name("cbArg"), DW_AT_symbol_name("_cbArg")
    6405                            .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6406                            .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6407                    DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$148)
    6408                            .dwattr DW$438, DW_AT_name("vIntCbFxn"), DW_AT_symbol_name("_vIntCbFxn")
    6409                            .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6410                            .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6411                    DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  122

    6412                            .dwattr DW$439, DW_AT_name("vIntMask"), DW_AT_symbol_name("_vIntMask")
    6413                            .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6414                            .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6415                    DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6416                            .dwattr DW$440, DW_AT_name("vIntLine"), DW_AT_symbol_name("_vIntLine")
    6417                            .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6418                            .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6419                    DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6420                            .dwattr DW$441, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
    6421                            .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6422                            .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6423                            .dwendtag DW$T$149
    6424                    
    6425                    DW$T$265        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_bmp_t"), DW_AT_type(*DW$T$150)
    6426                            .dwattr DW$T$265, DW_AT_language(DW_LANG_C)
    6427                    
    6428                    DW$T$160        .dwtag  DW_TAG_enumeration_type
    6429                            .dwattr DW$T$160, DW_AT_byte_size(0x04)
    6430                    DW$442  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
    6431                    DW$443  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
    6432                    DW$444  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
    6433                    DW$445  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
    6434                    DW$446  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
    6435                    DW$447  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
    6436                            .dwendtag DW$T$160
    6437                    
    6438                    
    6439                    DW$T$164        .dwtag  DW_TAG_enumeration_type
    6440                            .dwattr DW$T$164, DW_AT_byte_size(0x04)
    6441                    DW$448  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_NOWAIT"), DW_AT_const_value(0x00)
    6442                    DW$449  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_WAIT"), DW_AT_const_value(0x01)
    6443                            .dwendtag DW$T$164
    6444                    
    6445                    DW$T$148        .dwtag  DW_TAG_typedef, DW_AT_name("VPORT_IntCallBack"), DW_AT_type(*DW$T$147)
    6446                            .dwattr DW$T$148, DW_AT_language(DW_LANG_C)
    6447                    DW$T$78 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$77)
    6448                            .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    6449                    
    6450                    DW$T$143        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    6451                            .dwattr DW$T$143, DW_AT_language(DW_LANG_C)
    6452                            .dwattr DW$T$143, DW_AT_byte_size(0x28)
    6453                    DW$450  .dwtag  DW_TAG_subrange_type
    6454                            .dwattr DW$450, DW_AT_upper_bound(0x09)
    6455                            .dwendtag DW$T$143
    6456                    
    6457                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("MEM_sizep"), DW_AT_type(*DW$T$11)
    6458                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    6459                    
    6460                    DW$T$22 .dwtag  DW_TAG_structure_type
    6461                            .dwattr DW$T$22, DW_AT_byte_size(0x0c)
    6462                    DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6463                            .dwattr DW$451, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    6464                            .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6465                            .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    6466                    DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  123

    6467                            .dwattr DW$452, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    6468                            .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6469                            .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    6470                    DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6471                            .dwattr DW$453, DW_AT_name("pinAllocMask"), DW_AT_symbol_name("_pinAllocMask")
    6472                            .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6473                            .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    6474                            .dwendtag DW$T$22
    6475                    
    6476                    
    6477                    DW$T$61 .dwtag  DW_TAG_structure_type
    6478                            .dwattr DW$T$61, DW_AT_name("GIO_Obj")
    6479                            .dwattr DW$T$61, DW_AT_byte_size(0x3c)
    6480                    DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    6481                            .dwattr DW$454, DW_AT_name("fxns"), DW_AT_symbol_name("_fxns")
    6482                            .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6483                            .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    6484                    DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6485                            .dwattr DW$455, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
    6486                            .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6487                            .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    6488                    DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6489                            .dwattr DW$456, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    6490                            .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6491                            .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
    6492                    DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    6493                            .dwattr DW$457, DW_AT_name("syncPacket"), DW_AT_symbol_name("_syncPacket")
    6494                            .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6495                            .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    6496                    DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    6497                            .dwattr DW$458, DW_AT_name("freeList"), DW_AT_symbol_name("_freeList")
    6498                            .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6499                            .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    6500                    DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6501                            .dwattr DW$459, DW_AT_name("syncObj"), DW_AT_symbol_name("_syncObj")
    6502                            .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6503                            .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    6504                    DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6505                            .dwattr DW$460, DW_AT_name("mdChan"), DW_AT_symbol_name("_mdChan")
    6506                            .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6507                            .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    6508                            .dwendtag DW$T$61
    6509                    
    6510                    
    6511                    DW$T$66 .dwtag  DW_TAG_structure_type
    6512                            .dwattr DW$T$66, DW_AT_name("GIO_AppCallback")
    6513                            .dwattr DW$T$66, DW_AT_byte_size(0x08)
    6514                    DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    6515                            .dwattr DW$461, DW_AT_name("fxn"), DW_AT_symbol_name("_fxn")
    6516                            .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6517                            .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    6518                    DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6519                            .dwattr DW$462, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
    6520                            .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6521                            .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  124

    6522                            .dwendtag DW$T$66
    6523                    
    6524                    
    6525                    DW$T$67 .dwtag  DW_TAG_structure_type
    6526                            .dwattr DW$T$67, DW_AT_byte_size(0x14)
    6527                    DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6528                            .dwattr DW$463, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    6529                            .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6530                            .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    6531                    DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6532                            .dwattr DW$464, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    6533                            .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6534                            .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    6535                    DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6536                            .dwattr DW$465, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    6537                            .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6538                            .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    6539                    DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6540                            .dwattr DW$466, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
    6541                            .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6542                            .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    6543                    DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6544                            .dwattr DW$467, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
    6545                            .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6546                            .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    6547                            .dwendtag DW$T$67
    6548                    
    6549                    
    6550                    DW$T$71 .dwtag  DW_TAG_structure_type
    6551                            .dwattr DW$T$71, DW_AT_name("dsp_image_msg_t")
    6552                            .dwattr DW$T$71, DW_AT_byte_size(0x34)
    6553                    DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6554                            .dwattr DW$468, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    6555                            .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6556                            .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    6557                    DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6558                            .dwattr DW$469, DW_AT_name("img_saved_score_l"), DW_AT_symbol_name("_img_saved_score_l")
    6559                            .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6560                            .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    6561                    DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6562                            .dwattr DW$470, DW_AT_name("img_saved_score_r"), DW_AT_symbol_name("_img_saved_score_r")
    6563                            .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6564                            .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    6565                    DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    6566                            .dwattr DW$471, DW_AT_name("img_ptr_l"), DW_AT_symbol_name("_img_ptr_l")
    6567                            .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6568                            .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    6569                    DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    6570                            .dwattr DW$472, DW_AT_name("img_ptr_r"), DW_AT_symbol_name("_img_ptr_r")
    6571                            .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6572                            .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    6573                    DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6574                            .dwattr DW$473, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    6575                            .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6576                            .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  125

    6577                    DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6578                            .dwattr DW$474, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    6579                            .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6580                            .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
    6581                    DW$475  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6582                            .dwattr DW$475, DW_AT_name("img_saved_count_l"), DW_AT_symbol_name("_img_saved_count_l")
    6583                            .dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6584                            .dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
    6585                    DW$476  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6586                            .dwattr DW$476, DW_AT_name("img_saved_count_r"), DW_AT_symbol_name("_img_saved_count_r")
    6587                            .dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6588                            .dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
    6589                    DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6590                            .dwattr DW$477, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    6591                            .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6592                            .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    6593                    DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6594                            .dwattr DW$478, DW_AT_name("data_type_l"), DW_AT_symbol_name("_data_type_l")
    6595                            .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6596                            .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    6597                    DW$479  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6598                            .dwattr DW$479, DW_AT_name("data_type_r"), DW_AT_symbol_name("_data_type_r")
    6599                            .dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6600                            .dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
    6601                            .dwendtag DW$T$71
    6602                    
    6603                    
    6604                    DW$T$72 .dwtag  DW_TAG_structure_type
    6605                            .dwattr DW$T$72, DW_AT_name("dsp_result_msg_t")
    6606                            .dwattr DW$T$72, DW_AT_byte_size(0x1c)
    6607                    DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6608                            .dwattr DW$480, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    6609                            .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6610                            .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    6611                    DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6612                            .dwattr DW$481, DW_AT_name("result_left"), DW_AT_symbol_name("_result_left")
    6613                            .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6614                            .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    6615                    DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6616                            .dwattr DW$482, DW_AT_name("result_right"), DW_AT_symbol_name("_result_right")
    6617                            .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6618                            .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    6619                    DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6620                            .dwattr DW$483, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    6621                            .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6622                            .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    6623                    DW$484  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6624                            .dwattr DW$484, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    6625                            .dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6626                            .dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
    6627                    DW$485  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6628                            .dwattr DW$485, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    6629                            .dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6630                            .dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
    6631                            .dwendtag DW$T$72
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  126

    6632                    
    6633                    
    6634                    DW$T$93 .dwtag  DW_TAG_structure_type
    6635                            .dwattr DW$T$93, DW_AT_name("FVID_Frame")
    6636                            .dwattr DW$T$93, DW_AT_byte_size(0x20)
    6637                    DW$486  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6638                            .dwattr DW$486, DW_AT_name("queElement"), DW_AT_symbol_name("_queElement")
    6639                            .dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6640                            .dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
    6641                    DW$487  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    6642                            .dwattr DW$487, DW_AT_name("frame"), DW_AT_symbol_name("_frame")
    6643                            .dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6644                            .dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
    6645                            .dwendtag DW$T$93
    6646                    
    6647                    
    6648                    DW$T$96 .dwtag  DW_TAG_structure_type
    6649                            .dwattr DW$T$96, DW_AT_name("dsp_tsk_memory_t")
    6650                            .dwattr DW$T$96, DW_AT_byte_size(0x08)
    6651                    DW$488  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6652                            .dwattr DW$488, DW_AT_name("dataptr_len"), DW_AT_symbol_name("_dataptr_len")
    6653                            .dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6654                            .dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
    6655                    DW$489  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    6656                            .dwattr DW$489, DW_AT_name("data_ptr"), DW_AT_symbol_name("_data_ptr")
    6657                            .dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6658                            .dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
    6659                            .dwendtag DW$T$96
    6660                    
    6661                    
    6662                    DW$T$130        .dwtag  DW_TAG_structure_type
    6663                            .dwattr DW$T$130, DW_AT_name("dsp_tsk_totalreg_t")
    6664                            .dwattr DW$T$130, DW_AT_byte_size(0x138)
    6665                    DW$490  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
    6666                            .dwattr DW$490, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
    6667                            .dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6668                            .dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
    6669                    DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    6670                            .dwattr DW$491, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
    6671                            .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6672                            .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    6673                    DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$118)
    6674                            .dwattr DW$492, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
    6675                            .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6676                            .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    6677                    DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    6678                            .dwattr DW$493, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
    6679                            .dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6680                            .dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
    6681                    DW$494  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$120)
    6682                            .dwattr DW$494, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
    6683                            .dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6684                            .dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
    6685                    DW$495  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$121)
    6686                            .dwattr DW$495, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  127

    6687                            .dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6688                            .dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
    6689                    DW$496  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$122)
    6690                            .dwattr DW$496, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
    6691                            .dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    6692                            .dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
    6693                    DW$497  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    6694                            .dwattr DW$497, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
    6695                            .dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    6696                            .dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
    6697                    DW$498  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$124)
    6698                            .dwattr DW$498, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
    6699                            .dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6700                            .dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
    6701                    DW$499  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$125)
    6702                            .dwattr DW$499, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
    6703                            .dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6704                            .dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
    6705                    DW$500  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    6706                            .dwattr DW$500, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
    6707                            .dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6708                            .dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
    6709                    DW$501  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$127)
    6710                            .dwattr DW$501, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg
    6711                            .dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6712                            .dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
    6713                    DW$502  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    6714                            .dwattr DW$502, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
    6715                            .dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    6716                            .dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
    6717                    DW$503  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$129)
    6718                            .dwattr DW$503, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
    6719                            .dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    6720                            .dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6721                            .dwendtag DW$T$130
    6722                    
    6723                    DW$T$138        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_status_t"), DW_AT_type(*DW$T$131)
    6724                            .dwattr DW$T$138, DW_AT_language(DW_LANG_C)
    6725                    DW$T$139        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_t"), DW_AT_type(*DW$T$132)
    6726                            .dwattr DW$T$139, DW_AT_language(DW_LANG_C)
    6727                    DW$T$140        .dwtag  DW_TAG_typedef, DW_AT_name("policy_t"), DW_AT_type(*DW$T$134)
    6728                            .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    6729                    DW$T$141        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_sound_t"), DW_AT_type(*DW$T$135)
    6730                            .dwattr DW$T$141, DW_AT_language(DW_LANG_C)
    6731                    DW$T$142        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_t"), DW_AT_type(*DW$T$137)
    6732                            .dwattr DW$T$142, DW_AT_language(DW_LANG_C)
    6733                    
    6734                    DW$T$145        .dwtag  DW_TAG_structure_type
    6735                            .dwattr DW$T$145, DW_AT_name("dsp_match_msg_t")
    6736                            .dwattr DW$T$145, DW_AT_byte_size(0x0c)
    6737                    DW$504  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6738                            .dwattr DW$504, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    6739                            .dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6740                            .dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6741                    DW$505  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  128

    6742                            .dwattr DW$505, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    6743                            .dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6744                            .dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6745                            .dwendtag DW$T$145
    6746                    
    6747                    
    6748                    DW$T$150        .dwtag  DW_TAG_structure_type
    6749                            .dwattr DW$T$150, DW_AT_name("dsp_bmp_t")
    6750                            .dwattr DW$T$150, DW_AT_byte_size(0x08)
    6751                    DW$506  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6752                            .dwattr DW$506, DW_AT_name("width"), DW_AT_symbol_name("_width")
    6753                            .dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6754                            .dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6755                    DW$507  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6756                            .dwattr DW$507, DW_AT_name("height"), DW_AT_symbol_name("_height")
    6757                            .dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6758                            .dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6759                            .dwendtag DW$T$150
    6760                    
    6761                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_TappCallback"), DW_AT_type(*DW$T$64)
    6762                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    6763                    DW$T$147        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$146)
    6764                            .dwattr DW$T$147, DW_AT_address_class(0x20)
    6765                    DW$T$77 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    6766                            .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    6767                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    6768                            .dwattr DW$T$21, DW_AT_address_class(0x20)
    6769                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$24)
    6770                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    6771                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$24)
    6772                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    6773                    DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$44)
    6774                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    6775                    DW$T$59 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$58)
    6776                            .dwattr DW$T$59, DW_AT_address_class(0x20)
    6777                    
    6778                    DW$T$92 .dwtag  DW_TAG_union_type
    6779                            .dwattr DW$T$92, DW_AT_byte_size(0x18)
    6780                    DW$508  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    6781                            .dwattr DW$508, DW_AT_name("iFrm"), DW_AT_symbol_name("_iFrm")
    6782                            .dwattr DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6783                            .dwattr DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6784                    DW$509  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    6785                            .dwattr DW$509, DW_AT_name("pFrm"), DW_AT_symbol_name("_pFrm")
    6786                            .dwattr DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6787                            .dwattr DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6788                    DW$510  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    6789                            .dwattr DW$510, DW_AT_name("riFrm"), DW_AT_symbol_name("_riFrm")
    6790                            .dwattr DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6791                            .dwattr DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6792                    DW$511  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
    6793                            .dwattr DW$511, DW_AT_name("rpFrm"), DW_AT_symbol_name("_rpFrm")
    6794                            .dwattr DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6795                            .dwattr DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6796                            .dwendtag DW$T$92
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  129

    6797                    
    6798                    DW$T$117        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$94)
    6799                            .dwattr DW$T$117, DW_AT_language(DW_LANG_C)
    6800                    DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$95)
    6801                            .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    6802                    DW$T$118        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$98)
    6803                            .dwattr DW$T$118, DW_AT_language(DW_LANG_C)
    6804                    DW$T$119        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$100)
    6805                            .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    6806                    DW$T$120        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$101)
    6807                            .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
    6808                    DW$T$121        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$103)
    6809                            .dwattr DW$T$121, DW_AT_language(DW_LANG_C)
    6810                    DW$T$122        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$104)
    6811                            .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
    6812                    DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$105)
    6813                            .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    6814                    DW$T$124        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$107)
    6815                            .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    6816                    DW$T$125        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$109)
    6817                            .dwattr DW$T$125, DW_AT_language(DW_LANG_C)
    6818                    DW$T$126        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$112)
    6819                            .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
    6820                    DW$T$127        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$113)
    6821                            .dwattr DW$T$127, DW_AT_language(DW_LANG_C)
    6822                    DW$T$128        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$115)
    6823                            .dwattr DW$T$128, DW_AT_language(DW_LANG_C)
    6824                    DW$T$129        .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$116)
    6825                            .dwattr DW$T$129, DW_AT_language(DW_LANG_C)
    6826                    
    6827                    DW$T$131        .dwtag  DW_TAG_structure_type
    6828                            .dwattr DW$T$131, DW_AT_name("dsp_status_t")
    6829                            .dwattr DW$T$131, DW_AT_byte_size(0x18)
    6830                    DW$512  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6831                            .dwattr DW$512, DW_AT_name("tsk_img_status"), DW_AT_symbol_name("_tsk_img_status")
    6832                            .dwattr DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6833                            .dwattr DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6834                    DW$513  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6835                            .dwattr DW$513, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    6836                            .dwattr DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6837                            .dwattr DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6838                    DW$514  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6839                            .dwattr DW$514, DW_AT_name("tsk_alg_saved_status"), DW_AT_symbol_name("_tsk_alg_saved_status")
    6840                            .dwattr DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6841                            .dwattr DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6842                    DW$515  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6843                            .dwattr DW$515, DW_AT_name("tsk_alg_inuse"), DW_AT_symbol_name("_tsk_alg_inuse")
    6844                            .dwattr DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6845                            .dwattr DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6846                    DW$516  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6847                            .dwattr DW$516, DW_AT_name("proc_start_time"), DW_AT_symbol_name("_proc_start_time")
    6848                            .dwattr DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6849                            .dwattr DW$516, DW_AT_accessibility(DW_ACCESS_public)
    6850                    DW$517  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6851                            .dwattr DW$517, DW_AT_name("proc_timeout"), DW_AT_symbol_name("_proc_timeout")
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  130

    6852                            .dwattr DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6853                            .dwattr DW$517, DW_AT_accessibility(DW_ACCESS_public)
    6854                    DW$518  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6855                            .dwattr DW$518, DW_AT_name("tsk_testimg_tag_left"), DW_AT_symbol_name("_tsk_testimg_tag_left")
    6856                            .dwattr DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6857                            .dwattr DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6858                    DW$519  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6859                            .dwattr DW$519, DW_AT_name("tsk_testimg_tag_right"), DW_AT_symbol_name("_tsk_testimg_tag_right
    6860                            .dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6861                            .dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6862                            .dwendtag DW$T$131
    6863                    
    6864                    
    6865                    DW$T$132        .dwtag  DW_TAG_structure_type
    6866                            .dwattr DW$T$132, DW_AT_name("dsp_distance_t")
    6867                            .dwattr DW$T$132, DW_AT_byte_size(0x24)
    6868                    DW$520  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6869                            .dwattr DW$520, DW_AT_name("same_count"), DW_AT_symbol_name("_same_count")
    6870                            .dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6871                            .dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6872                    DW$521  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6873                            .dwattr DW$521, DW_AT_name("last_distance"), DW_AT_symbol_name("_last_distance")
    6874                            .dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6875                            .dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6876                    DW$522  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6877                            .dwattr DW$522, DW_AT_name("if_has_people"), DW_AT_symbol_name("_if_has_people")
    6878                            .dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6879                            .dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6880                    DW$523  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6881                            .dwattr DW$523, DW_AT_name("last_if_has"), DW_AT_symbol_name("_last_if_has")
    6882                            .dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6883                            .dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6884                    DW$524  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6885                            .dwattr DW$524, DW_AT_name("no_count"), DW_AT_symbol_name("_no_count")
    6886                            .dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6887                            .dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6888                    DW$525  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6889                            .dwattr DW$525, DW_AT_name("has_count"), DW_AT_symbol_name("_has_count")
    6890                            .dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6891                            .dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6892                    DW$526  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6893                            .dwattr DW$526, DW_AT_name("disp_count"), DW_AT_symbol_name("_disp_count")
    6894                            .dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6895                            .dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6896                    DW$527  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6897                            .dwattr DW$527, DW_AT_name("if_disp_image"), DW_AT_symbol_name("_if_disp_image")
    6898                            .dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6899                            .dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6900                    DW$528  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6901                            .dwattr DW$528, DW_AT_name("wait_frame"), DW_AT_symbol_name("_wait_frame")
    6902                            .dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6903                            .dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6904                            .dwendtag DW$T$132
    6905                    
    6906                    
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  131

    6907                    DW$T$134        .dwtag  DW_TAG_structure_type
    6908                            .dwattr DW$T$134, DW_AT_name("policy_t")
    6909                            .dwattr DW$T$134, DW_AT_byte_size(0x28)
    6910                    DW$529  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6911                            .dwattr DW$529, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    6912                            .dwattr DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6913                            .dwattr DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6914                    DW$530  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6915                            .dwattr DW$530, DW_AT_name("iden_count"), DW_AT_symbol_name("_iden_count")
    6916                            .dwattr DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6917                            .dwattr DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6918                    DW$531  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6919                            .dwattr DW$531, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    6920                            .dwattr DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6921                            .dwattr DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6922                    DW$532  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6923                            .dwattr DW$532, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    6924                            .dwattr DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6925                            .dwattr DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6926                    DW$533  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
    6927                            .dwattr DW$533, DW_AT_name("enroll_score_l"), DW_AT_symbol_name("_enroll_score_l")
    6928                            .dwattr DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6929                            .dwattr DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6930                    DW$534  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
    6931                            .dwattr DW$534, DW_AT_name("enroll_score_r"), DW_AT_symbol_name("_enroll_score_r")
    6932                            .dwattr DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6933                            .dwattr DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6934                            .dwendtag DW$T$134
    6935                    
    6936                    
    6937                    DW$T$135        .dwtag  DW_TAG_structure_type
    6938                            .dwattr DW$T$135, DW_AT_name("dsp_sound_t")
    6939                            .dwattr DW$T$135, DW_AT_byte_size(0x08)
    6940                    DW$535  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6941                            .dwattr DW$535, DW_AT_name("last_sound_time"), DW_AT_symbol_name("_last_sound_time")
    6942                            .dwattr DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6943                            .dwattr DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6944                    DW$536  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6945                            .dwattr DW$536, DW_AT_name("last_sound_value"), DW_AT_symbol_name("_last_sound_value")
    6946                            .dwattr DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6947                            .dwattr DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6948                            .dwendtag DW$T$135
    6949                    
    6950                    
    6951                    DW$T$137        .dwtag  DW_TAG_structure_type
    6952                            .dwattr DW$T$137, DW_AT_name("dsp_result_t")
    6953                            .dwattr DW$T$137, DW_AT_byte_size(0x0c)
    6954                    DW$537  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$136)
    6955                            .dwattr DW$537, DW_AT_name("count"), DW_AT_symbol_name("_count")
    6956                            .dwattr DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6957                            .dwattr DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6958                    DW$538  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$136)
    6959                            .dwattr DW$538, DW_AT_name("result"), DW_AT_symbol_name("_result")
    6960                            .dwattr DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6961                            .dwattr DW$538, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  132

    6962                    DW$539  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$136)
    6963                            .dwattr DW$539, DW_AT_name("grab_iden_result"), DW_AT_symbol_name("_grab_iden_result")
    6964                            .dwattr DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6965                            .dwattr DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6966                            .dwendtag DW$T$137
    6967                    
    6968                    DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    6969                            .dwattr DW$T$64, DW_AT_address_class(0x20)
    6970                    
    6971                    DW$T$146        .dwtag  DW_TAG_subroutine_type
    6972                            .dwattr DW$T$146, DW_AT_language(DW_LANG_C)
    6973                    DW$540  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    6974                    DW$541  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    6975                            .dwendtag DW$T$146
    6976                    
    6977                    
    6978                    DW$T$136        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
    6979                            .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    6980                            .dwattr DW$T$136, DW_AT_byte_size(0x04)
    6981                    DW$542  .dwtag  DW_TAG_subrange_type
    6982                            .dwattr DW$542, DW_AT_upper_bound(0x01)
    6983                            .dwendtag DW$T$136
    6984                    
    6985                    DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$28)
    6986                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    6987                    
    6988                    DW$T$133        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    6989                            .dwattr DW$T$133, DW_AT_language(DW_LANG_C)
    6990                            .dwattr DW$T$133, DW_AT_byte_size(0x10)
    6991                    DW$543  .dwtag  DW_TAG_subrange_type
    6992                            .dwattr DW$543, DW_AT_upper_bound(0x03)
    6993                            .dwendtag DW$T$133
    6994                    
    6995                    DW$T$20 .dwtag  DW_TAG_volatile_type
    6996                            .dwattr DW$T$20, DW_AT_type(*DW$T$19)
    6997                    
    6998                    DW$T$24 .dwtag  DW_TAG_structure_type
    6999                            .dwattr DW$T$24, DW_AT_name("QUE_Elem")
    7000                            .dwattr DW$T$24, DW_AT_byte_size(0x08)
    7001                    DW$544  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    7002                            .dwattr DW$544, DW_AT_name("next"), DW_AT_symbol_name("_next")
    7003                            .dwattr DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7004                            .dwattr DW$544, DW_AT_accessibility(DW_ACCESS_public)
    7005                    DW$545  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    7006                            .dwattr DW$545, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
    7007                            .dwattr DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7008                            .dwattr DW$545, DW_AT_accessibility(DW_ACCESS_public)
    7009                            .dwendtag DW$T$24
    7010                    
    7011                    DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    7012                            .dwattr DW$T$23, DW_AT_address_class(0x20)
    7013                    DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$30)
    7014                            .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
    7015                    DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$57)
    7016                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  133

    7017                    DW$T$88 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_IFrame"), DW_AT_type(*DW$T$84)
    7018                            .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
    7019                    DW$T$89 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_PFrame"), DW_AT_type(*DW$T$85)
    7020                            .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    7021                    DW$T$90 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawIFrame"), DW_AT_type(*DW$T$86)
    7022                            .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
    7023                    DW$T$91 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawPFrame"), DW_AT_type(*DW$T$87)
    7024                            .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    7025                    
    7026                    DW$T$94 .dwtag  DW_TAG_structure_type
    7027                            .dwattr DW$T$94, DW_AT_name("dsp_tsk_control_t")
    7028                            .dwattr DW$T$94, DW_AT_byte_size(0x0c)
    7029                    DW$546  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7030                            .dwattr DW$546, DW_AT_name("tsk_img_control"), DW_AT_symbol_name("_tsk_img_control")
    7031                            .dwattr DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7032                            .dwattr DW$546, DW_AT_accessibility(DW_ACCESS_public)
    7033                    DW$547  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7034                            .dwattr DW$547, DW_AT_name("tsk_img_control_count"), DW_AT_symbol_name("_tsk_img_control_count
    7035                            .dwattr DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7036                            .dwattr DW$547, DW_AT_accessibility(DW_ACCESS_public)
    7037                    DW$548  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7038                            .dwattr DW$548, DW_AT_name("tsk_alg_control"), DW_AT_symbol_name("_tsk_alg_control")
    7039                            .dwattr DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7040                            .dwattr DW$548, DW_AT_accessibility(DW_ACCESS_public)
    7041                    DW$549  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7042                            .dwattr DW$549, DW_AT_name("tsk_alg_control_count"), DW_AT_symbol_name("_tsk_alg_control_count
    7043                            .dwattr DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7044                            .dwattr DW$549, DW_AT_accessibility(DW_ACCESS_public)
    7045                    DW$550  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7046                            .dwattr DW$550, DW_AT_name("tsk_adc_value"), DW_AT_symbol_name("_tsk_adc_value")
    7047                            .dwattr DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7048                            .dwattr DW$550, DW_AT_accessibility(DW_ACCESS_public)
    7049                            .dwendtag DW$T$94
    7050                    
    7051                    
    7052                    DW$T$95 .dwtag  DW_TAG_structure_type
    7053                            .dwattr DW$T$95, DW_AT_name("dsp_tsk_policy_t")
    7054                            .dwattr DW$T$95, DW_AT_byte_size(0x0c)
    7055                    DW$551  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7056                            .dwattr DW$551, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    7057                            .dwattr DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7058                            .dwattr DW$551, DW_AT_accessibility(DW_ACCESS_public)
    7059                    DW$552  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7060                            .dwattr DW$552, DW_AT_name("try_count"), DW_AT_symbol_name("_try_count")
    7061                            .dwattr DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    7062                            .dwattr DW$552, DW_AT_accessibility(DW_ACCESS_public)
    7063                    DW$553  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7064                            .dwattr DW$553, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    7065                            .dwattr DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7066                            .dwattr DW$553, DW_AT_accessibility(DW_ACCESS_public)
    7067                    DW$554  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7068                            .dwattr DW$554, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    7069                            .dwattr DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7070                            .dwattr DW$554, DW_AT_accessibility(DW_ACCESS_public)
    7071                    DW$555  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  134

    7072                            .dwattr DW$555, DW_AT_name("policy_flag"), DW_AT_symbol_name("_policy_flag")
    7073                            .dwattr DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7074                            .dwattr DW$555, DW_AT_accessibility(DW_ACCESS_public)
    7075                            .dwendtag DW$T$95
    7076                    
    7077                    
    7078                    DW$T$98 .dwtag  DW_TAG_structure_type
    7079                            .dwattr DW$T$98, DW_AT_name("dsp_tsk_flag_t")
    7080                            .dwattr DW$T$98, DW_AT_byte_size(0x1c)
    7081                    DW$556  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7082                            .dwattr DW$556, DW_AT_name("tsk_img_resp"), DW_AT_symbol_name("_tsk_img_resp")
    7083                            .dwattr DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7084                            .dwattr DW$556, DW_AT_accessibility(DW_ACCESS_public)
    7085                    DW$557  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7086                            .dwattr DW$557, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    7087                            .dwattr DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7088                            .dwattr DW$557, DW_AT_accessibility(DW_ACCESS_public)
    7089                    DW$558  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7090                            .dwattr DW$558, DW_AT_name("tsk_alg_status_count"), DW_AT_symbol_name("_tsk_alg_status_count")
    7091                            .dwattr DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    7092                            .dwattr DW$558, DW_AT_accessibility(DW_ACCESS_public)
    7093                    DW$559  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7094                            .dwattr DW$559, DW_AT_name("req_tsk_alg_control"), DW_AT_symbol_name("_req_tsk_alg_control")
    7095                            .dwattr DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    7096                            .dwattr DW$559, DW_AT_accessibility(DW_ACCESS_public)
    7097                    DW$560  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    7098                            .dwattr DW$560, DW_AT_name("req_tsk_alg_control_count"), DW_AT_symbol_name("_req_tsk_alg_contr
    7099                            .dwattr DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    7100                            .dwattr DW$560, DW_AT_accessibility(DW_ACCESS_public)
    7101                    DW$561  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    7102                            .dwattr DW$561, DW_AT_name("left_data"), DW_AT_symbol_name("_left_data")
    7103                            .dwattr DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    7104                            .dwattr DW$561, DW_AT_accessibility(DW_ACCESS_public)
    7105                    DW$562  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    7106                            .dwattr DW$562, DW_AT_name("right_data"), DW_AT_symbol_name("_right_data")
    7107                            .dwattr DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7108                            .dwattr DW$562, DW_AT_accessibility(DW_ACCESS_public)
    7109                            .dwendtag DW$T$98
    7110                    
    7111                    
    7112                    DW$T$100        .dwtag  DW_TAG_structure_type
    7113                            .dwattr DW$T$100, DW_AT_name("dsp_algorithm_result_t")
    7114                            .dwattr DW$T$100, DW_AT_byte_size(0x20)
    7115                    DW$563  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7116                            .dwattr DW$563, DW_AT_name("result_type"), DW_AT_symbol_name("_result_type")
    7117                            .dwattr DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7118                            .dwattr DW$563, DW_AT_accessibility(DW_ACCESS_public)
    7119                    DW$564  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    7120                            .dwattr DW$564, DW_AT_name("policy"), DW_AT_symbol_name("_policy")
    7121                            .dwattr DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    7122                            .dwattr DW$564, DW_AT_accessibility(DW_ACCESS_public)
    7123                    DW$565  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7124                            .dwattr DW$565, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    7125                            .dwattr DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    7126                            .dwattr DW$565, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Tue Apr 05 17:07:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\Users\ADMINI~1\AppData\Local\Temp\TI5962                          PAGE  135

    7127                    DW$566  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    7128                            .dwattr DW$566, DW_AT_name("left_result"), DW_AT_symbol_name("_left_result")
    7129                            .dwattr DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    7130                            .dwattr DW$566, DW_AT_accessibility(DW_ACCESS_public)
    7131                    DW$567  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    7132                            .dwattr DW$567, DW_AT_name("right_result"), DW_AT_symbol_name("_right_result")
    7133                            .dwattr DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    7134                            .dwattr DW$567, DW_AT_accessibility(DW_ACCESS_public)
    7135                    DW$568  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    7136                            .dwattr DW$568, DW_AT_name("result_data"), DW_AT_symbol_name("_result_data")
    7137                            .dwattr DW$568, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    7138                            .dwattr DW$568, DW_AT_accessibility(DW_ACCESS_public)
    7139                            .dwendtag DW$T$100
    7140                    
    7141                    
    7142                    DW$T$101        .dwtag  DW_TAG_structure_type
    7143                            .dwattr DW$T$101, DW_AT_name("dsp_algorithm_sound_t")
    7144                            .dwattr DW$T$101, DW_AT_byte_size(0x08)
    7145                    DW$569  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7146                            .dwattr DW$569, DW_AT_name("sound_value"), DW_AT_symbol_name("_sound_value")
    7147                            .dwattr DW$569, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    7148                            .dwattr DW$569, DW_AT_accessibility(DW_ACCESS_public)
    7149                    DW$570  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    7150                            .dwattr DW$570, DW_AT_name("sound_count"), DW_AT_symbol_name("_sound_count")
    7151                            .dwattr DW$570, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
