;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Mon Jul 30 12:22:35 2007                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

           ADDK    .S2     168,SP            ; |78| 
	.dwpsn	"verify.c",78,1
           NOP             4
           ; BRANCH OCCURS {B3}              ; |78| 

DW$37	.dwtag  DW_TAG_loop
	.dwattr DW$37, DW_AT_name("D:\pred\dsp\i2c\verify.asm:L8:1:1185769355")
	.dwattr DW$37, DW_AT_begin_file("C:/CCStudio_v3.1/C6000/cgtools/include/string.h")
	.dwattr DW$37, DW_AT_begin_line(0x6d)
	.dwattr DW$37, DW_AT_end_line(0x6d)
DW$38	.dwtag  DW_TAG_loop_range
	.dwattr DW$38, DW_AT_low_pc(DW$L$_generate_key$3$B)
	.dwattr DW$38, DW_AT_high_pc(DW$L$_generate_key$3$E)
	.dwendtag DW$37

	.dwattr DW$34, DW_AT_end_file("verify.c")
	.dwattr DW$34, DW_AT_end_line(0x4e)
	.dwattr DW$34, DW_AT_end_column(0x01)
	.dwendtag DW$34

;; Inlined function references:
;; [  1] strlen
;; [  2] memcmp
;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".const"
SL1:	.string	"decrypt failed",10,0
SL2:	.string	"data integrity ok",10,0
SL3:	.string	"data integrity error",10,0
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_rsa_decrypt_public
	.global	_SHA_Init
	.global	_SHA_Bytes
	.global	_SHA_Final
	.global	_dbg_output
	.global	_build_public_key

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************
DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x20)

DW$T$30	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
DW$39	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$40	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$41	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$30

DW$T$28	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
	.dwattr DW$T$28, DW_AT_address_class(0x20)

DW$T$33	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
DW$42	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$33


DW$T$36	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)
DW$43	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
	.dwendtag DW$T$36


DW$T$38	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$38, DW_AT_language(DW_LANG_C)
DW$44	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
DW$45	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$46	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$38


DW$T$41	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$41, DW_AT_language(DW_LANG_C)
DW$47	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
DW$48	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
	.dwendtag DW$T$41

DW$T$40	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$40, DW_AT_address_class(0x20)

DW$T$47	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$47, DW_AT_byte_size(0x8d)
DW$49	.dwtag  DW_TAG_subrange_type
	.dwattr DW$49, DW_AT_upper_bound(0x8c)
	.dwendtag DW$T$47


DW$T$50	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$48)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$50, DW_AT_byte_size(0x1c)
DW$50	.dwtag  DW_TAG_subrange_type
	.dwattr DW$50, DW_AT_upper_bound(0x1b)
	.dwendtag DW$T$50

DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)

DW$T$55	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$51	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$52	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$53	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$55


DW$T$56	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)
DW$54	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
DW$55	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$56	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
DW$57	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$58	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$56


DW$T$58	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)
DW$59	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$21)
DW$60	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$T$58


DW$T$60	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$60, DW_AT_language(DW_LANG_C)
DW$61	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
	.dwendtag DW$T$60


DW$T$61	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$61, DW_AT_language(DW_LANG_C)

DW$T$63	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$62	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
DW$63	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
	.dwendtag DW$T$63

DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)

DW$T$67	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$29)
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)
DW$64	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$66)
	.dwendtag DW$T$67

DW$T$21	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$21, DW_AT_address_class(0x20)
DW$T$66	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$65)
	.dwattr DW$T$66, DW_AT_address_class(0x20)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("RSAKey")
	.dwattr DW$T$22, DW_AT_byte_size(0x24)
DW$65	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$65, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
DW$66	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$66, DW_AT_name("bytes"), DW_AT_symbol_name("_bytes")
	.dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
DW$67	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$67, DW_AT_name("modulus"), DW_AT_symbol_name("_modulus")
	.dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
DW$68	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$68, DW_AT_name("exponent"), DW_AT_symbol_name("_exponent")
	.dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
DW$69	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$69, DW_AT_name("private_exponent"), DW_AT_symbol_name("_private_exponent")
	.dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
DW$70	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$70, DW_AT_name("p"), DW_AT_symbol_name("_p")
	.dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
DW$71	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$71, DW_AT_name("q"), DW_AT_symbol_name("_q")
	.dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
DW$72	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$72, DW_AT_name("iqmp"), DW_AT_symbol_name("_iqmp")
	.dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
DW$73	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$73, DW_AT_name("comment"), DW_AT_symbol_name("_comment")
	.dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22

DW$T$32	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$32, DW_AT_address_class(0x20)
DW$T$35	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$35, DW_AT_address_class(0x20)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Bignum"), DW_AT_type(*DW$T$3)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
DW$T$27	.dwtag  DW_TAG_const_type
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)
DW$T$48	.dwtag  DW_TAG_const_type
	.dwattr DW$T$48, DW_AT_type(*DW$T$6)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$20	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$20, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$20, DW_AT_byte_size(0x01)
DW$T$65	.dwtag  DW_TAG_const_type
	.dwattr DW$T$65, DW_AT_type(*DW$T$20)
DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("SHA_State"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)

DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$26, DW_AT_byte_size(0x60)
DW$74	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$74, DW_AT_name("h"), DW_AT_symbol_name("_h")
	.dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
DW$75	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$75, DW_AT_name("block"), DW_AT_symbol_name("_block")
	.dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
DW$76	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$76, DW_AT_name("blkused"), DW_AT_symbol_name("_blkused")
	.dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
DW$77	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$77, DW_AT_name("lenhi"), DW_AT_symbol_name("_lenhi")
	.dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
DW$78	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$78, DW_AT_name("lenlo"), DW_AT_symbol_name("_lenlo")
	.dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$26


DW$T$25	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$25, DW_AT_byte_size(0x40)
DW$79	.dwtag  DW_TAG_subrange_type
	.dwattr DW$79, DW_AT_upper_bound(0x3f)
	.dwendtag DW$T$25

DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)

DW$T$24	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$24, DW_AT_byte_size(0x14)
DW$80	.dwtag  DW_TAG_subrange_type
	.dwattr DW$80, DW_AT_upper_bound(0x04)
	.dwendtag DW$T$24


	.dwattr DW$34, DW_AT_external(0x01)
	.dwattr DW$34, DW_AT_type(*DW$T$10)
	.dwattr DW$30, DW_AT_external(0x01)
	.dwattr DW$30, DW_AT_type(*DW$T$10)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$81	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$81, DW_AT_location[DW_OP_reg0]
DW$82	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$82, DW_AT_location[DW_OP_reg1]
DW$83	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$83, DW_AT_location[DW_OP_reg2]
DW$84	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$84, DW_AT_location[DW_OP_reg3]
DW$85	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$85, DW_AT_location[DW_OP_reg4]
DW$86	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$86, DW_AT_location[DW_OP_reg5]
DW$87	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$87, DW_AT_location[DW_OP_reg6]
DW$88	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$88, DW_AT_location[DW_OP_reg7]
DW$89	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$89, DW_AT_location[DW_OP_reg8]
DW$90	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$90, DW_AT_location[DW_OP_reg9]
DW$91	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$91, DW_AT_location[DW_OP_reg10]
DW$92	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$92, DW_AT_location[DW_OP_reg11]
DW$93	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$93, DW_AT_location[DW_OP_reg12]
DW$94	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$94, DW_AT_location[DW_OP_reg13]
DW$95	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$95, DW_AT_location[DW_OP_reg14]
DW$96	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$96, DW_AT_location[DW_OP_reg15]
DW$97	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$97, DW_AT_location[DW_OP_reg16]
DW$98	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$98, DW_AT_location[DW_OP_reg17]
DW$99	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$99, DW_AT_location[DW_OP_reg18]
DW$100	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$100, DW_AT_location[DW_OP_reg19]
DW$101	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$101, DW_AT_location[DW_OP_reg20]
DW$102	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$102, DW_AT_location[DW_OP_reg21]
DW$103	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$103, DW_AT_location[DW_OP_reg22]
DW$104	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$104, DW_AT_location[DW_OP_reg23]
DW$105	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$105, DW_AT_location[DW_OP_reg24]
DW$106	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$106, DW_AT_location[DW_OP_reg25]
DW$107	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$107, DW_AT_location[DW_OP_reg26]
DW$108	.dwtag  DW_TAG_assign_register, DW_AT_name("B11")
	.dwattr DW$108, DW_AT_location[DW_OP_reg27]
DW$109	.dwtag  DW_TAG_assign_register, DW_AT_name("B12")
	.dwattr DW$109, DW_AT_location[DW_OP_reg28]
