TMS320C6x COFF Assembler PC v5.1.0 Thu Oct 28 15:46:20 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2842                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Oct 28 15:46:20 2010                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    1366                    DW$113  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
    1367                            .dwendtag DW$T$27
    1368                    
    1369                    
    1370                    DW$T$29 .dwtag  DW_TAG_subroutine_type
    1371                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1372                    DW$114  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1373                            .dwendtag DW$T$29
    1374                    
    1375                    
TMS320C6x COFF Assembler PC v5.1.0 Thu Oct 28 15:46:20 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2842                            PAGE   26

    1376                    DW$T$33 .dwtag  DW_TAG_subroutine_type
    1377                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1378                    DW$115  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1379                    DW$116  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    1380                            .dwendtag DW$T$33
    1381                    
    1382                    
    1383                    DW$T$37 .dwtag  DW_TAG_subroutine_type
    1384                            .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    1385                    DW$117  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1386                    DW$118  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
    1387                    DW$119  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    1388                    DW$120  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
    1389                    DW$121  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
    1390                            .dwendtag DW$T$37
    1391                    
    1392                    DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
    1393                            .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    1394                    DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    1395                            .dwattr DW$T$35, DW_AT_address_class(0x20)
    1396                    
    1397                    DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
    1398                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    1399                    DW$122  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1400                            .dwendtag DW$T$39
    1401                    
    1402                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
    1403                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    1404                    DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
    1405                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1406                    DW$T$42 .dwtag  DW_TAG_volatile_type
    1407                            .dwattr DW$T$42, DW_AT_type(*DW$T$41)
    1408                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    1409                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    1410                    
    1411                    DW$T$43 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    1412                            .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    1413                    DW$123  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    1414                            .dwendtag DW$T$43
    1415                    
    1416                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$24)
    1417                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    1418                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Config"), DW_AT_type(*DW$T$23)
    1419                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1420                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
    1421                            .dwattr DW$T$32, DW_AT_address_class(0x20)
    1422                    DW$T$46 .dwtag  DW_TAG_const_type
    1423                            .dwattr DW$T$46, DW_AT_type(*DW$T$31)
    1424                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1425                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1426                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1427                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    1428                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1429                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    1430                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
TMS320C6x COFF Assembler PC v5.1.0 Thu Oct 28 15:46:20 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2842                            PAGE   27

    1431                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1432                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
    1433                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1434                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1435                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    1436                    DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
    1437                            .dwattr DW$T$24, DW_AT_address_class(0x20)
    1438                    
    1439                    DW$T$23 .dwtag  DW_TAG_structure_type
    1440                            .dwattr DW$T$23, DW_AT_byte_size(0x20)
    1441                    DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1442                            .dwattr DW$124, DW_AT_name("i2coar"), DW_AT_symbol_name("_i2coar")
    1443                            .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444                            .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1445                    DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1446                            .dwattr DW$125, DW_AT_name("i2cier"), DW_AT_symbol_name("_i2cier")
    1447                            .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1448                            .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1449                    DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1450                            .dwattr DW$126, DW_AT_name("i2cclkl"), DW_AT_symbol_name("_i2cclkl")
    1451                            .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1452                            .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1453                    DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1454                            .dwattr DW$127, DW_AT_name("i2cclkh"), DW_AT_symbol_name("_i2cclkh")
    1455                            .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1456                            .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1457                    DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1458                            .dwattr DW$128, DW_AT_name("i2ccnt"), DW_AT_symbol_name("_i2ccnt")
    1459                            .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1460                            .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1461                    DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1462                            .dwattr DW$129, DW_AT_name("i2csar"), DW_AT_symbol_name("_i2csar")
    1463                            .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1464                            .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1465                    DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1466                            .dwattr DW$130, DW_AT_name("i2cmdr"), DW_AT_symbol_name("_i2cmdr")
    1467                            .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1468                            .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1469                    DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1470                            .dwattr DW$131, DW_AT_name("i2cpsc"), DW_AT_symbol_name("_i2cpsc")
    1471                            .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1472                            .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1473                            .dwendtag DW$T$23
    1474                    
    1475                    
    1476                    DW$T$22 .dwtag  DW_TAG_structure_type
    1477                            .dwattr DW$T$22, DW_AT_byte_size(0x14)
    1478                    DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1479                            .dwattr DW$132, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    1480                            .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                            .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1482                    DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1483                            .dwattr DW$133, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    1484                            .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1485                            .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Oct 28 15:46:20 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2842                            PAGE   28

    1486                    DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1487                            .dwattr DW$134, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    1488                            .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1489                            .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1490                    DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1491                            .dwattr DW$135, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
    1492                            .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1493                            .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1494                    DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1495                            .dwattr DW$136, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
    1496                            .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1497                            .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1498                            .dwendtag DW$T$22
    1499                    
    1500                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    1501                            .dwattr DW$T$21, DW_AT_address_class(0x20)
    1502                    DW$T$20 .dwtag  DW_TAG_volatile_type
    1503                            .dwattr DW$T$20, DW_AT_type(*DW$T$19)
    1504                    
    1505                            .dwattr DW$67, DW_AT_external(0x01)
    1506                            .dwattr DW$24, DW_AT_external(0x01)
    1507                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1508                    
    1509                    ;***************************************************************
    1510                    ;* DWARF CIE ENTRIES                                           *
    1511                    ;***************************************************************
    1512                    
    1513                    DW$CIE  .dwcie 1, 126
    1514                            .dwcfa  0x0c, 31, 0
    1515                            .dwcfa  0x07, 0
    1516                            .dwcfa  0x07, 1
    1517                            .dwcfa  0x07, 2
    1518                            .dwcfa  0x07, 3
    1519                            .dwcfa  0x07, 4
    1520                            .dwcfa  0x07, 5
    1521                            .dwcfa  0x07, 6
    1522                            .dwcfa  0x07, 7
    1523                            .dwcfa  0x07, 8
    1524                            .dwcfa  0x07, 9
    1525                            .dwcfa  0x08, 10
    1526                            .dwcfa  0x08, 11
    1527                            .dwcfa  0x08, 12
    1528                            .dwcfa  0x08, 13
    1529                            .dwcfa  0x08, 14
    1530                            .dwcfa  0x08, 15
    1531                            .dwcfa  0x07, 16
    1532                            .dwcfa  0x07, 17
    1533                            .dwcfa  0x07, 18
    1534                            .dwcfa  0x07, 19
    1535                            .dwcfa  0x07, 20
    1536                            .dwcfa  0x07, 21
    1537                            .dwcfa  0x07, 22
    1538                            .dwcfa  0x07, 23
    1539                            .dwcfa  0x07, 24
    1540                            .dwcfa  0x07, 25
TMS320C6x COFF Assembler PC v5.1.0 Thu Oct 28 15:46:20 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI2842                            PAGE   29

    1541                            .dwcfa  0x08, 26
    1542                            .dwcfa  0x08, 27
    1543                            .dwcfa  0x08, 28
    1544                            .dwcfa  0x08, 29
    1545                            .dwcfa  0x08, 30
    1546                            .dwcfa  0x08, 31
    1547                            .dwcfa  0x08, 32
    1548                            .dwcfa  0x07, 33
    1549                            .dwcfa  0x07, 34
    1550                            .dwcfa  0x07, 35
    1551                            .dwcfa  0x07, 36
    1552                            .dwcfa  0x07, 37
    1553                            .dwcfa  0x07, 38
    1554                            .dwcfa  0x07, 39
    1555                            .dwcfa  0x07, 40
    1556                            .dwcfa  0x07, 41
    1557                            .dwcfa  0x07, 42
    1558                            .dwcfa  0x07, 43
    1559                            .dwcfa  0x07, 44
    1560                            .dwcfa  0x07, 45
    1561                            .dwcfa  0x07, 46
    1562                            .dwcfa  0x07, 47
