;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Fri Apr 01 13:28:48 2011                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Disabled                                             *
;*   Optimizing for    : Compile time, Ease of Development                    *
;*                       Based on options: no -o, no -ms                      *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *
;*   Debug Info        : DWARF Debug                                          *

DW$374	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$60


DW$T$64	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$64, DW_AT_language(DW_LANG_C)
DW$375	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$376	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
	.dwendtag DW$T$64

DW$T$122	.dwtag  DW_TAG_typedef, DW_AT_name("Fxn"), DW_AT_type(*DW$T$121)
	.dwattr DW$T$122, DW_AT_language(DW_LANG_C)

DW$T$152	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$152, DW_AT_language(DW_LANG_C)

DW$T$156	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$156, DW_AT_language(DW_LANG_C)
DW$377	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$378	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$155)
	.dwendtag DW$T$156


DW$T$158	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$158, DW_AT_language(DW_LANG_C)
DW$379	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$380	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$158

DW$T$161	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$161, DW_AT_type(*DW$T$22)
DW$T$162	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$161)
	.dwattr DW$T$162, DW_AT_address_class(0x20)

DW$T$164	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$164, DW_AT_language(DW_LANG_C)
DW$381	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$164


DW$T$166	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$166, DW_AT_language(DW_LANG_C)
DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Handle"), DW_AT_type(*DW$T$34)
	.dwattr DW$T$89, DW_AT_language(DW_LANG_C)

DW$T$174	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$174, DW_AT_language(DW_LANG_C)
DW$382	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$383	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
	.dwendtag DW$T$174


DW$T$176	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$176, DW_AT_language(DW_LANG_C)
DW$384	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$176


DW$T$170	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$170, DW_AT_language(DW_LANG_C)
DW$385	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
	.dwendtag DW$T$170


DW$T$172	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$172, DW_AT_language(DW_LANG_C)
DW$T$111	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Handle"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$111, DW_AT_language(DW_LANG_C)
DW$T$149	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Handle"), DW_AT_type(*DW$T$148)
	.dwattr DW$T$149, DW_AT_language(DW_LANG_C)
DW$T$201	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Obj"), DW_AT_type(*DW$T$30)
	.dwattr DW$T$201, DW_AT_language(DW_LANG_C)
DW$T$123	.dwtag  DW_TAG_typedef, DW_AT_name("HWI_Attrs"), DW_AT_type(*DW$T$33)
	.dwattr DW$T$123, DW_AT_language(DW_LANG_C)
DW$T$124	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$123)
	.dwattr DW$T$124, DW_AT_address_class(0x20)
DW$T$140	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Config"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$140, DW_AT_language(DW_LANG_C)
DW$T$141	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$140)
	.dwattr DW$T$141, DW_AT_address_class(0x20)
DW$T$56	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
	.dwattr DW$T$56, DW_AT_address_class(0x20)
DW$T$155	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$154)
	.dwattr DW$T$155, DW_AT_address_class(0x20)
DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$52)
	.dwattr DW$T$53, DW_AT_language(DW_LANG_C)
DW$T$116	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$115)
	.dwattr DW$T$116, DW_AT_address_class(0x20)
DW$T$197	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$196)
	.dwattr DW$T$197, DW_AT_address_class(0x20)
DW$T$202	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$67)
	.dwattr DW$T$202, DW_AT_language(DW_LANG_C)
DW$T$99	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$87)
	.dwattr DW$T$99, DW_AT_address_class(0x20)
DW$T$207	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
	.dwattr DW$T$207, DW_AT_address_class(0x20)

DW$T$209	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$208)
	.dwattr DW$T$209, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$209, DW_AT_byte_size(0xc90)
DW$386	.dwtag  DW_TAG_subrange_type
	.dwattr DW$386, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$209

DW$T$210	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$208)
	.dwattr DW$T$210, DW_AT_address_class(0x20)
DW$T$212	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$211)
	.dwattr DW$T$212, DW_AT_address_class(0x20)
DW$T$214	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$213)
	.dwattr DW$T$214, DW_AT_address_class(0x20)
DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x20)
DW$T$58	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
	.dwattr DW$T$58, DW_AT_address_class(0x20)
DW$T$134	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$133)
	.dwattr DW$T$134, DW_AT_address_class(0x20)
DW$T$9	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$9, DW_AT_byte_size(0x02)
DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$93, DW_AT_language(DW_LANG_C)
DW$T$121	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$120)
	.dwattr DW$T$121, DW_AT_address_class(0x20)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$19	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$19, DW_AT_address_class(0x20)

DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$30, DW_AT_name("SEM_Obj")
	.dwattr DW$T$30, DW_AT_byte_size(0x1c)
DW$387	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$387, DW_AT_name("job"), DW_AT_symbol_name("_job")
	.dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
DW$388	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$388, DW_AT_name("count"), DW_AT_symbol_name("_count")
	.dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
DW$389	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$389, DW_AT_name("pendQ"), DW_AT_symbol_name("_pendQ")
	.dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30

DW$T$148	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$148, DW_AT_address_class(0x20)

DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$33, DW_AT_name("HWI_Attrs")
	.dwattr DW$T$33, DW_AT_byte_size(0x0c)
DW$390	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$390, DW_AT_name("intrMask"), DW_AT_symbol_name("_intrMask")
	.dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
DW$391	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$391, DW_AT_name("ccMask"), DW_AT_symbol_name("_ccMask")
	.dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
DW$392	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$392, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
	.dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33


DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_byte_size(0x18)
DW$393	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$393, DW_AT_name("opt"), DW_AT_symbol_name("_opt")
	.dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
DW$394	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$394, DW_AT_name("src"), DW_AT_symbol_name("_src")
	.dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
DW$395	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$395, DW_AT_name("cnt"), DW_AT_symbol_name("_cnt")
	.dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
DW$396	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$396, DW_AT_name("dst"), DW_AT_symbol_name("_dst")
	.dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
DW$397	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$397, DW_AT_name("idx"), DW_AT_symbol_name("_idx")
	.dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
DW$398	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$398, DW_AT_name("rld"), DW_AT_symbol_name("_rld")
	.dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35

DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$54)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$T$154	.dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$40)
	.dwattr DW$T$154, DW_AT_language(DW_LANG_C)
DW$T$52	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
	.dwattr DW$T$52, DW_AT_address_class(0x20)
DW$T$115	.dwtag  DW_TAG_const_type
	.dwattr DW$T$115, DW_AT_type(*DW$T$51)
DW$T$196	.dwtag  DW_TAG_typedef, DW_AT_name("Int8"), DW_AT_type(*DW$T$51)
	.dwattr DW$T$196, DW_AT_language(DW_LANG_C)

DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$67, DW_AT_name("IOM_Fxns")
	.dwattr DW$T$67, DW_AT_byte_size(0x18)
DW$399	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$399, DW_AT_name("mdBindDev"), DW_AT_symbol_name("_mdBindDev")
	.dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
DW$400	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$400, DW_AT_name("mdUnBindDev"), DW_AT_symbol_name("_mdUnBindDev")
	.dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
DW$401	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$401, DW_AT_name("mdControlChan"), DW_AT_symbol_name("_mdControlChan")
	.dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
DW$402	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$402, DW_AT_name("mdCreateChan"), DW_AT_symbol_name("_mdCreateChan")
	.dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
DW$403	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
	.dwattr DW$403, DW_AT_name("mdDeleteChan"), DW_AT_symbol_name("_mdDeleteChan")
	.dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
DW$404	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$404, DW_AT_name("mdSubmitChan"), DW_AT_symbol_name("_mdSubmitChan")
	.dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$67

DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_Frame"), DW_AT_type(*DW$T$79)
	.dwattr DW$T$87, DW_AT_language(DW_LANG_C)
DW$T$103	.dwtag  DW_TAG_typedef, DW_AT_name("_VPORT_ChanObj"), DW_AT_type(*DW$T$102)
	.dwattr DW$T$103, DW_AT_language(DW_LANG_C)
DW$T$208	.dwtag  DW_TAG_typedef, DW_AT_name("PortObj"), DW_AT_type(*DW$T$105)
	.dwattr DW$T$208, DW_AT_language(DW_LANG_C)
DW$T$211	.dwtag  DW_TAG_typedef, DW_AT_name("VPORT_PortParams"), DW_AT_type(*DW$T$107)
	.dwattr DW$T$211, DW_AT_language(DW_LANG_C)
DW$T$213	.dwtag  DW_TAG_typedef, DW_AT_name("VPORT_VIntCbParams"), DW_AT_type(*DW$T$108)
	.dwattr DW$T$213, DW_AT_language(DW_LANG_C)

DW$T$57	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$57, DW_AT_language(DW_LANG_C)
DW$405	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$406	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
	.dwendtag DW$T$57

DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$32, DW_AT_language(DW_LANG_C)
DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdBindDev"), DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_language(DW_LANG_C)
DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdUnBindDev"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdDeleteChan"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdControlChan"), DW_AT_type(*DW$T$49)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdCreateChan"), DW_AT_type(*DW$T$61)
	.dwattr DW$T$62, DW_AT_language(DW_LANG_C)
DW$T$66	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdSubmitChan"), DW_AT_type(*DW$T$65)
	.dwattr DW$T$66, DW_AT_language(DW_LANG_C)

DW$T$120	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$120, DW_AT_language(DW_LANG_C)

DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_name("QUE_Elem")
	.dwattr DW$T$20, DW_AT_byte_size(0x08)
DW$407	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$407, DW_AT_name("next"), DW_AT_symbol_name("_next")
	.dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
DW$408	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$408, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
	.dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20

DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Job"), DW_AT_type(*DW$T$28)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)

DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$40, DW_AT_byte_size(0x58)
DW$409	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$409, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
	.dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
DW$410	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$410, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
	.dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
DW$411	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$411, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
DW$412	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$412, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
DW$413	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$413, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
	.dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
DW$414	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$414, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
	.dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
DW$415	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$415, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
	.dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
DW$416	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$416, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
	.dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
DW$417	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$417, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
	.dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
DW$418	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$418, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
	.dwattr DW$418, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$418, DW_AT_accessibility(DW_ACCESS_public)
DW$419	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$419, DW_AT_name("sse"), DW_AT_symbol_name("_sse")
	.dwattr DW$419, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$419, DW_AT_accessibility(DW_ACCESS_public)
DW$420	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$420, DW_AT_name("vcvblnkp"), DW_AT_symbol_name("_vcvblnkp")
	.dwattr DW$420, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$420, DW_AT_accessibility(DW_ACCESS_public)
DW$421	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$421, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
	.dwattr DW$421, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$421, DW_AT_accessibility(DW_ACCESS_public)
DW$422	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$422, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
	.dwattr DW$422, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$422, DW_AT_accessibility(DW_ACCESS_public)
DW$423	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$423, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
	.dwattr DW$423, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$423, DW_AT_accessibility(DW_ACCESS_public)
DW$424	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$424, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
	.dwattr DW$424, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$424, DW_AT_accessibility(DW_ACCESS_public)
DW$425	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$425, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
	.dwattr DW$425, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$425, DW_AT_accessibility(DW_ACCESS_public)
DW$426	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$426, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
	.dwattr DW$426, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$426, DW_AT_accessibility(DW_ACCESS_public)
DW$427	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$427, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
	.dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
DW$428	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$428, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
	.dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
DW$429	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$429, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
	.dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
DW$430	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$430, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
	.dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
DW$431	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$431, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
	.dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
DW$432	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$432, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
DW$433	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$433, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
	.dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
DW$434	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$434, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
	.dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
DW$435	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$435, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
	.dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$40

DW$T$51	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$51, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$51, DW_AT_byte_size(0x01)

DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$79, DW_AT_name("FVID_Frame")
	.dwattr DW$T$79, DW_AT_byte_size(0x20)
DW$436	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$436, DW_AT_name("queElement"), DW_AT_symbol_name("_queElement")
	.dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
DW$437	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
	.dwattr DW$437, DW_AT_name("frame"), DW_AT_symbol_name("_frame")
	.dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$79


DW$T$102	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$102, DW_AT_byte_size(0x214)
DW$438	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$438, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
DW$439	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$439, DW_AT_name("portNum"), DW_AT_symbol_name("_portNum")
	.dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
DW$440	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$440, DW_AT_name("chanNum"), DW_AT_symbol_name("_chanNum")
	.dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
DW$441	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$441, DW_AT_name("base"), DW_AT_symbol_name("_base")
	.dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
DW$442	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$442, DW_AT_name("edmaChanNum"), DW_AT_symbol_name("_edmaChanNum")
	.dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
DW$443	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$443, DW_AT_name("edmaAddr"), DW_AT_symbol_name("_edmaAddr")
	.dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
DW$444	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$444, DW_AT_name("vIntMask"), DW_AT_symbol_name("_vIntMask")
	.dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
DW$445	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$445, DW_AT_name("viops"), DW_AT_symbol_name("_viops")
	.dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
DW$446	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$446, DW_AT_name("qIn"), DW_AT_symbol_name("_qIn")
	.dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
	.dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
DW$447	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$447, DW_AT_name("qOut"), DW_AT_symbol_name("_qOut")
	.dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
	.dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
DW$448	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
	.dwattr DW$448, DW_AT_name("hEdma"), DW_AT_symbol_name("_hEdma")
	.dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
	.dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
DW$449	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
	.dwattr DW$449, DW_AT_name("hRld"), DW_AT_symbol_name("_hRld")
	.dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
	.dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
DW$450	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
	.dwattr DW$450, DW_AT_name("tcc"), DW_AT_symbol_name("_tcc")
	.dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
DW$451	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$451, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ac]
	.dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
DW$452	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$452, DW_AT_name("cbFxn"), DW_AT_symbol_name("_cbFxn")
	.dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b0]
	.dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
DW$453	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$453, DW_AT_name("cbArg"), DW_AT_symbol_name("_cbArg")
	.dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b4]
	.dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
DW$454	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
	.dwattr DW$454, DW_AT_name("vIntFxn"), DW_AT_symbol_name("_vIntFxn")
	.dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b8]
	.dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
DW$455	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
	.dwattr DW$455, DW_AT_name("queEmpty"), DW_AT_symbol_name("_queEmpty")
	.dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x1bc]
	.dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
DW$456	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$456, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x1be]
	.dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
DW$457	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$457, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c0]
	.dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
DW$458	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$458, DW_AT_name("yPitch"), DW_AT_symbol_name("_yPitch")
	.dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c4]
	.dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
DW$459	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$459, DW_AT_name("cPitch"), DW_AT_symbol_name("_cPitch")
	.dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c8]
	.dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
DW$460	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$460, DW_AT_name("numLines"), DW_AT_symbol_name("_numLines")
	.dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x1cc]
	.dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
DW$461	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$461, DW_AT_name("numPixels"), DW_AT_symbol_name("_numPixels")
	.dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d0]
	.dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
DW$462	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$462, DW_AT_name("numLinesFld1"), DW_AT_symbol_name("_numLinesFld1")
	.dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d4]
	.dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
DW$463	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$463, DW_AT_name("numFrms"), DW_AT_symbol_name("_numFrms")
	.dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d8]
	.dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
DW$464	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$464, DW_AT_name("numEvents"), DW_AT_symbol_name("_numEvents")
	.dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x1dc]
	.dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
DW$465	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$465, DW_AT_name("numEventsFld1"), DW_AT_symbol_name("_numEventsFld1")
	.dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
	.dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
DW$466	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$466, DW_AT_name("yThrld"), DW_AT_symbol_name("_yThrld")
	.dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e4]
	.dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
DW$467	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$467, DW_AT_name("cThrld"), DW_AT_symbol_name("_cThrld")
	.dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
DW$468	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
	.dwattr DW$468, DW_AT_name("curViop"), DW_AT_symbol_name("_curViop")
	.dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
DW$469	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
	.dwattr DW$469, DW_AT_name("nextViop"), DW_AT_symbol_name("_nextViop")
	.dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
DW$470	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
	.dwattr DW$470, DW_AT_name("mrViop"), DW_AT_symbol_name("_mrViop")
	.dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f4]
	.dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
DW$471	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$471, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
	.dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
	.dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
DW$472	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
	.dwattr DW$472, DW_AT_name("edcFxns"), DW_AT_symbol_name("_edcFxns")
	.dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0x1fc]
	.dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
DW$473	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$473, DW_AT_name("edcHandle"), DW_AT_symbol_name("_edcHandle")
	.dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
DW$474	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$474, DW_AT_name("packetIOM"), DW_AT_symbol_name("_packetIOM")
	.dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
DW$475	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$475, DW_AT_name("vIntCbArg"), DW_AT_symbol_name("_vIntCbArg")
	.dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
DW$476	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$476, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
	.dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
DW$477	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$477, DW_AT_name("bufSz"), DW_AT_symbol_name("_bufSz")
	.dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x210]
	.dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$102


DW$T$105	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$105, DW_AT_name("PortObj")
	.dwattr DW$T$105, DW_AT_byte_size(0x430)
DW$478	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$478, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
DW$479	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$479, DW_AT_name("base"), DW_AT_symbol_name("_base")
	.dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
DW$480	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
	.dwattr DW$480, DW_AT_name("chanObj"), DW_AT_symbol_name("_chanObj")
	.dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$105


DW$T$107	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$107, DW_AT_name("VPORT_PortParams")
	.dwattr DW$T$107, DW_AT_byte_size(0x18)
DW$481	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$481, DW_AT_name("dualChanEnable"), DW_AT_symbol_name("_dualChanEnable")
	.dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
DW$482	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$482, DW_AT_name("vc1Polarity"), DW_AT_symbol_name("_vc1Polarity")
	.dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
DW$483	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$483, DW_AT_name("vc2Polarity"), DW_AT_symbol_name("_vc2Polarity")
	.dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
DW$484	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$484, DW_AT_name("vc3Polarity"), DW_AT_symbol_name("_vc3Polarity")
	.dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
DW$485	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$106)
	.dwattr DW$485, DW_AT_name("edcTbl"), DW_AT_symbol_name("_edcTbl")
	.dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$107


DW$T$108	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$108, DW_AT_name("VPORT_VIntCbParams")
	.dwattr DW$T$108, DW_AT_byte_size(0x10)
DW$486	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$486, DW_AT_name("cbArg"), DW_AT_symbol_name("_cbArg")
	.dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
DW$487	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
	.dwattr DW$487, DW_AT_name("vIntCbFxn"), DW_AT_symbol_name("_vIntCbFxn")
	.dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
DW$488	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$488, DW_AT_name("vIntMask"), DW_AT_symbol_name("_vIntMask")
	.dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
DW$489	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$489, DW_AT_name("vIntLine"), DW_AT_symbol_name("_vIntLine")
	.dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
	.dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
DW$490	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$490, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
	.dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$108

DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("VPORT_IntCallBack"), DW_AT_type(*DW$T$96)
	.dwattr DW$T$97, DW_AT_language(DW_LANG_C)
DW$T$98	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$98, DW_AT_type(*DW$T$94)
DW$T$43	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
	.dwattr DW$T$43, DW_AT_address_class(0x20)
DW$T$46	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
	.dwattr DW$T$46, DW_AT_address_class(0x20)
DW$T$49	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
	.dwattr DW$T$49, DW_AT_address_class(0x20)
DW$T$61	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$60)
	.dwattr DW$T$61, DW_AT_address_class(0x20)
DW$T$65	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$64)
	.dwattr DW$T$65, DW_AT_address_class(0x20)

DW$T$92	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$92, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$92, DW_AT_byte_size(0x0c)
DW$491	.dwtag  DW_TAG_subrange_type
	.dwattr DW$491, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$92


DW$T$86	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$31)
	.dwattr DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$86, DW_AT_byte_size(0x0c)
DW$492	.dwtag  DW_TAG_subrange_type
	.dwattr DW$492, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$86


DW$T$90	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$90, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$90, DW_AT_byte_size(0x0c)
DW$493	.dwtag  DW_TAG_subrange_type
	.dwattr DW$493, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$90


DW$T$91	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$91, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$91, DW_AT_byte_size(0x18)
DW$494	.dwtag  DW_TAG_subrange_type
	.dwattr DW$494, DW_AT_upper_bound(0x05)
	.dwendtag DW$T$91

DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)

DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$28, DW_AT_name("KNL_Job")
	.dwattr DW$T$28, DW_AT_byte_size(0x10)
DW$495	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$495, DW_AT_name("wListElem"), DW_AT_symbol_name("_wListElem")
	.dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
DW$496	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$496, DW_AT_name("wCount"), DW_AT_symbol_name("_wCount")
	.dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
DW$497	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$497, DW_AT_name("fxn"), DW_AT_symbol_name("_fxn")
	.dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$28


DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$38, DW_AT_name("DEV_Frame")
	.dwattr DW$T$38, DW_AT_byte_size(0x20)
DW$498	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$498, DW_AT_name("link"), DW_AT_symbol_name("_link")
	.dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
DW$499	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$499, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
	.dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
DW$500	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$500, DW_AT_name("size"), DW_AT_symbol_name("_size")
	.dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
DW$501	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$501, DW_AT_name("misc"), DW_AT_symbol_name("_misc")
	.dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
DW$502	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$502, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
	.dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
DW$503	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$503, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
	.dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
DW$504	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$504, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$38


DW$T$78	.dwtag  DW_TAG_union_type
	.dwattr DW$T$78, DW_AT_byte_size(0x18)
DW$505	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
	.dwattr DW$505, DW_AT_name("iFrm"), DW_AT_symbol_name("_iFrm")
	.dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
DW$506	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
	.dwattr DW$506, DW_AT_name("pFrm"), DW_AT_symbol_name("_pFrm")
	.dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
DW$507	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
	.dwattr DW$507, DW_AT_name("riFrm"), DW_AT_symbol_name("_riFrm")
	.dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
DW$508	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
	.dwattr DW$508, DW_AT_name("rpFrm"), DW_AT_symbol_name("_rpFrm")
	.dwattr DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$508, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$78


DW$T$88	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$87)
	.dwattr DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$88, DW_AT_byte_size(0x140)
DW$509	.dwtag  DW_TAG_subrange_type
	.dwattr DW$509, DW_AT_upper_bound(0x09)
	.dwendtag DW$T$88

DW$T$101	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$100)
	.dwattr DW$T$101, DW_AT_address_class(0x20)

DW$T$106	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$101)
	.dwattr DW$T$106, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$106, DW_AT_byte_size(0x08)
DW$510	.dwtag  DW_TAG_subrange_type
	.dwattr DW$510, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$106


DW$T$104	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$103)
	.dwattr DW$T$104, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$104, DW_AT_byte_size(0x428)
DW$511	.dwtag  DW_TAG_subrange_type
	.dwattr DW$511, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$104

DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Fxn"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
DW$T$96	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$95)
	.dwattr DW$T$96, DW_AT_address_class(0x20)
DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_IFrame"), DW_AT_type(*DW$T$70)
	.dwattr DW$T$74, DW_AT_language(DW_LANG_C)
DW$T$75	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_PFrame"), DW_AT_type(*DW$T$71)
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)
DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawIFrame"), DW_AT_type(*DW$T$72)
	.dwattr DW$T$76, DW_AT_language(DW_LANG_C)
DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawPFrame"), DW_AT_type(*DW$T$73)
	.dwattr DW$T$77, DW_AT_language(DW_LANG_C)
DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$85)
	.dwattr DW$T$100, DW_AT_language(DW_LANG_C)
DW$T$26	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
	.dwattr DW$T$26, DW_AT_address_class(0x20)

DW$T$95	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$95, DW_AT_language(DW_LANG_C)
DW$512	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
DW$513	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$95


DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$70, DW_AT_name("FVID_IFrame")
	.dwattr DW$T$70, DW_AT_byte_size(0x18)
DW$514	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$514, DW_AT_name("y1"), DW_AT_symbol_name("_y1")
	.dwattr DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$514, DW_AT_accessibility(DW_ACCESS_public)
DW$515	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$515, DW_AT_name("cb1"), DW_AT_symbol_name("_cb1")
	.dwattr DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$515, DW_AT_accessibility(DW_ACCESS_public)
DW$516	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$516, DW_AT_name("cr1"), DW_AT_symbol_name("_cr1")
	.dwattr DW$516, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$516, DW_AT_accessibility(DW_ACCESS_public)
DW$517	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$517, DW_AT_name("y2"), DW_AT_symbol_name("_y2")
	.dwattr DW$517, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$517, DW_AT_accessibility(DW_ACCESS_public)
DW$518	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$518, DW_AT_name("cb2"), DW_AT_symbol_name("_cb2")
	.dwattr DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$518, DW_AT_accessibility(DW_ACCESS_public)
DW$519	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$519, DW_AT_name("cr2"), DW_AT_symbol_name("_cr2")
	.dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$70


DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$71, DW_AT_name("FVID_PFrame")
	.dwattr DW$T$71, DW_AT_byte_size(0x0c)
DW$520	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$520, DW_AT_name("y"), DW_AT_symbol_name("_y")
	.dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
DW$521	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$521, DW_AT_name("cb"), DW_AT_symbol_name("_cb")
	.dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
DW$522	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$522, DW_AT_name("cr"), DW_AT_symbol_name("_cr")
	.dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$71


DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$72, DW_AT_name("FVID_RawIFrame")
	.dwattr DW$T$72, DW_AT_byte_size(0x08)
DW$523	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$523, DW_AT_name("buf1"), DW_AT_symbol_name("_buf1")
	.dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
DW$524	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$524, DW_AT_name("buf2"), DW_AT_symbol_name("_buf2")
	.dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$72


DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$73, DW_AT_name("FVID_RawPFrame")
	.dwattr DW$T$73, DW_AT_byte_size(0x04)
DW$525	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$525, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
	.dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$73


DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$85, DW_AT_name("EDC_Fxns")
	.dwattr DW$T$85, DW_AT_byte_size(0x0c)
DW$526	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$526, DW_AT_name("open"), DW_AT_symbol_name("_open")
	.dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
DW$527	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
	.dwattr DW$527, DW_AT_name("close"), DW_AT_symbol_name("_close")
	.dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
DW$528	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
	.dwattr DW$528, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
	.dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$85

DW$T$82	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$81)
	.dwattr DW$T$82, DW_AT_address_class(0x20)

DW$T$25	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$529	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
	.dwendtag DW$T$25

DW$T$84	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$83)
	.dwattr DW$T$84, DW_AT_address_class(0x20)
DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_JobHandle"), DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)
DW$T$69	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$68)
	.dwattr DW$T$69, DW_AT_address_class(0x20)

DW$T$81	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$80)
	.dwattr DW$T$81, DW_AT_language(DW_LANG_C)
DW$530	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
DW$531	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$81


DW$T$83	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$83, DW_AT_language(DW_LANG_C)
DW$532	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$533	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
DW$534	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$83

DW$T$23	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
	.dwattr DW$T$23, DW_AT_address_class(0x20)
DW$T$68	.dwtag  DW_TAG_typedef, DW_AT_name("Char"), DW_AT_type(*DW$T$51)
	.dwattr DW$T$68, DW_AT_language(DW_LANG_C)
DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Handle"), DW_AT_type(*DW$T$3)
	.dwattr DW$T$80, DW_AT_language(DW_LANG_C)

	.dwattr DW$203, DW_AT_type(*DW$T$22)
	.dwattr DW$219, DW_AT_type(*DW$T$22)
	.dwattr DW$225, DW_AT_type(*DW$T$22)
	.dwattr DW$233, DW_AT_type(*DW$T$22)
	.dwattr DW$274, DW_AT_type(*DW$T$22)
	.dwattr DW$289, DW_AT_type(*DW$T$22)
	.dwattr DW$307, DW_AT_type(*DW$T$22)
	.dwattr DW$314, DW_AT_type(*DW$T$22)
	.dwattr DW$75, DW_AT_type(*DW$T$22)
	.dwattr DW$87, DW_AT_type(*DW$T$22)
	.dwattr DW$97, DW_AT_type(*DW$T$22)
	.dwattr DW$132, DW_AT_type(*DW$T$22)
	.dwattr DW$144, DW_AT_type(*DW$T$22)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF CIE ENTRIES                                           *
;***************************************************************

DW$CIE	.dwcie 1, 126
	.dwcfa	0x0c, 31, 0
	.dwcfa	0x07, 0
	.dwcfa	0x07, 1
	.dwcfa	0x07, 2
	.dwcfa	0x07, 3
	.dwcfa	0x07, 4
	.dwcfa	0x07, 5
	.dwcfa	0x07, 6
	.dwcfa	0x07, 7
	.dwcfa	0x07, 8
	.dwcfa	0x07, 9
	.dwcfa	0x08, 10
	.dwcfa	0x08, 11
	.dwcfa	0x08, 12
	.dwcfa	0x08, 13
	.dwcfa	0x08, 14
	.dwcfa	0x08, 15
	.dwcfa	0x07, 16
	.dwcfa	0x07, 17
	.dwcfa	0x07, 18
	.dwcfa	0x07, 19
	.dwcfa	0x07, 20
	.dwcfa	0x07, 21
	.dwcfa	0x07, 22
	.dwcfa	0x07, 23
	.dwcfa	0x07, 24
	.dwcfa	0x07, 25
	.dwcfa	0x08, 26
	.dwcfa	0x08, 27
	.dwcfa	0x08, 28
	.dwcfa	0x08, 29
	.dwcfa	0x08, 30
	.dwcfa	0x08, 31
	.dwcfa	0x08, 32
	.dwcfa	0x07, 33
	.dwcfa	0x07, 34
	.dwcfa	0x07, 35
	.dwcfa	0x07, 36
	.dwcfa	0x07, 37
	.dwcfa	0x07, 38
	.dwcfa	0x07, 39
	.dwcfa	0x07, 40
	.dwcfa	0x07, 41
	.dwcfa	0x07, 42
	.dwcfa	0x07, 43
	.dwcfa	0x07, 44
	.dwcfa	0x07, 45
	.dwcfa	0x07, 46
	.dwcfa	0x07, 47
	.dwcfa	0x07, 48
	.dwcfa	0x07, 49
	.dwcfa	0x07, 50
	.dwcfa	0x07, 51
	.dwcfa	0x07, 52
	.dwcfa	0x07, 53
	.dwcfa	0x07, 54
	.dwcfa	0x07, 55
	.dwcfa	0x07, 56
	.dwcfa	0x07, 57
	.dwcfa	0x07, 58
	.dwcfa	0x07, 59
	.dwcfa	0x07, 60
	.dwcfa	0x07, 61
	.dwcfa	0x07, 62
	.dwcfa	0x07, 63
	.dwcfa	0x07, 64
	.dwcfa	0x07, 65
	.dwcfa	0x07, 66
	.dwcfa	0x07, 67
	.dwcfa	0x07, 68
	.dwcfa	0x07, 69
	.dwcfa	0x07, 70
	.dwcfa	0x07, 71
	.dwcfa	0x07, 72
	.dwcfa	0x07, 73
	.dwcfa	0x07, 74
	.dwcfa	0x07, 75
	.dwcfa	0x07, 76
	.dwcfa	0x07, 77
	.dwcfa	0x07, 78
	.dwcfa	0x07, 79
	.dwcfa	0x07, 80
	.dwcfa	0x07, 81
	.dwcfa	0x07, 82
	.dwcfa	0x07, 83
	.dwcfa	0x07, 84
	.dwcfa	0x07, 85
	.dwcfa	0x07, 86
	.dwcfa	0x07, 87
	.dwcfa	0x07, 88
	.dwcfa	0x07, 89
	.dwcfa	0x07, 90
	.dwcfa	0x07, 91
	.dwcfa	0x07, 92
	.dwcfa	0x07, 93
	.dwcfa	0x07, 94
