TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 10 14:35:59 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

     624                    DW$T$52 .dwtag  DW_TAG_subroutine_type
     625                            .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
     626                    DW$46   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$47)
     627                    DW$47   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
     628                            .dwendtag DW$T$52
     629                    
     630                    
     631                    DW$T$56 .dwtag  DW_TAG_subroutine_type
     632                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
     633                    DW$48   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$55)
     634                    DW$49   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
     635                    DW$50   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     636                            .dwendtag DW$T$56
     637                    
     638                    
     639                    DW$T$58 .dwtag  DW_TAG_subroutine_type
     640                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
     641                    DW$51   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     642                            .dwendtag DW$T$58
     643                    
     644                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     645                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     646                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     647                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
     648                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     649                    DW$T$24 .dwtag  DW_TAG_volatile_type
     650                            .dwattr DW$T$24, DW_AT_type(*DW$T$19)
     651                    DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
     652                            .dwattr DW$T$37, DW_AT_address_class(0x20)
     653                    DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("EMIFA_Config"), DW_AT_type(*DW$T$32)
     654                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     655                    DW$T$43 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
     656                            .dwattr DW$T$43, DW_AT_address_class(0x20)
     657                    DW$T$61 .dwtag  DW_TAG_const_type
     658                            .dwattr DW$T$61, DW_AT_type(*DW$T$42)
     659                    DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$46)
     660                            .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE   13

     661                    
     662                    DW$T$62 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$47)
     663                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
     664                    DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     665                    DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     666                            .dwendtag DW$T$62
     667                    
     668                    DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Config"), DW_AT_type(*DW$T$34)
     669                            .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
     670                    DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
     671                            .dwattr DW$T$51, DW_AT_address_class(0x20)
     672                    DW$T$64 .dwtag  DW_TAG_const_type
     673                            .dwattr DW$T$64, DW_AT_type(*DW$T$50)
     674                    DW$T$66 .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle"), DW_AT_type(*DW$T$65)
     675                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
     676                    
     677                    DW$T$67 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$66)
     678                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
     679                    DW$54   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     680                    DW$55   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     681                            .dwendtag DW$T$67
     682                    
     683                    DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$54)
     684                            .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
     685                    DW$T$70 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_L2Mode"), DW_AT_type(*DW$T$69)
     686                            .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
     687                    
     688                    DW$T$71 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$70)
     689                            .dwattr DW$T$71, DW_AT_language(DW_LANG_C)
     690                    DW$56   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$70)
     691                            .dwendtag DW$T$71
     692                    
     693                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     694                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     695                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     696                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("_CSL_Config"), DW_AT_type(*DW$T$31)
     697                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     698                    
     699                    DW$T$32 .dwtag  DW_TAG_structure_type
     700                            .dwattr DW$T$32, DW_AT_byte_size(0x30)
     701                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     702                            .dwattr DW$57, DW_AT_name("gblctl"), DW_AT_symbol_name("_gblctl")
     703                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     704                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     705                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     706                            .dwattr DW$58, DW_AT_name("cectl0"), DW_AT_symbol_name("_cectl0")
     707                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     708                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     709                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     710                            .dwattr DW$59, DW_AT_name("cectl1"), DW_AT_symbol_name("_cectl1")
     711                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     712                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     713                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     714                            .dwattr DW$60, DW_AT_name("cectl2"), DW_AT_symbol_name("_cectl2")
     715                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE   14

     716                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     717                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     718                            .dwattr DW$61, DW_AT_name("cectl3"), DW_AT_symbol_name("_cectl3")
     719                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     720                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     721                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     722                            .dwattr DW$62, DW_AT_name("sdctl"), DW_AT_symbol_name("_sdctl")
     723                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     724                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     725                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     726                            .dwattr DW$63, DW_AT_name("sdtim"), DW_AT_symbol_name("_sdtim")
     727                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     728                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     729                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     730                            .dwattr DW$64, DW_AT_name("sdext"), DW_AT_symbol_name("_sdext")
     731                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     732                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     733                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     734                            .dwattr DW$65, DW_AT_name("cesec0"), DW_AT_symbol_name("_cesec0")
     735                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     736                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     737                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     738                            .dwattr DW$66, DW_AT_name("cesec1"), DW_AT_symbol_name("_cesec1")
     739                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     740                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     741                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     742                            .dwattr DW$67, DW_AT_name("cesec2"), DW_AT_symbol_name("_cesec2")
     743                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     744                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     745                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     746                            .dwattr DW$68, DW_AT_name("cesec3"), DW_AT_symbol_name("_cesec3")
     747                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     748                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     749                            .dwendtag DW$T$32
     750                    
     751                    DW$T$46 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
     752                            .dwattr DW$T$46, DW_AT_address_class(0x20)
     753                    
     754                    DW$T$34 .dwtag  DW_TAG_structure_type
     755                            .dwattr DW$T$34, DW_AT_byte_size(0x20)
     756                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     757                            .dwattr DW$69, DW_AT_name("i2coar"), DW_AT_symbol_name("_i2coar")
     758                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     760                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     761                            .dwattr DW$70, DW_AT_name("i2cier"), DW_AT_symbol_name("_i2cier")
     762                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     763                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     764                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     765                            .dwattr DW$71, DW_AT_name("i2cclkl"), DW_AT_symbol_name("_i2cclkl")
     766                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     767                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     768                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     769                            .dwattr DW$72, DW_AT_name("i2cclkh"), DW_AT_symbol_name("_i2cclkh")
     770                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE   15

     771                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     772                    DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     773                            .dwattr DW$73, DW_AT_name("i2ccnt"), DW_AT_symbol_name("_i2ccnt")
     774                            .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     775                            .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     776                    DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     777                            .dwattr DW$74, DW_AT_name("i2csar"), DW_AT_symbol_name("_i2csar")
     778                            .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     779                            .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     780                    DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     781                            .dwattr DW$75, DW_AT_name("i2cmdr"), DW_AT_symbol_name("_i2cmdr")
     782                            .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     783                            .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     784                    DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     785                            .dwattr DW$76, DW_AT_name("i2cpsc"), DW_AT_symbol_name("_i2cpsc")
     786                            .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     787                            .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     788                            .dwendtag DW$T$34
     789                    
     790                    DW$T$65 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     791                            .dwattr DW$T$65, DW_AT_address_class(0x20)
     792                    
     793                    DW$T$54 .dwtag  DW_TAG_enumeration_type
     794                            .dwattr DW$T$54, DW_AT_byte_size(0x04)
     795                    DW$77   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
     796                    DW$78   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
     797                    DW$79   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
     798                    DW$80   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
     799                    DW$81   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
     800                    DW$82   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
     801                            .dwendtag DW$T$54
     802                    
     803                    
     804                    DW$T$69 .dwtag  DW_TAG_enumeration_type
     805                            .dwattr DW$T$69, DW_AT_byte_size(0x04)
     806                    DW$83   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_256KSRAM"), DW_AT_const_value(0x00)
     807                    DW$84   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_0KCACHE"), DW_AT_const_value(0x00)
     808                    DW$85   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_224KSRAM"), DW_AT_const_value(0x01)
     809                    DW$86   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_32KCACHE"), DW_AT_const_value(0x01)
     810                    DW$87   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_192KSRAM"), DW_AT_const_value(0x02)
     811                    DW$88   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_64KCACHE"), DW_AT_const_value(0x02)
     812                    DW$89   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_128KSRAM"), DW_AT_const_value(0x03)
     813                    DW$90   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_128KCACHE"), DW_AT_const_value(0x03)
     814                    DW$91   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_0KSRAM"), DW_AT_const_value(0x07)
     815                    DW$92   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_256KCACHE"), DW_AT_const_value(0x07)
     816                            .dwendtag DW$T$69
     817                    
     818                    
     819                    DW$T$31 .dwtag  DW_TAG_union_type
     820                            .dwattr DW$T$31, DW_AT_byte_size(0x10)
     821                    DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     822                            .dwattr DW$93, DW_AT_name("args"), DW_AT_symbol_name("_args")
     823                            .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                            .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
     825                    DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE   16

     826                            .dwattr DW$94, DW_AT_name("ret"), DW_AT_symbol_name("_ret")
     827                            .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     828                            .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
     829                            .dwendtag DW$T$31
     830                    
     831                    
     832                    DW$T$33 .dwtag  DW_TAG_structure_type
     833                            .dwattr DW$T$33, DW_AT_byte_size(0x14)
     834                    DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     835                            .dwattr DW$95, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     836                            .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837                            .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     838                    DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     839                            .dwattr DW$96, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
     840                            .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     841                            .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     842                    DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     843                            .dwattr DW$97, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     844                            .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     845                            .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     846                    DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     847                            .dwattr DW$98, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
     848                            .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     849                            .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     850                    DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     851                            .dwattr DW$99, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
     852                            .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     853                            .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     854                            .dwendtag DW$T$33
     855                    
     856                    
     857                    DW$T$35 .dwtag  DW_TAG_structure_type
     858                            .dwattr DW$T$35, DW_AT_byte_size(0x0c)
     859                    DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     860                            .dwattr DW$100, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     861                            .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                            .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     863                    DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     864                            .dwattr DW$101, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     865                            .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     866                            .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     867                    DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     868                            .dwattr DW$102, DW_AT_name("pinAllocMask"), DW_AT_symbol_name("_pinAllocMask")
     869                            .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     870                            .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     871                            .dwendtag DW$T$35
     872                    
     873                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     874                            .dwattr DW$T$25, DW_AT_address_class(0x20)
     875                    
     876                    DW$T$23 .dwtag  DW_TAG_structure_type
     877                            .dwattr DW$T$23, DW_AT_byte_size(0x10)
     878                    DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     879                            .dwattr DW$103, DW_AT_name("biosPresent"), DW_AT_symbol_name("_biosPresent")
     880                            .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE   17

     881                            .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     882                    DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     883                            .dwattr DW$104, DW_AT_name("dispatchTable"), DW_AT_symbol_name("_dispatchTable")
     884                            .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     885                            .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     886                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     887                            .dwattr DW$105, DW_AT_name("timerUsed"), DW_AT_symbol_name("_timerUsed")
     888                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     889                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     890                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     891                            .dwattr DW$106, DW_AT_name("timerNum"), DW_AT_symbol_name("_timerNum")
     892                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     893                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
     894                            .dwendtag DW$T$23
     895                    
     896                    
     897                    DW$T$30 .dwtag  DW_TAG_structure_type
     898                            .dwattr DW$T$30, DW_AT_byte_size(0x0c)
     899                    DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
     900                            .dwattr DW$107, DW_AT_name("hTimer"), DW_AT_symbol_name("_hTimer")
     901                            .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902                            .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
     903                    DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     904                            .dwattr DW$108, DW_AT_name("event2IntTbl"), DW_AT_symbol_name("_event2IntTbl")
     905                            .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     906                            .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
     907                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     908                            .dwattr DW$109, DW_AT_name("int2EventTbl"), DW_AT_symbol_name("_int2EventTbl")
     909                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     910                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
     911                            .dwendtag DW$T$30
     912                    
     913                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
     914                            .dwattr DW$T$29, DW_AT_address_class(0x20)
     915                    DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
     916                            .dwattr DW$T$22, DW_AT_address_class(0x20)
     917                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("TIMER_Handle"), DW_AT_type(*DW$T$27)
     918                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     919                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("_IRQ_Dispatch"), DW_AT_type(*DW$T$20)
     920                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     921                    DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
     922                            .dwattr DW$T$27, DW_AT_address_class(0x20)
     923                    
     924                    DW$T$20 .dwtag  DW_TAG_structure_type
     925                            .dwattr DW$T$20, DW_AT_byte_size(0x10)
     926                    DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     927                            .dwattr DW$110, DW_AT_name("funcAddr"), DW_AT_symbol_name("_funcAddr")
     928                            .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                            .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
     930                    DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     931                            .dwattr DW$111, DW_AT_name("ieMask"), DW_AT_symbol_name("_ieMask")
     932                            .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     933                            .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
     934                    DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     935                            .dwattr DW$112, DW_AT_name("ccMask"), DW_AT_symbol_name("_ccMask")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE   18

     936                            .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     937                            .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
     938                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     939                            .dwattr DW$113, DW_AT_name("funcArg"), DW_AT_symbol_name("_funcArg")
     940                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     941                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
     942                            .dwendtag DW$T$20
     943                    
     944                    
     945                    DW$T$26 .dwtag  DW_TAG_structure_type
     946                            .dwattr DW$T$26, DW_AT_byte_size(0x0c)
     947                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     948                            .dwattr DW$114, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     949                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
     951                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     952                            .dwattr DW$115, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
     953                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     954                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
     955                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     956                            .dwattr DW$116, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     957                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     958                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
     959                            .dwendtag DW$T$26
     960                    
     961                    
     962                            .dwattr DW$39, DW_AT_external(0x01)
     963                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     964                    
     965                    ;***************************************************************
     966                    ;* DWARF CIE ENTRIES                                           *
     967                    ;***************************************************************
     968                    
     969                    DW$CIE  .dwcie 1, 126
     970                            .dwcfa  0x0c, 31, 0
     971                            .dwcfa  0x07, 0
     972                            .dwcfa  0x07, 1
     973                            .dwcfa  0x07, 2
     974                            .dwcfa  0x07, 3
     975                            .dwcfa  0x07, 4
     976                            .dwcfa  0x07, 5
     977                            .dwcfa  0x07, 6
     978                            .dwcfa  0x07, 7
     979                            .dwcfa  0x07, 8
     980                            .dwcfa  0x07, 9
     981                            .dwcfa  0x08, 10
     982                            .dwcfa  0x08, 11
     983                            .dwcfa  0x08, 12
     984                            .dwcfa  0x08, 13
     985                            .dwcfa  0x08, 14
     986                            .dwcfa  0x08, 15
     987                            .dwcfa  0x07, 16
     988                            .dwcfa  0x07, 17
     989                            .dwcfa  0x07, 18
     990                            .dwcfa  0x07, 19
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:00 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3642                            PAGE   19

     991                            .dwcfa  0x07, 20
     992                            .dwcfa  0x07, 21
     993                            .dwcfa  0x07, 22
     994                            .dwcfa  0x07, 23
     995                            .dwcfa  0x07, 24
     996                            .dwcfa  0x07, 25
     997                            .dwcfa  0x08, 26
     998                            .dwcfa  0x08, 27
     999                            .dwcfa  0x08, 28
    1000                            .dwcfa  0x08, 29
    1001                            .dwcfa  0x08, 30
    1002                            .dwcfa  0x08, 31
    1003                            .dwcfa  0x08, 32
    1004                            .dwcfa  0x07, 33
    1005                            .dwcfa  0x07, 34
    1006                            .dwcfa  0x07, 35
    1007                            .dwcfa  0x07, 36
    1008                            .dwcfa  0x07, 37
    1009                            .dwcfa  0x07, 38
    1010                            .dwcfa  0x07, 39
    1011                            .dwcfa  0x07, 40
    1012                            .dwcfa  0x07, 41
    1013                            .dwcfa  0x07, 42
    1014                            .dwcfa  0x07, 43
    1015                            .dwcfa  0x07, 44
    1016                            .dwcfa  0x07, 45
    1017                            .dwcfa  0x07, 46
    1018                            .dwcfa  0x07, 47
    1019                            .dwcfa  0x07, 48
    1020                            .dwcfa  0x07, 49
    1021                            .dwcfa  0x07, 50
    1022                            .dwcfa  0x07, 51
    1023                            .dwcfa  0x07, 52
    1024                            .dwcfa  0x07, 53
    1025                            .dwcfa  0x07, 54
