TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 10 14:36:03 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

      73 00000064 00000058-         .field          _EMB_vCapParamsPort+0,32
      74 00000068 00000000          .field          0,16                    ; _EMB_vCapParamsPort._dualChanEnable @ 0
      75 00000068 00000000          .field          0,16
      76 0000006c 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc1Polarity @ 32
      77 00000070 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc2Polarity @ 64
      78 00000074 00000000          .field          0,32                    ; _EMB_vCapParamsPort._vc3Polarity @ 96
      79 00000078 00000000!         .field          _TVP51XX_Fxns,32                ; _EMB_vCapParamsPort._edcTbl[0] @ 128
      80 0000007c FFFFFFFF          .field          -1,32                   ; _EMB_vCapParamsPort._edcTbl[1] @ 160
      81          00000018  IR_2:   .set    24
      82                    
      83 00000080                   .sect   ".cinit"
      84                            .align  8
      85 00000080 00000014          .field          IR_3,32
      86 00000084 00000070-         .field          _EMB_vCapParamsTVP51XX+0,32
      87 00000088 00000001          .field          1,32                    ; _EMB_vCapParamsTVP51XX._videoMode @ 0
      88 0000008c 00000000          .field          0,32                    ; _EMB_vCapParamsTVP51XX._aFmt @ 32
      89 00000090 00000001          .field          1,16                    ; _EMB_vCapParamsTVP51XX._enableBT656Sync @ 64
      90 00000090 00000001          .field          0,16
      91 00000094 00000001          .field          1,32                    ; _EMB_vCapParamsTVP51XX._inputPort @ 96
      92 00000098 FFFFFFFF          .field          -1,32                   ; _EMB_vCapParamsTVP51XX._hI2C @ 128
      93          00000014  IR_3:   .set    20
      94                    
      95                    DW$1    .dwtag  DW_TAG_variable, DW_AT_name("TVP51XX_Fxns"), DW_AT_symbol_name("_TVP51XX_Fxns")
      96                            .dwattr DW$1, DW_AT_type(*DW$T$38)
      97                            .dwattr DW$1, DW_AT_declaration(0x01)
      98                            .dwattr DW$1, DW_AT_external(0x01)
      99                            .global _EMB_vCapParamsChan
     100 00000000           _EMB_vCapParamsChan:    .usect  ".far",88,4
     101                    DW$2    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vCapParamsChan"), DW_AT_symbol_name("_EMB_vCapParamsC
     102                            .dwattr DW$2, DW_AT_location[DW_OP_addr _EMB_vCapParamsChan]
     103                            .dwattr DW$2, DW_AT_type(*DW$T$53)
     104                            .dwattr DW$2, DW_AT_external(0x01)
     105                            .global _EMB_vCapParamsPort
     106 00000058           _EMB_vCapParamsPort:    .usect  ".far",24,4
     107                    DW$3    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vCapParamsPort"), DW_AT_symbol_name("_EMB_vCapParamsP
     108                            .dwattr DW$3, DW_AT_location[DW_OP_addr _EMB_vCapParamsPort]
     109                            .dwattr DW$3, DW_AT_type(*DW$T$54)
     110                            .dwattr DW$3, DW_AT_external(0x01)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    3

     111                            .global _EMB_vCapParamsTVP51XX
     112 00000070           _EMB_vCapParamsTVP51XX: .usect  ".far",20,4
     113                    DW$4    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vCapParamsTVP51XX"), DW_AT_symbol_name("_EMB_vCapPara
     114                            .dwattr DW$4, DW_AT_location[DW_OP_addr _EMB_vCapParamsTVP51XX]
     115                            .dwattr DW$4, DW_AT_type(*DW$T$55)
     116                            .dwattr DW$4, DW_AT_external(0x01)
     117                    ;       C:\CCStudio_v3.1\C6000\cgtools\bin\acp6x.exe -@C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6444 
     118                    ;******************************************************************************
     119                    ;* UNDEFINED EXTERNAL REFERENCES                                              *
     120                    ;******************************************************************************
     121                            .global _TVP51XX_Fxns
     122                    
     123                    ;******************************************************************************
     124                    ;* TYPE INFORMATION                                                           *
     125                    ;******************************************************************************
     126                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$33)
     127                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     128                    DW$T$53 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$37)
     129                            .dwattr DW$T$53, DW_AT_language(DW_LANG_C)
     130                    DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("VPORT_PortParams"), DW_AT_type(*DW$T$41)
     131                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
     132                    DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("TVP51XX_ConfParams"), DW_AT_type(*DW$T$52)
     133                            .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
     134                    
     135                    DW$T$33 .dwtag  DW_TAG_structure_type
     136                            .dwattr DW$T$33, DW_AT_name("EDC_Fxns")
     137                            .dwattr DW$T$33, DW_AT_byte_size(0x0c)
     138                    DW$5    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
     139                            .dwattr DW$5, DW_AT_name("open"), DW_AT_symbol_name("_open")
     140                            .dwattr DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     141                            .dwattr DW$5, DW_AT_accessibility(DW_ACCESS_public)
     142                    DW$6    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
     143                            .dwattr DW$6, DW_AT_name("close"), DW_AT_symbol_name("_close")
     144                            .dwattr DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     145                            .dwattr DW$6, DW_AT_accessibility(DW_ACCESS_public)
     146                    DW$7    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
     147                            .dwattr DW$7, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
     148                            .dwattr DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     149                            .dwattr DW$7, DW_AT_accessibility(DW_ACCESS_public)
     150                            .dwendtag DW$T$33
     151                    
     152                    
     153                    DW$T$37 .dwtag  DW_TAG_structure_type
     154                            .dwattr DW$T$37, DW_AT_byte_size(0x58)
     155                    DW$8    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     156                            .dwattr DW$8, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
     157                            .dwattr DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     158                            .dwattr DW$8, DW_AT_accessibility(DW_ACCESS_public)
     159                    DW$9    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     160                            .dwattr DW$9, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
     161                            .dwattr DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     162                            .dwattr DW$9, DW_AT_accessibility(DW_ACCESS_public)
     163                    DW$10   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     164                            .dwattr DW$10, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
     165                            .dwattr DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    4

     166                            .dwattr DW$10, DW_AT_accessibility(DW_ACCESS_public)
     167                    DW$11   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     168                            .dwattr DW$11, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
     169                            .dwattr DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     170                            .dwattr DW$11, DW_AT_accessibility(DW_ACCESS_public)
     171                    DW$12   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     172                            .dwattr DW$12, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
     173                            .dwattr DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     174                            .dwattr DW$12, DW_AT_accessibility(DW_ACCESS_public)
     175                    DW$13   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     176                            .dwattr DW$13, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
     177                            .dwattr DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     178                            .dwattr DW$13, DW_AT_accessibility(DW_ACCESS_public)
     179                    DW$14   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     180                            .dwattr DW$14, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
     181                            .dwattr DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     182                            .dwattr DW$14, DW_AT_accessibility(DW_ACCESS_public)
     183                    DW$15   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     184                            .dwattr DW$15, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
     185                            .dwattr DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     186                            .dwattr DW$15, DW_AT_accessibility(DW_ACCESS_public)
     187                    DW$16   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     188                            .dwattr DW$16, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
     189                            .dwattr DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     190                            .dwattr DW$16, DW_AT_accessibility(DW_ACCESS_public)
     191                    DW$17   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     192                            .dwattr DW$17, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
     193                            .dwattr DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     194                            .dwattr DW$17, DW_AT_accessibility(DW_ACCESS_public)
     195                    DW$18   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     196                            .dwattr DW$18, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
     197                            .dwattr DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     198                            .dwattr DW$18, DW_AT_accessibility(DW_ACCESS_public)
     199                    DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     200                            .dwattr DW$19, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
     201                            .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     202                            .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
     203                    DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     204                            .dwattr DW$20, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
     205                            .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     206                            .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
     207                    DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     208                            .dwattr DW$21, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
     209                            .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     210                            .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
     211                    DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     212                            .dwattr DW$22, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
     213                            .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     214                            .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     215                    DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     216                            .dwattr DW$23, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
     217                            .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     218                            .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     219                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     220                            .dwattr DW$24, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    5

     221                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     222                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     223                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     224                            .dwattr DW$25, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
     225                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     226                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     227                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     228                            .dwattr DW$26, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
     229                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     230                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     231                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     232                            .dwattr DW$27, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
     233                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     234                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     235                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     236                            .dwattr DW$28, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
     237                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     238                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     239                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     240                            .dwattr DW$29, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
     241                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     242                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     243                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     244                            .dwattr DW$30, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
     245                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     246                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     247                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     248                            .dwattr DW$31, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
     249                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     250                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     251                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     252                            .dwattr DW$32, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
     253                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     254                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     255                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     256                            .dwattr DW$33, DW_AT_name("autoSyncEnable"), DW_AT_symbol_name("_autoSyncEnable")
     257                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     258                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     259                            .dwendtag DW$T$37
     260                    
     261                    
     262                    DW$T$41 .dwtag  DW_TAG_structure_type
     263                            .dwattr DW$T$41, DW_AT_name("VPORT_PortParams")
     264                            .dwattr DW$T$41, DW_AT_byte_size(0x18)
     265                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     266                            .dwattr DW$34, DW_AT_name("dualChanEnable"), DW_AT_symbol_name("_dualChanEnable")
     267                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     268                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     269                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     270                            .dwattr DW$35, DW_AT_name("vc1Polarity"), DW_AT_symbol_name("_vc1Polarity")
     271                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     272                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     273                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     274                            .dwattr DW$36, DW_AT_name("vc2Polarity"), DW_AT_symbol_name("_vc2Polarity")
     275                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    6

     276                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     277                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     278                            .dwattr DW$37, DW_AT_name("vc3Polarity"), DW_AT_symbol_name("_vc3Polarity")
     279                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     280                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     281                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$40)
     282                            .dwattr DW$38, DW_AT_name("edcTbl"), DW_AT_symbol_name("_edcTbl")
     283                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     284                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     285                            .dwendtag DW$T$41
     286                    
     287                    
     288                    DW$T$52 .dwtag  DW_TAG_structure_type
     289                            .dwattr DW$T$52, DW_AT_byte_size(0x14)
     290                    DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
     291                            .dwattr DW$39, DW_AT_name("videoMode"), DW_AT_symbol_name("_videoMode")
     292                            .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     293                            .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     294                    DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
     295                            .dwattr DW$40, DW_AT_name("aFmt"), DW_AT_symbol_name("_aFmt")
     296                            .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     297                            .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     298                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     299                            .dwattr DW$41, DW_AT_name("enableBT656Sync"), DW_AT_symbol_name("_enableBT656Sync")
     300                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     301                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     302                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     303                            .dwattr DW$42, DW_AT_name("inputPort"), DW_AT_symbol_name("_inputPort")
     304                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     305                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     306                    DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
     307                            .dwattr DW$43, DW_AT_name("hI2C"), DW_AT_symbol_name("_hI2C")
     308                            .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     309                            .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     310                            .dwendtag DW$T$52
     311                    
     312                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     313                            .dwattr DW$T$26, DW_AT_address_class(0x20)
     314                    DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
     315                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     316                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$35)
     317                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     318                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     319                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     320                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     321                    DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
     322                            .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     323                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
     324                            .dwattr DW$T$29, DW_AT_address_class(0x20)
     325                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
     326                            .dwattr DW$T$32, DW_AT_address_class(0x20)
     327                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     328                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     329                    
     330                    DW$T$40 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$39)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    7

     331                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     332                            .dwattr DW$T$40, DW_AT_byte_size(0x08)
     333                    DW$44   .dwtag  DW_TAG_subrange_type
     334                            .dwattr DW$44, DW_AT_upper_bound(0x01)
     335                            .dwendtag DW$T$40
     336                    
     337                    DW$T$51 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$50)
     338                            .dwattr DW$T$51, DW_AT_language(DW_LANG_C)
     339                    DW$T$47 .dwtag  DW_TAG_typedef, DW_AT_name("TVP51XX_Mode"), DW_AT_type(*DW$T$46)
     340                            .dwattr DW$T$47, DW_AT_language(DW_LANG_C)
     341                    DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("TVP51XX_AnalogFormat"), DW_AT_type(*DW$T$48)
     342                            .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     343                    
     344                    DW$T$25 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     345                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
     346                    DW$45   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     347                    DW$46   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     348                            .dwendtag DW$T$25
     349                    
     350                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     351                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     352                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     353                    DW$T$35 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
     354                            .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     355                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$23)
     356                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     357                    
     358                    DW$T$28 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
     359                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     360                    DW$47   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     361                            .dwendtag DW$T$28
     362                    
     363                    
     364                    DW$T$31 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$23)
     365                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     366                    DW$48   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     367                    DW$49   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$30)
     368                    DW$50   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     369                            .dwendtag DW$T$31
     370                    
     371                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     372                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     373                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     374                    DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$21)
     375                            .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     376                    DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
     377                            .dwattr DW$T$39, DW_AT_address_class(0x20)
     378                    DW$T$50 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
     379                            .dwattr DW$T$50, DW_AT_address_class(0x20)
     380                    
     381                    DW$T$46 .dwtag  DW_TAG_enumeration_type
     382                            .dwattr DW$T$46, DW_AT_name("TVP51XX_Mode")
     383                            .dwattr DW$T$46, DW_AT_byte_size(0x04)
     384                    DW$51   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_NTSC601"), DW_AT_const_value(0x00)
     385                    DW$52   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_NTSCSqp"), DW_AT_const_value(0x01)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    8

     386                    DW$53   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_PAL601"), DW_AT_const_value(0x02)
     387                    DW$54   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_PALSqp"), DW_AT_const_value(0x03)
     388                    DW$55   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_USER"), DW_AT_const_value(0x04)
     389                            .dwendtag DW$T$46
     390                    
     391                    
     392                    DW$T$48 .dwtag  DW_TAG_enumeration_type
     393                            .dwattr DW$T$48, DW_AT_name("TVP51XX_AnalogFormat")
     394                            .dwattr DW$T$48, DW_AT_byte_size(0x04)
     395                    DW$56   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_COMPOSITE"), DW_AT_const_value(0x00)
     396                    DW$57   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_SVIDEO"), DW_AT_const_value(0x01)
     397                    DW$58   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_RGB"), DW_AT_const_value(0x02)
     398                    DW$59   .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_YPBPR"), DW_AT_const_value(0x03)
     399                            .dwendtag DW$T$48
     400                    
     401                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Handle"), DW_AT_type(*DW$T$3)
     402                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     403                    DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("Ptr"), DW_AT_type(*DW$T$3)
     404                            .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     405                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     406                            .dwattr DW$T$21, DW_AT_address_class(0x20)
     407                    
     408                    DW$T$45 .dwtag  DW_TAG_structure_type
     409                            .dwattr DW$T$45, DW_AT_byte_size(0x14)
     410                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     411                            .dwattr DW$60, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     412                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     413                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     414                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     415                            .dwattr DW$61, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
     416                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     417                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     418                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
     419                            .dwattr DW$62, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     420                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     421                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     422                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     423                            .dwattr DW$63, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
     424                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     425                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     426                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     427                            .dwattr DW$64, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
     428                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     429                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     430                            .dwendtag DW$T$45
     431                    
     432                    DW$T$3  .dwtag  DW_TAG_pointer_type
     433                            .dwattr DW$T$3, DW_AT_address_class(0x20)
     434                    DW$T$42 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
     435                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     436                    DW$T$44 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
     437                            .dwattr DW$T$44, DW_AT_address_class(0x20)
     438                    DW$T$20 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     439                            .dwattr DW$T$20, DW_AT_encoding(DW_ATE_signed_char)
     440                            .dwattr DW$T$20, DW_AT_byte_size(0x01)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:03 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6442                            PAGE    9

     441                    DW$T$43 .dwtag  DW_TAG_volatile_type
     442                            .dwattr DW$T$43, DW_AT_type(*DW$T$42)
     443                    
     444                    
     445                    ;***************************************************************
     446                    ;* DWARF CIE ENTRIES                                           *
     447                    ;***************************************************************
     448                    
     449                    DW$CIE  .dwcie 1, 126
     450                            .dwcfa  0x0c, 31, 0
     451                            .dwcfa  0x07, 0
     452                            .dwcfa  0x07, 1
     453                            .dwcfa  0x07, 2
     454                            .dwcfa  0x07, 3
     455                            .dwcfa  0x07, 4
     456                            .dwcfa  0x07, 5
     457                            .dwcfa  0x07, 6
     458                            .dwcfa  0x07, 7
     459                            .dwcfa  0x07, 8
     460                            .dwcfa  0x07, 9
     461                            .dwcfa  0x07, 10
     462                            .dwcfa  0x07, 11
     463                            .dwcfa  0x07, 12
     464                            .dwcfa  0x07, 13
     465                            .dwcfa  0x07, 14
     466                            .dwcfa  0x07, 15
     467                            .dwcfa  0x07, 16
     468                            .dwcfa  0x07, 17
     469                            .dwcfa  0x07, 18
     470                            .dwcfa  0x07, 19
     471                            .dwcfa  0x07, 20
     472                            .dwcfa  0x07, 21
     473                            .dwcfa  0x07, 22
     474                            .dwcfa  0x07, 23
     475                            .dwcfa  0x07, 24
     476                            .dwcfa  0x07, 25
     477                            .dwcfa  0x07, 26
     478                            .dwcfa  0x07, 27
     479                            .dwcfa  0x07, 28
     480                            .dwcfa  0x07, 29
     481                            .dwcfa  0x07, 30
     482                            .dwcfa  0x07, 31
     483                            .dwcfa  0x07, 32
     484                            .dwcfa  0x07, 33
     485                            .dwcfa  0x07, 34
     486                            .dwcfa  0x07, 35
     487                            .dwcfa  0x07, 36
     488                            .dwcfa  0x07, 37
     489                            .dwcfa  0x07, 38
     490                            .dwcfa  0x07, 39
     491                            .dwcfa  0x07, 40
     492                            .dwcfa  0x07, 41
