TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 10 14:36:04 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

      81 0000006c 00000000          .field          0,16                    ; _EMB_vDisParamsChan._vSyncXStartFld2 @ 800
      82 0000006c 00000000          .field          0,16                    ; _EMB_vDisParamsChan._vSyncYStartFld2 @ 816
      83 00000070 00000000          .field          0,16                    ; _EMB_vDisParamsChan._vSyncXStopFld2 @ 832
      84 00000070 00000000          .field          0,16                    ; _EMB_vDisParamsChan._vSyncYStopFld2 @ 848
      85 00000074 00000010          .field          16,8                    ; _EMB_vDisParamsChan._yClipLow @ 864
      86 00000074 0000F010          .field          240,8                   ; _EMB_vDisParamsChan._yClipHigh @ 872
      87 00000074 0010F010          .field          16,8                    ; _EMB_vDisParamsChan._cClipLow @ 880
      88 00000074 F010F010          .field          240,8                   ; _EMB_vDisParamsChan._cClipHigh @ 888
      89 00000078 00000000          .field          0,8                     ; _EMB_vDisParamsChan._yDefVal @ 896
      90 00000078 00000000          .field          0,8                     ; _EMB_vDisParamsChan._cbDefVal @ 904
      91 00000078 00000000          .field          0,8                     ; _EMB_vDisParamsChan._crDefVal @ 912
      92 00000078 00000000          .field          0,8
      93 0000007c 00000000          .field          0,32                    ; _EMB_vDisParamsChan._rgbX @ 928
      94 00000080 00000001          .field          1,32                    ; _EMB_vDisParamsChan._incPix @ 960
      95 00000084 00000050          .field          80,16                   ; _EMB_vDisParamsChan._thrld @ 992
      96 00000084 00000050          .field          0,16
      97 00000088 80000000          .field          -2147483648,32                  ; _EMB_vDisParamsChan._buf_addr @ 1024
      98 0000008c 00000001          .field          1,32                    ; _EMB_vDisParamsChan._mergeFlds @ 1056
      99 00000090 00000001          .field          1,32                    ; _EMB_vDisParamsChan._edmaPri @ 1088
     100 00000094 00000008          .field          8,32                    ; _EMB_vDisParamsChan._irqId @ 1120
     101          00000090  IR_1:   .set    144
     102                    
     103 00000098                   .sect   ".cinit"
     104                            .align  8
     105 00000098 00000020          .field          IR_2,32
     106 0000009c 00000090-         .field          _EMB_vDisParamsPort+0,32
     107 000000a0 00000000          .field          0,16                    ; _EMB_vDisParamsPort._dualChanEnable @ 0
     108 000000a0 00000000          .field          0,16
     109 000000a4 00000001          .field          1,32                    ; _EMB_vDisParamsPort._vclk1Polarity @ 32
     110 000000a8 00000000          .field          0,32                    ; _EMB_vDisParamsPort._vc1Polarity @ 64
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    3

     111 000000ac 00000000          .field          0,32                    ; _EMB_vDisParamsPort._vc2Polarity @ 96
     112 000000b0 00000000          .field          0,32                    ; _EMB_vDisParamsPort._vc3Polarity @ 128
     113 000000b4 FFFFFFFF          .field          -1,32                   ; _EMB_vDisParamsPort._edcTbl[0] @ 160
     114 000000b8 FFFFFFFF          .field          -1,32                   ; _EMB_vDisParamsPort._edcTbl[1] @ 192
     115 000000bc 00000365          .field          869,32                  ; _EMB_vDisParamsPort._pin_cfg @ 224
     116          00000020  IR_2:   .set    32
     117                    
     118                            .global _EMB_vDisParamsChan
     119 00000000           _EMB_vDisParamsChan:    .usect  ".far",144,4
     120                    DW$1    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vDisParamsChan"), DW_AT_symbol_name("_EMB_vDisParamsC
     121                            .dwattr DW$1, DW_AT_location[DW_OP_addr _EMB_vDisParamsChan]
     122                            .dwattr DW$1, DW_AT_type(*DW$T$44)
     123                            .dwattr DW$1, DW_AT_external(0x01)
     124                            .global _EMB_vDisParamsPort
     125 00000090           _EMB_vDisParamsPort:    .usect  ".far",32,4
     126                    DW$2    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vDisParamsPort"), DW_AT_symbol_name("_EMB_vDisParamsP
     127                            .dwattr DW$2, DW_AT_location[DW_OP_addr _EMB_vDisParamsPort]
     128                            .dwattr DW$2, DW_AT_type(*DW$T$45)
     129                            .dwattr DW$2, DW_AT_external(0x01)
     130                    ;       C:\CCStudio_v3.1\C6000\cgtools\bin\acp6x.exe -@C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6844 
     131                    
     132                    ;******************************************************************************
     133                    ;* TYPE INFORMATION                                                           *
     134                    ;******************************************************************************
     135                    DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTDIS_Params"), DW_AT_type(*DW$T$23)
     136                            .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     137                    DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTDIS_PortParams"), DW_AT_type(*DW$T$43)
     138                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
     139                    
     140                    DW$T$23 .dwtag  DW_TAG_structure_type
     141                            .dwattr DW$T$23, DW_AT_byte_size(0x90)
     142                    DW$3    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     143                            .dwattr DW$3, DW_AT_name("dmode"), DW_AT_symbol_name("_dmode")
     144                            .dwattr DW$3, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     145                            .dwattr DW$3, DW_AT_accessibility(DW_ACCESS_public)
     146                    DW$4    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     147                            .dwattr DW$4, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
     148                            .dwattr DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     149                            .dwattr DW$4, DW_AT_accessibility(DW_ACCESS_public)
     150                    DW$5    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     151                            .dwattr DW$5, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
     152                            .dwattr DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     153                            .dwattr DW$5, DW_AT_accessibility(DW_ACCESS_public)
     154                    DW$6    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     155                            .dwattr DW$6, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
     156                            .dwattr DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     157                            .dwattr DW$6, DW_AT_accessibility(DW_ACCESS_public)
     158                    DW$7    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     159                            .dwattr DW$7, DW_AT_name("defValEn"), DW_AT_symbol_name("_defValEn")
     160                            .dwattr DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     161                            .dwattr DW$7, DW_AT_accessibility(DW_ACCESS_public)
     162                    DW$8    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     163                            .dwattr DW$8, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
     164                            .dwattr DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     165                            .dwattr DW$8, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    4

     166                    DW$9    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     167                            .dwattr DW$9, DW_AT_name("vctl1Config"), DW_AT_symbol_name("_vctl1Config")
     168                            .dwattr DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     169                            .dwattr DW$9, DW_AT_accessibility(DW_ACCESS_public)
     170                    DW$10   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     171                            .dwattr DW$10, DW_AT_name("vctl2Config"), DW_AT_symbol_name("_vctl2Config")
     172                            .dwattr DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     173                            .dwattr DW$10, DW_AT_accessibility(DW_ACCESS_public)
     174                    DW$11   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     175                            .dwattr DW$11, DW_AT_name("vctl3Config"), DW_AT_symbol_name("_vctl3Config")
     176                            .dwattr DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     177                            .dwattr DW$11, DW_AT_accessibility(DW_ACCESS_public)
     178                    DW$12   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     179                            .dwattr DW$12, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
     180                            .dwattr DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     181                            .dwattr DW$12, DW_AT_accessibility(DW_ACCESS_public)
     182                    DW$13   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     183                            .dwattr DW$13, DW_AT_name("frmHSize"), DW_AT_symbol_name("_frmHSize")
     184                            .dwattr DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     185                            .dwattr DW$13, DW_AT_accessibility(DW_ACCESS_public)
     186                    DW$14   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     187                            .dwattr DW$14, DW_AT_name("frmVSize"), DW_AT_symbol_name("_frmVSize")
     188                            .dwattr DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     189                            .dwattr DW$14, DW_AT_accessibility(DW_ACCESS_public)
     190                    DW$15   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     191                            .dwattr DW$15, DW_AT_name("imgHOffsetFld1"), DW_AT_symbol_name("_imgHOffsetFld1")
     192                            .dwattr DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     193                            .dwattr DW$15, DW_AT_accessibility(DW_ACCESS_public)
     194                    DW$16   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     195                            .dwattr DW$16, DW_AT_name("imgVOffsetFld1"), DW_AT_symbol_name("_imgVOffsetFld1")
     196                            .dwattr DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     197                            .dwattr DW$16, DW_AT_accessibility(DW_ACCESS_public)
     198                    DW$17   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     199                            .dwattr DW$17, DW_AT_name("imgHSizeFld1"), DW_AT_symbol_name("_imgHSizeFld1")
     200                            .dwattr DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     201                            .dwattr DW$17, DW_AT_accessibility(DW_ACCESS_public)
     202                    DW$18   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     203                            .dwattr DW$18, DW_AT_name("imgVSizeFld1"), DW_AT_symbol_name("_imgVSizeFld1")
     204                            .dwattr DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     205                            .dwattr DW$18, DW_AT_accessibility(DW_ACCESS_public)
     206                    DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     207                            .dwattr DW$19, DW_AT_name("imgHOffsetFld2"), DW_AT_symbol_name("_imgHOffsetFld2")
     208                            .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     209                            .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
     210                    DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     211                            .dwattr DW$20, DW_AT_name("imgVOffsetFld2"), DW_AT_symbol_name("_imgVOffsetFld2")
     212                            .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     213                            .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
     214                    DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     215                            .dwattr DW$21, DW_AT_name("imgHSizeFld2"), DW_AT_symbol_name("_imgHSizeFld2")
     216                            .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     217                            .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
     218                    DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     219                            .dwattr DW$22, DW_AT_name("imgVSizeFld2"), DW_AT_symbol_name("_imgVSizeFld2")
     220                            .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    5

     221                            .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     222                    DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     223                            .dwattr DW$23, DW_AT_name("hBlnkStart"), DW_AT_symbol_name("_hBlnkStart")
     224                            .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     225                            .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     226                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     227                            .dwattr DW$24, DW_AT_name("hBlnkStop"), DW_AT_symbol_name("_hBlnkStop")
     228                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     229                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     230                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     231                            .dwattr DW$25, DW_AT_name("vBlnkXStartFld1"), DW_AT_symbol_name("_vBlnkXStartFld1")
     232                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     233                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     234                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     235                            .dwattr DW$26, DW_AT_name("vBlnkYStartFld1"), DW_AT_symbol_name("_vBlnkYStartFld1")
     236                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     237                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     238                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     239                            .dwattr DW$27, DW_AT_name("vBlnkXStopFld1"), DW_AT_symbol_name("_vBlnkXStopFld1")
     240                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     241                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     242                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     243                            .dwattr DW$28, DW_AT_name("vBlnkYStopFld1"), DW_AT_symbol_name("_vBlnkYStopFld1")
     244                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     245                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     246                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     247                            .dwattr DW$29, DW_AT_name("vBlnkXStartFld2"), DW_AT_symbol_name("_vBlnkXStartFld2")
     248                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     249                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     250                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     251                            .dwattr DW$30, DW_AT_name("vBlnkYStartFld2"), DW_AT_symbol_name("_vBlnkYStartFld2")
     252                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     253                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     254                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     255                            .dwattr DW$31, DW_AT_name("vBlnkXStopFld2"), DW_AT_symbol_name("_vBlnkXStopFld2")
     256                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     257                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     258                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     259                            .dwattr DW$32, DW_AT_name("vBlnkYStopFld2"), DW_AT_symbol_name("_vBlnkYStopFld2")
     260                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     261                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     262                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     263                            .dwattr DW$33, DW_AT_name("xStartFld1"), DW_AT_symbol_name("_xStartFld1")
     264                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     265                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     266                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     267                            .dwattr DW$34, DW_AT_name("yStartFld1"), DW_AT_symbol_name("_yStartFld1")
     268                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
     269                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     270                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     271                            .dwattr DW$35, DW_AT_name("xStartFld2"), DW_AT_symbol_name("_xStartFld2")
     272                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     273                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     274                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     275                            .dwattr DW$36, DW_AT_name("yStartFld2"), DW_AT_symbol_name("_yStartFld2")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    6

     276                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
     277                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     278                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     279                            .dwattr DW$37, DW_AT_name("hSyncStart"), DW_AT_symbol_name("_hSyncStart")
     280                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     281                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     282                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     283                            .dwattr DW$38, DW_AT_name("hSyncStop"), DW_AT_symbol_name("_hSyncStop")
     284                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     285                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     286                    DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     287                            .dwattr DW$39, DW_AT_name("vSyncXStartFld1"), DW_AT_symbol_name("_vSyncXStartFld1")
     288                            .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     289                            .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     290                    DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     291                            .dwattr DW$40, DW_AT_name("vSyncYStartFld1"), DW_AT_symbol_name("_vSyncYStartFld1")
     292                            .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     293                            .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     294                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     295                            .dwattr DW$41, DW_AT_name("vSyncXStopFld1"), DW_AT_symbol_name("_vSyncXStopFld1")
     296                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     297                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     298                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     299                            .dwattr DW$42, DW_AT_name("vSyncYStopFld1"), DW_AT_symbol_name("_vSyncYStopFld1")
     300                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
     301                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     302                    DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     303                            .dwattr DW$43, DW_AT_name("vSyncXStartFld2"), DW_AT_symbol_name("_vSyncXStartFld2")
     304                            .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     305                            .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     306                    DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     307                            .dwattr DW$44, DW_AT_name("vSyncYStartFld2"), DW_AT_symbol_name("_vSyncYStartFld2")
     308                            .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
     309                            .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     310                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     311                            .dwattr DW$45, DW_AT_name("vSyncXStopFld2"), DW_AT_symbol_name("_vSyncXStopFld2")
     312                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     313                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     314                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     315                            .dwattr DW$46, DW_AT_name("vSyncYStopFld2"), DW_AT_symbol_name("_vSyncYStopFld2")
     316                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
     317                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     318                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     319                            .dwattr DW$47, DW_AT_name("yClipLow"), DW_AT_symbol_name("_yClipLow")
     320                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
     321                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     322                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     323                            .dwattr DW$48, DW_AT_name("yClipHigh"), DW_AT_symbol_name("_yClipHigh")
     324                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
     325                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     326                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     327                            .dwattr DW$49, DW_AT_name("cClipLow"), DW_AT_symbol_name("_cClipLow")
     328                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
     329                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     330                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    7

     331                            .dwattr DW$50, DW_AT_name("cClipHigh"), DW_AT_symbol_name("_cClipHigh")
     332                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x6f]
     333                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     334                    DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     335                            .dwattr DW$51, DW_AT_name("yDefVal"), DW_AT_symbol_name("_yDefVal")
     336                            .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
     337                            .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     338                    DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     339                            .dwattr DW$52, DW_AT_name("cbDefVal"), DW_AT_symbol_name("_cbDefVal")
     340                            .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
     341                            .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     342                    DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     343                            .dwattr DW$53, DW_AT_name("crDefVal"), DW_AT_symbol_name("_crDefVal")
     344                            .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     345                            .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     346                    DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     347                            .dwattr DW$54, DW_AT_name("rgbX"), DW_AT_symbol_name("_rgbX")
     348                            .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     349                            .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     350                    DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     351                            .dwattr DW$55, DW_AT_name("incPix"), DW_AT_symbol_name("_incPix")
     352                            .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     353                            .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     354                    DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     355                            .dwattr DW$56, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
     356                            .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     357                            .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     358                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     359                            .dwattr DW$57, DW_AT_name("buf_addr"), DW_AT_symbol_name("_buf_addr")
     360                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     361                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     362                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     363                            .dwattr DW$58, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
     364                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
     365                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     366                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     367                            .dwattr DW$59, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
     368                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
     369                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     370                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     371                            .dwattr DW$60, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
     372                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
     373                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     374                            .dwendtag DW$T$23
     375                    
     376                    
     377                    DW$T$43 .dwtag  DW_TAG_structure_type
     378                            .dwattr DW$T$43, DW_AT_name("VPORTDIS_PortParams")
     379                            .dwattr DW$T$43, DW_AT_byte_size(0x20)
     380                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
     381                            .dwattr DW$61, DW_AT_name("dualChanEnable"), DW_AT_symbol_name("_dualChanEnable")
     382                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     383                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     384                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     385                            .dwattr DW$62, DW_AT_name("vclk1Polarity"), DW_AT_symbol_name("_vclk1Polarity")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    8

     386                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     387                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     388                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     389                            .dwattr DW$63, DW_AT_name("vc1Polarity"), DW_AT_symbol_name("_vc1Polarity")
     390                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     391                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     392                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     393                            .dwattr DW$64, DW_AT_name("vc2Polarity"), DW_AT_symbol_name("_vc2Polarity")
     394                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     395                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     396                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     397                            .dwattr DW$65, DW_AT_name("vc3Polarity"), DW_AT_symbol_name("_vc3Polarity")
     398                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     399                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     400                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     401                            .dwattr DW$66, DW_AT_name("edcTbl"), DW_AT_symbol_name("_edcTbl")
     402                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     403                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     404                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     405                            .dwattr DW$67, DW_AT_name("pin_cfg"), DW_AT_symbol_name("_pin_cfg")
     406                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     407                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     408                            .dwendtag DW$T$43
     409                    
     410                    DW$T$3  .dwtag  DW_TAG_pointer_type
     411                            .dwattr DW$T$3, DW_AT_address_class(0x20)
     412                    DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
     413                            .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     414                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("Int16"), DW_AT_type(*DW$T$8)
     415                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     416                    DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
     417                            .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     418                    DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$38)
     419                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     420                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     421                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     422                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     423                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
     424                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     425                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     426                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     427                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     428                    DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     429                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     430                    
     431                    DW$T$42 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$41)
     432                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     433                            .dwattr DW$T$42, DW_AT_byte_size(0x08)
     434                    DW$68   .dwtag  DW_TAG_subrange_type
     435                            .dwattr DW$68, DW_AT_upper_bound(0x01)
     436                            .dwendtag DW$T$42
     437                    
     438                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     439                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     440                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE    9

     441                    DW$T$8  .dwtag  DW_TAG_base_type, DW_AT_name("short")
     442                            .dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
     443                            .dwattr DW$T$8, DW_AT_byte_size(0x02)
     444                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     445                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     446                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     447                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
     448                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     449                    DW$T$41 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
     450                            .dwattr DW$T$41, DW_AT_address_class(0x20)
     451                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$37)
     452                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     453                    
     454                    DW$T$37 .dwtag  DW_TAG_structure_type
     455                            .dwattr DW$T$37, DW_AT_name("EDC_Fxns")
     456                            .dwattr DW$T$37, DW_AT_byte_size(0x0c)
     457                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     458                            .dwattr DW$69, DW_AT_name("open"), DW_AT_symbol_name("_open")
     459                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     460                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     461                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
     462                            .dwattr DW$70, DW_AT_name("close"), DW_AT_symbol_name("_close")
     463                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     464                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     465                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     466                            .dwattr DW$71, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
     467                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     468                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     469                            .dwendtag DW$T$37
     470                    
     471                    DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     472                            .dwattr DW$T$30, DW_AT_address_class(0x20)
     473                    DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     474                            .dwattr DW$T$33, DW_AT_address_class(0x20)
     475                    DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     476                            .dwattr DW$T$36, DW_AT_address_class(0x20)
     477                    
     478                    DW$T$29 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
     479                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     480                    DW$72   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     481                    DW$73   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     482                            .dwendtag DW$T$29
     483                    
     484                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$19)
     485                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     486                    
     487                    DW$T$32 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     488                            .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
     489                    DW$74   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
     490                            .dwendtag DW$T$32
     491                    
     492                    
     493                    DW$T$35 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     494                            .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     495                    DW$75   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:04 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI6842                            PAGE   10

     496                    DW$76   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
     497                    DW$77   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     498                            .dwendtag DW$T$35
     499                    
     500                    DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$26)
     501                            .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     502                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Handle"), DW_AT_type(*DW$T$3)
     503                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     504                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("Ptr"), DW_AT_type(*DW$T$3)
     505                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     506                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     507                            .dwattr DW$T$26, DW_AT_address_class(0x20)
     508                    DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     509                            .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     510                            .dwattr DW$T$25, DW_AT_byte_size(0x01)
     511                    
     512                    
     513                    ;***************************************************************
     514                    ;* DWARF CIE ENTRIES                                           *
     515                    ;***************************************************************
     516                    
     517                    DW$CIE  .dwcie 1, 126
     518                            .dwcfa  0x0c, 31, 0
     519                            .dwcfa  0x07, 0
