TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 10 14:36:06 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

         00000007 00000050 
         00000008 0000004C 
         00000009 00000041 
         0000000a 00000059 
         0000000b 00000000 
     197                    ;******************************************************************************
     198                    ;* UNDEFINED EXTERNAL REFERENCES                                              *
     199                    ;******************************************************************************
     200                            .global _GIO_control
     201                            .global _GIO_create
     202                            .global _EMB_vDisParamsChan
     203                    
     204                    ;******************************************************************************
     205                    ;* TYPE INFORMATION                                                           *
     206                    ;******************************************************************************
     207                    DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("Ptr"), DW_AT_type(*DW$T$3)
     208                            .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     209                    
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE    5

     210                    DW$T$63 .dwtag  DW_TAG_subroutine_type
     211                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
     212                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     213                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     214                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     215                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
     216                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     217                    
     218                    DW$T$66 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
     219                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
     220                    DW$16   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$65)
     221                    DW$17   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
     222                    DW$18   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     223                            .dwendtag DW$T$66
     224                    
     225                    DW$T$68 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
     226                            .dwattr DW$T$68, DW_AT_address_class(0x20)
     227                    DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     228                            .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     229                    DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$38)
     230                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     231                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_Handle"), DW_AT_type(*DW$T$64)
     232                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
     233                    
     234                    DW$T$72 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$65)
     235                            .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
     236                    DW$19   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
     237                    DW$20   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     238                    DW$21   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$68)
     239                    DW$22   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     240                    DW$23   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$71)
     241                            .dwendtag DW$T$72
     242                    
     243                    DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Handle"), DW_AT_type(*DW$T$65)
     244                            .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
     245                    DW$T$71 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$70)
     246                            .dwattr DW$T$71, DW_AT_address_class(0x20)
     247                    DW$T$75 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTDIS_Params"), DW_AT_type(*DW$T$62)
     248                            .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
     249                    DW$T$3  .dwtag  DW_TAG_pointer_type
     250                            .dwattr DW$T$3, DW_AT_address_class(0x20)
     251                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     252                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     253                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     254                    DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
     255                            .dwattr DW$T$38, DW_AT_address_class(0x20)
     256                    DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
     257                            .dwattr DW$T$64, DW_AT_address_class(0x20)
     258                    DW$T$70 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_Attrs"), DW_AT_type(*DW$T$58)
     259                            .dwattr DW$T$70, DW_AT_language(DW_LANG_C)
     260                    
     261                    DW$T$62 .dwtag  DW_TAG_structure_type
     262                            .dwattr DW$T$62, DW_AT_byte_size(0x90)
     263                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     264                            .dwattr DW$24, DW_AT_name("dmode"), DW_AT_symbol_name("_dmode")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE    6

     265                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     266                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     267                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     268                            .dwattr DW$25, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
     269                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     270                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     271                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     272                            .dwattr DW$26, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
     273                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     274                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     275                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     276                            .dwattr DW$27, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
     277                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     278                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     279                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     280                            .dwattr DW$28, DW_AT_name("defValEn"), DW_AT_symbol_name("_defValEn")
     281                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     282                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     283                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     284                            .dwattr DW$29, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
     285                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     286                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     287                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     288                            .dwattr DW$30, DW_AT_name("vctl1Config"), DW_AT_symbol_name("_vctl1Config")
     289                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     290                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     291                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     292                            .dwattr DW$31, DW_AT_name("vctl2Config"), DW_AT_symbol_name("_vctl2Config")
     293                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     294                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     295                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     296                            .dwattr DW$32, DW_AT_name("vctl3Config"), DW_AT_symbol_name("_vctl3Config")
     297                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     298                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     299                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     300                            .dwattr DW$33, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
     301                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     302                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     303                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     304                            .dwattr DW$34, DW_AT_name("frmHSize"), DW_AT_symbol_name("_frmHSize")
     305                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     306                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     307                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     308                            .dwattr DW$35, DW_AT_name("frmVSize"), DW_AT_symbol_name("_frmVSize")
     309                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     310                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     311                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
     312                            .dwattr DW$36, DW_AT_name("imgHOffsetFld1"), DW_AT_symbol_name("_imgHOffsetFld1")
     313                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     314                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     315                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
     316                            .dwattr DW$37, DW_AT_name("imgVOffsetFld1"), DW_AT_symbol_name("_imgVOffsetFld1")
     317                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     318                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     319                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE    7

     320                            .dwattr DW$38, DW_AT_name("imgHSizeFld1"), DW_AT_symbol_name("_imgHSizeFld1")
     321                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     322                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     323                    DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     324                            .dwattr DW$39, DW_AT_name("imgVSizeFld1"), DW_AT_symbol_name("_imgVSizeFld1")
     325                            .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     326                            .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     327                    DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
     328                            .dwattr DW$40, DW_AT_name("imgHOffsetFld2"), DW_AT_symbol_name("_imgHOffsetFld2")
     329                            .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     330                            .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     331                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
     332                            .dwattr DW$41, DW_AT_name("imgVOffsetFld2"), DW_AT_symbol_name("_imgVOffsetFld2")
     333                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     334                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     335                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     336                            .dwattr DW$42, DW_AT_name("imgHSizeFld2"), DW_AT_symbol_name("_imgHSizeFld2")
     337                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     338                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     339                    DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     340                            .dwattr DW$43, DW_AT_name("imgVSizeFld2"), DW_AT_symbol_name("_imgVSizeFld2")
     341                            .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     342                            .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     343                    DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     344                            .dwattr DW$44, DW_AT_name("hBlnkStart"), DW_AT_symbol_name("_hBlnkStart")
     345                            .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     346                            .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     347                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     348                            .dwattr DW$45, DW_AT_name("hBlnkStop"), DW_AT_symbol_name("_hBlnkStop")
     349                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     350                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     351                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     352                            .dwattr DW$46, DW_AT_name("vBlnkXStartFld1"), DW_AT_symbol_name("_vBlnkXStartFld1")
     353                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     354                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
     355                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     356                            .dwattr DW$47, DW_AT_name("vBlnkYStartFld1"), DW_AT_symbol_name("_vBlnkYStartFld1")
     357                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     358                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     359                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     360                            .dwattr DW$48, DW_AT_name("vBlnkXStopFld1"), DW_AT_symbol_name("_vBlnkXStopFld1")
     361                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     362                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     363                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     364                            .dwattr DW$49, DW_AT_name("vBlnkYStopFld1"), DW_AT_symbol_name("_vBlnkYStopFld1")
     365                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     366                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     367                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     368                            .dwattr DW$50, DW_AT_name("vBlnkXStartFld2"), DW_AT_symbol_name("_vBlnkXStartFld2")
     369                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     370                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     371                    DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     372                            .dwattr DW$51, DW_AT_name("vBlnkYStartFld2"), DW_AT_symbol_name("_vBlnkYStartFld2")
     373                            .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     374                            .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE    8

     375                    DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     376                            .dwattr DW$52, DW_AT_name("vBlnkXStopFld2"), DW_AT_symbol_name("_vBlnkXStopFld2")
     377                            .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     378                            .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     379                    DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     380                            .dwattr DW$53, DW_AT_name("vBlnkYStopFld2"), DW_AT_symbol_name("_vBlnkYStopFld2")
     381                            .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     382                            .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     383                    DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     384                            .dwattr DW$54, DW_AT_name("xStartFld1"), DW_AT_symbol_name("_xStartFld1")
     385                            .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     386                            .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     387                    DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     388                            .dwattr DW$55, DW_AT_name("yStartFld1"), DW_AT_symbol_name("_yStartFld1")
     389                            .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
     390                            .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     391                    DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     392                            .dwattr DW$56, DW_AT_name("xStartFld2"), DW_AT_symbol_name("_xStartFld2")
     393                            .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     394                            .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     395                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     396                            .dwattr DW$57, DW_AT_name("yStartFld2"), DW_AT_symbol_name("_yStartFld2")
     397                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
     398                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     399                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     400                            .dwattr DW$58, DW_AT_name("hSyncStart"), DW_AT_symbol_name("_hSyncStart")
     401                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     402                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     403                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     404                            .dwattr DW$59, DW_AT_name("hSyncStop"), DW_AT_symbol_name("_hSyncStop")
     405                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     406                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     407                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     408                            .dwattr DW$60, DW_AT_name("vSyncXStartFld1"), DW_AT_symbol_name("_vSyncXStartFld1")
     409                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     410                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     411                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     412                            .dwattr DW$61, DW_AT_name("vSyncYStartFld1"), DW_AT_symbol_name("_vSyncYStartFld1")
     413                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     414                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     415                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     416                            .dwattr DW$62, DW_AT_name("vSyncXStopFld1"), DW_AT_symbol_name("_vSyncXStopFld1")
     417                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     418                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     419                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     420                            .dwattr DW$63, DW_AT_name("vSyncYStopFld1"), DW_AT_symbol_name("_vSyncYStopFld1")
     421                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
     422                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     423                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     424                            .dwattr DW$64, DW_AT_name("vSyncXStartFld2"), DW_AT_symbol_name("_vSyncXStartFld2")
     425                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     426                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     427                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     428                            .dwattr DW$65, DW_AT_name("vSyncYStartFld2"), DW_AT_symbol_name("_vSyncYStartFld2")
     429                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE    9

     430                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     431                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     432                            .dwattr DW$66, DW_AT_name("vSyncXStopFld2"), DW_AT_symbol_name("_vSyncXStopFld2")
     433                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     434                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     435                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     436                            .dwattr DW$67, DW_AT_name("vSyncYStopFld2"), DW_AT_symbol_name("_vSyncYStopFld2")
     437                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
     438                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     439                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     440                            .dwattr DW$68, DW_AT_name("yClipLow"), DW_AT_symbol_name("_yClipLow")
     441                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
     442                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     443                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     444                            .dwattr DW$69, DW_AT_name("yClipHigh"), DW_AT_symbol_name("_yClipHigh")
     445                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
     446                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
     447                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     448                            .dwattr DW$70, DW_AT_name("cClipLow"), DW_AT_symbol_name("_cClipLow")
     449                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
     450                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     451                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     452                            .dwattr DW$71, DW_AT_name("cClipHigh"), DW_AT_symbol_name("_cClipHigh")
     453                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x6f]
     454                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     455                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     456                            .dwattr DW$72, DW_AT_name("yDefVal"), DW_AT_symbol_name("_yDefVal")
     457                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
     458                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     459                    DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     460                            .dwattr DW$73, DW_AT_name("cbDefVal"), DW_AT_symbol_name("_cbDefVal")
     461                            .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
     462                            .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
     463                    DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
     464                            .dwattr DW$74, DW_AT_name("crDefVal"), DW_AT_symbol_name("_crDefVal")
     465                            .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     466                            .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
     467                    DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     468                            .dwattr DW$75, DW_AT_name("rgbX"), DW_AT_symbol_name("_rgbX")
     469                            .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     470                            .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
     471                    DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     472                            .dwattr DW$76, DW_AT_name("incPix"), DW_AT_symbol_name("_incPix")
     473                            .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     474                            .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
     475                    DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
     476                            .dwattr DW$77, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
     477                            .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     478                            .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
     479                    DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     480                            .dwattr DW$78, DW_AT_name("buf_addr"), DW_AT_symbol_name("_buf_addr")
     481                            .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     482                            .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
     483                    DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     484                            .dwattr DW$79, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE   10

     485                            .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
     486                            .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
     487                    DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     488                            .dwattr DW$80, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
     489                            .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
     490                            .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
     491                    DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     492                            .dwattr DW$81, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
     493                            .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
     494                            .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
     495                            .dwendtag DW$T$62
     496                    
     497                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
     498                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
     499                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("Int16"), DW_AT_type(*DW$T$8)
     500                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
     501                    DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
     502                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
     503                    DW$T$37 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     504                            .dwattr DW$T$37, DW_AT_encoding(DW_ATE_signed_char)
     505                            .dwattr DW$T$37, DW_AT_byte_size(0x01)
     506                    
     507                    DW$T$57 .dwtag  DW_TAG_structure_type
     508                            .dwattr DW$T$57, DW_AT_name("GIO_Obj")
     509                            .dwattr DW$T$57, DW_AT_byte_size(0x3c)
     510                    DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
     511                            .dwattr DW$82, DW_AT_name("fxns"), DW_AT_symbol_name("_fxns")
     512                            .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     513                            .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
     514                    DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     515                            .dwattr DW$83, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
     516                            .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     517                            .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
     518                    DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     519                            .dwattr DW$84, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
     520                            .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     521                            .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
     522                    DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
     523                            .dwattr DW$85, DW_AT_name("syncPacket"), DW_AT_symbol_name("_syncPacket")
     524                            .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     525                            .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
     526                    DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
     527                            .dwattr DW$86, DW_AT_name("freeList"), DW_AT_symbol_name("_freeList")
     528                            .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     529                            .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
     530                    DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     531                            .dwattr DW$87, DW_AT_name("syncObj"), DW_AT_symbol_name("_syncObj")
     532                            .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     533                            .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
     534                    DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     535                            .dwattr DW$88, DW_AT_name("mdChan"), DW_AT_symbol_name("_mdChan")
     536                            .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     537                            .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
     538                            .dwendtag DW$T$57
     539                    
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE   11

     540                    
     541                    DW$T$58 .dwtag  DW_TAG_structure_type
     542                            .dwattr DW$T$58, DW_AT_name("GIO_Attrs")
     543                            .dwattr DW$T$58, DW_AT_byte_size(0x08)
     544                    DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     545                            .dwattr DW$89, DW_AT_name("nPackets"), DW_AT_symbol_name("_nPackets")
     546                            .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     547                            .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
     548                    DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     549                            .dwattr DW$90, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
     550                            .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     551                            .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
     552                            .dwendtag DW$T$58
     553                    
     554                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     555                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     556                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
     557                    DW$T$8  .dwtag  DW_TAG_base_type, DW_AT_name("short")
     558                            .dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
     559                            .dwattr DW$T$8, DW_AT_byte_size(0x02)
     560                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     561                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     562                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     563                    DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
     564                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
     565                    DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$40)
     566                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     567                    DW$T$55 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$54)
     568                            .dwattr DW$T$55, DW_AT_address_class(0x20)
     569                    
     570                    DW$T$20 .dwtag  DW_TAG_structure_type
     571                            .dwattr DW$T$20, DW_AT_name("QUE_Elem")
     572                            .dwattr DW$T$20, DW_AT_byte_size(0x08)
     573                    DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     574                            .dwattr DW$91, DW_AT_name("next"), DW_AT_symbol_name("_next")
     575                            .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576                            .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
     577                    DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     578                            .dwattr DW$92, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
     579                            .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     580                            .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
     581                            .dwendtag DW$T$20
     582                    
     583                    DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     584                            .dwattr DW$T$19, DW_AT_address_class(0x20)
     585                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$26)
     586                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     587                    DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$53)
     588                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
     589                    
     590                    DW$T$26 .dwtag  DW_TAG_structure_type
     591                            .dwattr DW$T$26, DW_AT_name("DEV_Frame")
     592                            .dwattr DW$T$26, DW_AT_byte_size(0x20)
     593                    DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     594                            .dwattr DW$93, DW_AT_name("link"), DW_AT_symbol_name("_link")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE   12

     595                            .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                            .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
     597                    DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     598                            .dwattr DW$94, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
     599                            .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     600                            .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
     601                    DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     602                            .dwattr DW$95, DW_AT_name("size"), DW_AT_symbol_name("_size")
     603                            .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     604                            .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
     605                    DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     606                            .dwattr DW$96, DW_AT_name("misc"), DW_AT_symbol_name("_misc")
     607                            .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     608                            .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
     609                    DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
     610                            .dwattr DW$97, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
     611                            .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     612                            .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
     613                    DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
     614                            .dwattr DW$98, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
     615                            .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     616                            .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
     617                    DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
     618                            .dwattr DW$99, DW_AT_name("status"), DW_AT_symbol_name("_status")
     619                            .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     620                            .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
     621                            .dwendtag DW$T$26
     622                    
     623                    
     624                    DW$T$53 .dwtag  DW_TAG_structure_type
     625                            .dwattr DW$T$53, DW_AT_name("IOM_Fxns")
     626                            .dwattr DW$T$53, DW_AT_byte_size(0x18)
     627                    DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     628                            .dwattr DW$100, DW_AT_name("mdBindDev"), DW_AT_symbol_name("_mdBindDev")
     629                            .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                            .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
     631                    DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
     632                            .dwattr DW$101, DW_AT_name("mdUnBindDev"), DW_AT_symbol_name("_mdUnBindDev")
     633                            .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     634                            .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
     635                    DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     636                            .dwattr DW$102, DW_AT_name("mdControlChan"), DW_AT_symbol_name("_mdControlChan")
     637                            .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     638                            .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
     639                    DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
     640                            .dwattr DW$103, DW_AT_name("mdCreateChan"), DW_AT_symbol_name("_mdCreateChan")
     641                            .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     642                            .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
     643                    DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
     644                            .dwattr DW$104, DW_AT_name("mdDeleteChan"), DW_AT_symbol_name("_mdDeleteChan")
     645                            .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     646                            .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
     647                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
     648                            .dwattr DW$105, DW_AT_name("mdSubmitChan"), DW_AT_symbol_name("_mdSubmitChan")
     649                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:06 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI7202                            PAGE   13

     650                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
     651                            .dwendtag DW$T$53
     652                    
     653                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$24)
     654                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
     655                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdBindDev"), DW_AT_type(*DW$T$29)
     656                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
     657                    DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdUnBindDev"), DW_AT_type(*DW$T$32)
     658                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
     659                    DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdDeleteChan"), DW_AT_type(*DW$T$32)
     660                            .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
     661                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdControlChan"), DW_AT_type(*DW$T$35)
     662                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
     663                    DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdCreateChan"), DW_AT_type(*DW$T$47)
     664                            .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
     665                    DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdSubmitChan"), DW_AT_type(*DW$T$51)
     666                            .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
     667                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
     668                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     669                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
     670                            .dwattr DW$T$29, DW_AT_address_class(0x20)
     671                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
     672                            .dwattr DW$T$32, DW_AT_address_class(0x20)
     673                    DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
     674                            .dwattr DW$T$35, DW_AT_address_class(0x20)
     675                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
     676                            .dwattr DW$T$47, DW_AT_address_class(0x20)
     677                    DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
     678                            .dwattr DW$T$51, DW_AT_address_class(0x20)
     679                    
     680                    DW$T$28 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
     681                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     682                    DW$106  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     683                    DW$107  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     684                    DW$108  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     685                            .dwendtag DW$T$28
     686                    
     687                    
     688                    DW$T$31 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
     689                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     690                    DW$109  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     691                            .dwendtag DW$T$31
     692                    
     693                    
     694                    DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
     695                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     696                    DW$110  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
