TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Thu Mar 10 14:36:05 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    1411                    DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    1412                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1413                    DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
    1414                            .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1415                            .dwattr DW$T$13, DW_AT_byte_size(0x08)
    1416                            .dwattr DW$T$13, DW_AT_bit_size(0x28)
    1417                            .dwattr DW$T$13, DW_AT_bit_offset(0x18)
    1418                    DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    1419                            .dwattr DW$T$38, DW_AT_address_class(0x20)
    1420                    DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$38)
    1421                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    1422                    DW$T$119        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$118)
    1423                            .dwattr DW$T$119, DW_AT_address_class(0x20)
    1424                    DW$T$109        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_Handle"), DW_AT_type(*DW$T$108)
    1425                            .dwattr DW$T$109, DW_AT_language(DW_LANG_C)
    1426                    
    1427                    DW$T$140        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$109)
    1428                            .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    1429                    DW$145  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
    1430                    DW$146  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    1431                    DW$147  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$112)
    1432                    DW$148  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1433                    DW$149  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$139)
    1434                            .dwendtag DW$T$140
    1435                    
    1436                    DW$T$142        .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Handle"), DW_AT_type(*DW$T$109)
    1437                            .dwattr DW$T$142, DW_AT_language(DW_LANG_C)
    1438                    DW$T$139        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$138)
    1439                            .dwattr DW$T$139, DW_AT_address_class(0x20)
    1440                    DW$T$115        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$114)
    1441                            .dwattr DW$T$115, DW_AT_address_class(0x20)
    1442                    DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$75)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   29

    1443                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    1444                    DW$T$143        .dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$70)
    1445                            .dwattr DW$T$143, DW_AT_language(DW_LANG_C)
    1446                    DW$T$145        .dwtag  DW_TAG_typedef, DW_AT_name("TVP51XX_ConfParams"), DW_AT_type(*DW$T$77)
    1447                            .dwattr DW$T$145, DW_AT_language(DW_LANG_C)
    1448                    DW$T$148        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$147)
    1449                            .dwattr DW$T$148, DW_AT_address_class(0x20)
    1450                    DW$T$91 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$90)
    1451                            .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    1452                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1453                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1454                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1455                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    1456                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1457                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    1458                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1459                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1460                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    1461                    DW$T$37 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1462                            .dwattr DW$T$37, DW_AT_encoding(DW_ATE_signed_char)
    1463                            .dwattr DW$T$37, DW_AT_byte_size(0x01)
    1464                    DW$T$118        .dwtag  DW_TAG_const_type
    1465                            .dwattr DW$T$118, DW_AT_type(*DW$T$37)
    1466                    DW$T$108        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
    1467                            .dwattr DW$T$108, DW_AT_address_class(0x20)
    1468                    DW$T$138        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_Attrs"), DW_AT_type(*DW$T$58)
    1469                            .dwattr DW$T$138, DW_AT_language(DW_LANG_C)
    1470                    DW$T$114        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_AppCallback"), DW_AT_type(*DW$T$62)
    1471                            .dwattr DW$T$114, DW_AT_language(DW_LANG_C)
    1472                    DW$T$75 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$66)
    1473                            .dwattr DW$T$75, DW_AT_address_class(0x20)
    1474                    
    1475                    DW$T$70 .dwtag  DW_TAG_structure_type
    1476                            .dwattr DW$T$70, DW_AT_byte_size(0x58)
    1477                    DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1478                            .dwattr DW$150, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
    1479                            .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1480                            .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1481                    DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1482                            .dwattr DW$151, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
    1483                            .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1484                            .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1485                    DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1486                            .dwattr DW$152, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
    1487                            .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1488                            .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1489                    DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1490                            .dwattr DW$153, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
    1491                            .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1492                            .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1493                    DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1494                            .dwattr DW$154, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
    1495                            .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1496                            .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1497                    DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   30

    1498                            .dwattr DW$155, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
    1499                            .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1500                            .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1501                    DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1502                            .dwattr DW$156, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
    1503                            .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1504                            .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1505                    DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1506                            .dwattr DW$157, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
    1507                            .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1508                            .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1509                    DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1510                            .dwattr DW$158, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
    1511                            .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1512                            .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1513                    DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1514                            .dwattr DW$159, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
    1515                            .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1516                            .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1517                    DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1518                            .dwattr DW$160, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
    1519                            .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1520                            .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1521                    DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1522                            .dwattr DW$161, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
    1523                            .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1524                            .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1525                    DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1526                            .dwattr DW$162, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
    1527                            .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1528                            .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1529                    DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1530                            .dwattr DW$163, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
    1531                            .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1532                            .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1533                    DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1534                            .dwattr DW$164, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
    1535                            .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1536                            .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1537                    DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1538                            .dwattr DW$165, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
    1539                            .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1540                            .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1541                    DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1542                            .dwattr DW$166, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
    1543                            .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1544                            .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1545                    DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1546                            .dwattr DW$167, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
    1547                            .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1548                            .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1549                    DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1550                            .dwattr DW$168, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
    1551                            .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1552                            .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   31

    1553                    DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1554                            .dwattr DW$169, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
    1555                            .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1556                            .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1557                    DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1558                            .dwattr DW$170, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
    1559                            .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1560                            .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1561                    DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1562                            .dwattr DW$171, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
    1563                            .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1564                            .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1565                    DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1566                            .dwattr DW$172, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
    1567                            .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1568                            .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1569                    DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1570                            .dwattr DW$173, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
    1571                            .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1572                            .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1573                    DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1574                            .dwattr DW$174, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
    1575                            .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1576                            .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1577                    DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    1578                            .dwattr DW$175, DW_AT_name("autoSyncEnable"), DW_AT_symbol_name("_autoSyncEnable")
    1579                            .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1580                            .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1581                            .dwendtag DW$T$70
    1582                    
    1583                    
    1584                    DW$T$77 .dwtag  DW_TAG_structure_type
    1585                            .dwattr DW$T$77, DW_AT_byte_size(0x14)
    1586                    DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
    1587                            .dwattr DW$176, DW_AT_name("videoMode"), DW_AT_symbol_name("_videoMode")
    1588                            .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589                            .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1590                    DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    1591                            .dwattr DW$177, DW_AT_name("aFmt"), DW_AT_symbol_name("_aFmt")
    1592                            .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1593                            .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1594                    DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    1595                            .dwattr DW$178, DW_AT_name("enableBT656Sync"), DW_AT_symbol_name("_enableBT656Sync")
    1596                            .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1597                            .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1598                    DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1599                            .dwattr DW$179, DW_AT_name("inputPort"), DW_AT_symbol_name("_inputPort")
    1600                            .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1601                            .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1602                    DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    1603                            .dwattr DW$180, DW_AT_name("hI2C"), DW_AT_symbol_name("_hI2C")
    1604                            .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1605                            .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1606                            .dwendtag DW$T$77
    1607                    
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   32

    1608                    DW$T$147        .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Frame"), DW_AT_type(*DW$T$89)
    1609                            .dwattr DW$T$147, DW_AT_language(DW_LANG_C)
    1610                    
    1611                    DW$T$90 .dwtag  DW_TAG_enumeration_type
    1612                            .dwattr DW$T$90, DW_AT_byte_size(0x04)
    1613                    DW$181  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
    1614                    DW$182  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
    1615                    DW$183  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
    1616                    DW$184  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
    1617                    DW$185  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
    1618                    DW$186  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
    1619                            .dwendtag DW$T$90
    1620                    
    1621                    DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
    1622                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    1623                    DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$68)
    1624                            .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    1625                    
    1626                    DW$T$57 .dwtag  DW_TAG_structure_type
    1627                            .dwattr DW$T$57, DW_AT_name("GIO_Obj")
    1628                            .dwattr DW$T$57, DW_AT_byte_size(0x3c)
    1629                    DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    1630                            .dwattr DW$187, DW_AT_name("fxns"), DW_AT_symbol_name("_fxns")
    1631                            .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632                            .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1633                    DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1634                            .dwattr DW$188, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
    1635                            .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1636                            .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1637                    DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1638                            .dwattr DW$189, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    1639                            .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1640                            .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1641                    DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    1642                            .dwattr DW$190, DW_AT_name("syncPacket"), DW_AT_symbol_name("_syncPacket")
    1643                            .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1644                            .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1645                    DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    1646                            .dwattr DW$191, DW_AT_name("freeList"), DW_AT_symbol_name("_freeList")
    1647                            .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1648                            .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1649                    DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1650                            .dwattr DW$192, DW_AT_name("syncObj"), DW_AT_symbol_name("_syncObj")
    1651                            .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1652                            .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1653                    DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1654                            .dwattr DW$193, DW_AT_name("mdChan"), DW_AT_symbol_name("_mdChan")
    1655                            .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1656                            .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1657                            .dwendtag DW$T$57
    1658                    
    1659                    
    1660                    DW$T$58 .dwtag  DW_TAG_structure_type
    1661                            .dwattr DW$T$58, DW_AT_name("GIO_Attrs")
    1662                            .dwattr DW$T$58, DW_AT_byte_size(0x08)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   33

    1663                    DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1664                            .dwattr DW$194, DW_AT_name("nPackets"), DW_AT_symbol_name("_nPackets")
    1665                            .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1666                            .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1667                    DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1668                            .dwattr DW$195, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    1669                            .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1670                            .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1671                            .dwendtag DW$T$58
    1672                    
    1673                    
    1674                    DW$T$62 .dwtag  DW_TAG_structure_type
    1675                            .dwattr DW$T$62, DW_AT_name("GIO_AppCallback")
    1676                            .dwattr DW$T$62, DW_AT_byte_size(0x08)
    1677                    DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    1678                            .dwattr DW$196, DW_AT_name("fxn"), DW_AT_symbol_name("_fxn")
    1679                            .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                            .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1681                    DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1682                            .dwattr DW$197, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
    1683                            .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1684                            .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1685                            .dwendtag DW$T$62
    1686                    
    1687                    
    1688                    DW$T$66 .dwtag  DW_TAG_structure_type
    1689                            .dwattr DW$T$66, DW_AT_byte_size(0x14)
    1690                    DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1691                            .dwattr DW$198, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    1692                            .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1693                            .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1694                    DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1695                            .dwattr DW$199, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    1696                            .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1697                            .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1698                    DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1699                            .dwattr DW$200, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    1700                            .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1701                            .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1702                    DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1703                            .dwattr DW$201, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
    1704                            .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1705                            .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1706                    DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1707                            .dwattr DW$202, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
    1708                            .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1709                            .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1710                            .dwendtag DW$T$66
    1711                    
    1712                    DW$T$72 .dwtag  DW_TAG_typedef, DW_AT_name("TVP51XX_Mode"), DW_AT_type(*DW$T$71)
    1713                            .dwattr DW$T$72, DW_AT_language(DW_LANG_C)
    1714                    DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("TVP51XX_AnalogFormat"), DW_AT_type(*DW$T$73)
    1715                            .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    1716                    
    1717                    DW$T$89 .dwtag  DW_TAG_structure_type
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   34

    1718                            .dwattr DW$T$89, DW_AT_name("FVID_Frame")
    1719                            .dwattr DW$T$89, DW_AT_byte_size(0x20)
    1720                    DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1721                            .dwattr DW$203, DW_AT_name("queElement"), DW_AT_symbol_name("_queElement")
    1722                            .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1723                            .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1724                    DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    1725                            .dwattr DW$204, DW_AT_name("frame"), DW_AT_symbol_name("_frame")
    1726                            .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1727                            .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1728                            .dwendtag DW$T$89
    1729                    
    1730                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_TappCallback"), DW_AT_type(*DW$T$60)
    1731                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    1732                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    1733                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1734                    DW$T$65 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$64)
    1735                            .dwattr DW$T$65, DW_AT_address_class(0x20)
    1736                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
    1737                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1738                    DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
    1739                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1740                    DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$40)
    1741                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1742                    DW$T$55 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$54)
    1743                            .dwattr DW$T$55, DW_AT_address_class(0x20)
    1744                    
    1745                    DW$T$71 .dwtag  DW_TAG_enumeration_type
    1746                            .dwattr DW$T$71, DW_AT_name("TVP51XX_Mode")
    1747                            .dwattr DW$T$71, DW_AT_byte_size(0x04)
    1748                    DW$205  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_NTSC601"), DW_AT_const_value(0x00)
    1749                    DW$206  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_NTSCSqp"), DW_AT_const_value(0x01)
    1750                    DW$207  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_PAL601"), DW_AT_const_value(0x02)
    1751                    DW$208  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_PALSqp"), DW_AT_const_value(0x03)
    1752                    DW$209  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_MODE_USER"), DW_AT_const_value(0x04)
    1753                            .dwendtag DW$T$71
    1754                    
    1755                    
    1756                    DW$T$73 .dwtag  DW_TAG_enumeration_type
    1757                            .dwattr DW$T$73, DW_AT_name("TVP51XX_AnalogFormat")
    1758                            .dwattr DW$T$73, DW_AT_byte_size(0x04)
    1759                    DW$210  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_COMPOSITE"), DW_AT_const_value(0x00)
    1760                    DW$211  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_SVIDEO"), DW_AT_const_value(0x01)
    1761                    DW$212  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_RGB"), DW_AT_const_value(0x02)
    1762                    DW$213  .dwtag  DW_TAG_enumerator, DW_AT_name("TVP51XX_AFMT_YPBPR"), DW_AT_const_value(0x03)
    1763                            .dwendtag DW$T$73
    1764                    
    1765                    
    1766                    DW$T$88 .dwtag  DW_TAG_union_type
    1767                            .dwattr DW$T$88, DW_AT_byte_size(0x18)
    1768                    DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
    1769                            .dwattr DW$214, DW_AT_name("iFrm"), DW_AT_symbol_name("_iFrm")
    1770                            .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                            .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    1772                    DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   35

    1773                            .dwattr DW$215, DW_AT_name("pFrm"), DW_AT_symbol_name("_pFrm")
    1774                            .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775                            .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    1776                    DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    1777                            .dwattr DW$216, DW_AT_name("riFrm"), DW_AT_symbol_name("_riFrm")
    1778                            .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                            .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    1780                    DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$87)
    1781                            .dwattr DW$217, DW_AT_name("rpFrm"), DW_AT_symbol_name("_rpFrm")
    1782                            .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1783                            .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    1784                            .dwendtag DW$T$88
    1785                    
    1786                    DW$T$60 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$59)
    1787                            .dwattr DW$T$60, DW_AT_address_class(0x20)
    1788                    DW$T$64 .dwtag  DW_TAG_volatile_type
    1789                            .dwattr DW$T$64, DW_AT_type(*DW$T$63)
    1790                    
    1791                    DW$T$20 .dwtag  DW_TAG_structure_type
    1792                            .dwattr DW$T$20, DW_AT_name("QUE_Elem")
    1793                            .dwattr DW$T$20, DW_AT_byte_size(0x08)
    1794                    DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1795                            .dwattr DW$218, DW_AT_name("next"), DW_AT_symbol_name("_next")
    1796                            .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1797                            .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    1798                    DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1799                            .dwattr DW$219, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
    1800                            .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1801                            .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    1802                            .dwendtag DW$T$20
    1803                    
    1804                    DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    1805                            .dwattr DW$T$19, DW_AT_address_class(0x20)
    1806                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$26)
    1807                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    1808                    DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$53)
    1809                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1810                    DW$T$84 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_IFrame"), DW_AT_type(*DW$T$80)
    1811                            .dwattr DW$T$84, DW_AT_language(DW_LANG_C)
    1812                    DW$T$85 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_PFrame"), DW_AT_type(*DW$T$81)
    1813                            .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
    1814                    DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawIFrame"), DW_AT_type(*DW$T$82)
    1815                            .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    1816                    DW$T$87 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawPFrame"), DW_AT_type(*DW$T$83)
    1817                            .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    1818                    
    1819                    DW$T$59 .dwtag  DW_TAG_subroutine_type
    1820                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    1821                    DW$220  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1822                    DW$221  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    1823                    DW$222  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1824                    DW$223  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    1825                            .dwendtag DW$T$59
    1826                    
    1827                    
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   36

    1828                    DW$T$26 .dwtag  DW_TAG_structure_type
    1829                            .dwattr DW$T$26, DW_AT_name("DEV_Frame")
    1830                            .dwattr DW$T$26, DW_AT_byte_size(0x20)
    1831                    DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1832                            .dwattr DW$224, DW_AT_name("link"), DW_AT_symbol_name("_link")
    1833                            .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                            .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    1835                    DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1836                            .dwattr DW$225, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
    1837                            .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1838                            .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    1839                    DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1840                            .dwattr DW$226, DW_AT_name("size"), DW_AT_symbol_name("_size")
    1841                            .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1842                            .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    1843                    DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1844                            .dwattr DW$227, DW_AT_name("misc"), DW_AT_symbol_name("_misc")
    1845                            .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1846                            .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    1847                    DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1848                            .dwattr DW$228, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
    1849                            .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1850                            .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    1851                    DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1852                            .dwattr DW$229, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
    1853                            .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1854                            .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    1855                    DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1856                            .dwattr DW$230, DW_AT_name("status"), DW_AT_symbol_name("_status")
    1857                            .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1858                            .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    1859                            .dwendtag DW$T$26
    1860                    
    1861                    
    1862                    DW$T$53 .dwtag  DW_TAG_structure_type
    1863                            .dwattr DW$T$53, DW_AT_name("IOM_Fxns")
    1864                            .dwattr DW$T$53, DW_AT_byte_size(0x18)
    1865                    DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1866                            .dwattr DW$231, DW_AT_name("mdBindDev"), DW_AT_symbol_name("_mdBindDev")
    1867                            .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868                            .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    1869                    DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1870                            .dwattr DW$232, DW_AT_name("mdUnBindDev"), DW_AT_symbol_name("_mdUnBindDev")
    1871                            .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1872                            .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    1873                    DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1874                            .dwattr DW$233, DW_AT_name("mdControlChan"), DW_AT_symbol_name("_mdControlChan")
    1875                            .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1876                            .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    1877                    DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    1878                            .dwattr DW$234, DW_AT_name("mdCreateChan"), DW_AT_symbol_name("_mdCreateChan")
    1879                            .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1880                            .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    1881                    DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    1882                            .dwattr DW$235, DW_AT_name("mdDeleteChan"), DW_AT_symbol_name("_mdDeleteChan")
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   37

    1883                            .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1884                            .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    1885                    DW$236  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    1886                            .dwattr DW$236, DW_AT_name("mdSubmitChan"), DW_AT_symbol_name("_mdSubmitChan")
    1887                            .dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1888                            .dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
    1889                            .dwendtag DW$T$53
    1890                    
    1891                    
    1892                    DW$T$80 .dwtag  DW_TAG_structure_type
    1893                            .dwattr DW$T$80, DW_AT_name("FVID_IFrame")
    1894                            .dwattr DW$T$80, DW_AT_byte_size(0x18)
    1895                    DW$237  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1896                            .dwattr DW$237, DW_AT_name("y1"), DW_AT_symbol_name("_y1")
    1897                            .dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                            .dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
    1899                    DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1900                            .dwattr DW$238, DW_AT_name("cb1"), DW_AT_symbol_name("_cb1")
    1901                            .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1902                            .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    1903                    DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1904                            .dwattr DW$239, DW_AT_name("cr1"), DW_AT_symbol_name("_cr1")
    1905                            .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1906                            .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    1907                    DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1908                            .dwattr DW$240, DW_AT_name("y2"), DW_AT_symbol_name("_y2")
    1909                            .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1910                            .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    1911                    DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1912                            .dwattr DW$241, DW_AT_name("cb2"), DW_AT_symbol_name("_cb2")
    1913                            .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1914                            .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    1915                    DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1916                            .dwattr DW$242, DW_AT_name("cr2"), DW_AT_symbol_name("_cr2")
    1917                            .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1918                            .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    1919                            .dwendtag DW$T$80
    1920                    
    1921                    
    1922                    DW$T$81 .dwtag  DW_TAG_structure_type
    1923                            .dwattr DW$T$81, DW_AT_name("FVID_PFrame")
    1924                            .dwattr DW$T$81, DW_AT_byte_size(0x0c)
    1925                    DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1926                            .dwattr DW$243, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1927                            .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                            .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    1929                    DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1930                            .dwattr DW$244, DW_AT_name("cb"), DW_AT_symbol_name("_cb")
    1931                            .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1932                            .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    1933                    DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1934                            .dwattr DW$245, DW_AT_name("cr"), DW_AT_symbol_name("_cr")
    1935                            .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1936                            .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    1937                            .dwendtag DW$T$81
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   38

    1938                    
    1939                    
    1940                    DW$T$82 .dwtag  DW_TAG_structure_type
    1941                            .dwattr DW$T$82, DW_AT_name("FVID_RawIFrame")
    1942                            .dwattr DW$T$82, DW_AT_byte_size(0x08)
    1943                    DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1944                            .dwattr DW$246, DW_AT_name("buf1"), DW_AT_symbol_name("_buf1")
    1945                            .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1946                            .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    1947                    DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1948                            .dwattr DW$247, DW_AT_name("buf2"), DW_AT_symbol_name("_buf2")
    1949                            .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1950                            .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    1951                            .dwendtag DW$T$82
    1952                    
    1953                    
    1954                    DW$T$83 .dwtag  DW_TAG_structure_type
    1955                            .dwattr DW$T$83, DW_AT_name("FVID_RawPFrame")
    1956                            .dwattr DW$T$83, DW_AT_byte_size(0x04)
    1957                    DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1958                            .dwattr DW$248, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    1959                            .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1960                            .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    1961                            .dwendtag DW$T$83
    1962                    
    1963                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$24)
    1964                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    1965                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdBindDev"), DW_AT_type(*DW$T$29)
    1966                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    1967                    DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdUnBindDev"), DW_AT_type(*DW$T$32)
    1968                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1969                    DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdDeleteChan"), DW_AT_type(*DW$T$32)
    1970                            .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
    1971                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdControlChan"), DW_AT_type(*DW$T$35)
    1972                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    1973                    DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdCreateChan"), DW_AT_type(*DW$T$47)
    1974                            .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    1975                    DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdSubmitChan"), DW_AT_type(*DW$T$51)
    1976                            .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    1977                    DW$T$79 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$78)
    1978                            .dwattr DW$T$79, DW_AT_address_class(0x20)
    1979                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    1980                            .dwattr DW$T$29, DW_AT_address_class(0x20)
    1981                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
    1982                            .dwattr DW$T$32, DW_AT_address_class(0x20)
    1983                    DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    1984                            .dwattr DW$T$35, DW_AT_address_class(0x20)
    1985                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
    1986                            .dwattr DW$T$47, DW_AT_address_class(0x20)
    1987                    DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
    1988                            .dwattr DW$T$51, DW_AT_address_class(0x20)
    1989                    DW$T$78 .dwtag  DW_TAG_typedef, DW_AT_name("Char"), DW_AT_type(*DW$T$37)
    1990                            .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    1991                    
    1992                    DW$T$28 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
TMS320C6x COFF Assembler PC v5.1.0 Thu Mar 10 14:36:05 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\ADMINI~1\LOCALS~1\Temp\TI3482                            PAGE   39

    1993                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1994                    DW$249  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
    1995                    DW$250  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    1996                    DW$251  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1997                            .dwendtag DW$T$28
    1998                    
    1999                    
    2000                    DW$T$31 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
    2001                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    2002                    DW$252  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    2003                            .dwendtag DW$T$31
    2004                    
    2005                    
    2006                    DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
