;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Tue Oct 16 17:38:23 2007                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

	.dwendtag DW$T$95


DW$T$98	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$98, DW_AT_language(DW_LANG_C)
DW$228	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$90)
DW$229	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$230	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$58)
DW$231	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
DW$232	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$233	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$78)
DW$234	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$98


DW$T$102	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$102, DW_AT_language(DW_LANG_C)
DW$235	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$236	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$75)
	.dwendtag DW$T$102


DW$T$189	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$189, DW_AT_language(DW_LANG_C)

DW$T$192	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$192, DW_AT_language(DW_LANG_C)
DW$237	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$238	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$191)
	.dwendtag DW$T$192


DW$T$193	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$193, DW_AT_language(DW_LANG_C)
DW$239	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$240	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$193


DW$T$197	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$197, DW_AT_language(DW_LANG_C)
DW$241	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$197

DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
DW$T$69	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Handle"), DW_AT_type(*DW$T$34)
	.dwattr DW$T$69, DW_AT_language(DW_LANG_C)

DW$T$230	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$69)
	.dwattr DW$T$230, DW_AT_language(DW_LANG_C)
DW$242	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$243	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
	.dwendtag DW$T$230


DW$T$231	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$69)
	.dwattr DW$T$231, DW_AT_language(DW_LANG_C)
DW$244	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$231


DW$T$232	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$232, DW_AT_language(DW_LANG_C)
DW$245	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
	.dwendtag DW$T$232


DW$T$233	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$233, DW_AT_language(DW_LANG_C)

DW$T$234	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$234, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$234, DW_AT_byte_size(0x84)
DW$246	.dwtag  DW_TAG_subrange_type
	.dwattr DW$246, DW_AT_upper_bound(0x20)
	.dwendtag DW$T$234

DW$T$235	.dwtag  DW_TAG_typedef, DW_AT_name("LgUns"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$235, DW_AT_language(DW_LANG_C)

DW$T$236	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$235)
	.dwattr DW$T$236, DW_AT_language(DW_LANG_C)
DW$T$237	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$237, DW_AT_type(*DW$T$11)
DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Handle"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$115, DW_AT_language(DW_LANG_C)
DW$T$182	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Handle"), DW_AT_type(*DW$T$181)
	.dwattr DW$T$182, DW_AT_language(DW_LANG_C)
DW$T$257	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Obj"), DW_AT_type(*DW$T$30)
	.dwattr DW$T$257, DW_AT_language(DW_LANG_C)
DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("HWI_Attrs"), DW_AT_type(*DW$T$33)
	.dwattr DW$T$133, DW_AT_language(DW_LANG_C)
DW$T$134	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$133)
	.dwattr DW$T$134, DW_AT_address_class(0x20)
DW$T$152	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$151)
	.dwattr DW$T$152, DW_AT_address_class(0x20)
DW$T$75	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$74)
	.dwattr DW$T$75, DW_AT_address_class(0x20)
DW$T$191	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$190)
	.dwattr DW$T$191, DW_AT_address_class(0x20)
DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("Char"), DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_language(DW_LANG_C)
DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$57)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)
DW$T$130	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$129)
	.dwattr DW$T$130, DW_AT_address_class(0x20)
DW$T$157	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$106)
	.dwattr DW$T$157, DW_AT_address_class(0x20)
DW$T$279	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$105)
	.dwattr DW$T$279, DW_AT_language(DW_LANG_C)

DW$T$281	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$280)
	.dwattr DW$T$281, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$281, DW_AT_byte_size(0xe40)
DW$247	.dwtag  DW_TAG_subrange_type
	.dwattr DW$247, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$281

DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x20)
DW$T$77	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
	.dwattr DW$T$77, DW_AT_address_class(0x20)
DW$T$143	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$142)
	.dwattr DW$T$143, DW_AT_address_class(0x20)
DW$T$40	.dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$40, DW_AT_language(DW_LANG_C)
DW$T$87	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$86)
	.dwattr DW$T$87, DW_AT_address_class(0x20)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$19	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$19, DW_AT_address_class(0x20)

DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$30, DW_AT_name("SEM_Obj")
	.dwattr DW$T$30, DW_AT_byte_size(0x1c)
DW$248	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$248, DW_AT_name("job"), DW_AT_symbol_name("_job")
	.dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
DW$249	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$249, DW_AT_name("count"), DW_AT_symbol_name("_count")
	.dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
DW$250	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$250, DW_AT_name("pendQ"), DW_AT_symbol_name("_pendQ")
	.dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30

DW$T$181	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$181, DW_AT_address_class(0x20)

DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$33, DW_AT_name("HWI_Attrs")
	.dwattr DW$T$33, DW_AT_byte_size(0x0c)
DW$251	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$251, DW_AT_name("intrMask"), DW_AT_symbol_name("_intrMask")
	.dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
DW$252	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$252, DW_AT_name("ccMask"), DW_AT_symbol_name("_ccMask")
	.dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
DW$253	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$253, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
	.dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33

DW$T$151	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Config"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$151, DW_AT_language(DW_LANG_C)
DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$73)
	.dwattr DW$T$74, DW_AT_language(DW_LANG_C)
DW$T$190	.dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$42)
	.dwattr DW$T$190, DW_AT_language(DW_LANG_C)
DW$T$43	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$43, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$43, DW_AT_byte_size(0x01)
DW$T$57	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
	.dwattr DW$T$57, DW_AT_address_class(0x20)
DW$T$129	.dwtag  DW_TAG_const_type
	.dwattr DW$T$129, DW_AT_type(*DW$T$43)
DW$T$106	.dwtag  DW_TAG_typedef, DW_AT_name("_VPORT_ChanObj"), DW_AT_type(*DW$T$89)
	.dwattr DW$T$106, DW_AT_language(DW_LANG_C)

DW$T$105	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$105, DW_AT_name("IOM_Fxns")
	.dwattr DW$T$105, DW_AT_byte_size(0x18)
DW$254	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$93)
	.dwattr DW$254, DW_AT_name("mdBindDev"), DW_AT_symbol_name("_mdBindDev")
	.dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
DW$255	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$255, DW_AT_name("mdUnBindDev"), DW_AT_symbol_name("_mdUnBindDev")
	.dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
DW$256	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
	.dwattr DW$256, DW_AT_name("mdControlChan"), DW_AT_symbol_name("_mdControlChan")
	.dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
DW$257	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$100)
	.dwattr DW$257, DW_AT_name("mdCreateChan"), DW_AT_symbol_name("_mdCreateChan")
	.dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
DW$258	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
	.dwattr DW$258, DW_AT_name("mdDeleteChan"), DW_AT_symbol_name("_mdDeleteChan")
	.dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
DW$259	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
	.dwattr DW$259, DW_AT_name("mdSubmitChan"), DW_AT_symbol_name("_mdSubmitChan")
	.dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$105

DW$T$280	.dwtag  DW_TAG_typedef, DW_AT_name("PortObj"), DW_AT_type(*DW$T$108)
	.dwattr DW$T$280, DW_AT_language(DW_LANG_C)

DW$T$76	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$76, DW_AT_language(DW_LANG_C)
DW$260	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$261	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$75)
	.dwendtag DW$T$76

DW$T$9	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$9, DW_AT_byte_size(0x02)
DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$32, DW_AT_language(DW_LANG_C)
DW$T$94	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdUnBindDev"), DW_AT_type(*DW$T$62)
	.dwattr DW$T$94, DW_AT_language(DW_LANG_C)
DW$T$101	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdDeleteChan"), DW_AT_type(*DW$T$62)
	.dwattr DW$T$101, DW_AT_language(DW_LANG_C)

DW$T$86	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$86, DW_AT_language(DW_LANG_C)
DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdBindDev"), DW_AT_type(*DW$T$92)
	.dwattr DW$T$93, DW_AT_language(DW_LANG_C)
DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdControlChan"), DW_AT_type(*DW$T$96)
	.dwattr DW$T$97, DW_AT_language(DW_LANG_C)
DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdCreateChan"), DW_AT_type(*DW$T$99)
	.dwattr DW$T$100, DW_AT_language(DW_LANG_C)
DW$T$104	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdSubmitChan"), DW_AT_type(*DW$T$103)
	.dwattr DW$T$104, DW_AT_language(DW_LANG_C)

DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_name("QUE_Elem")
	.dwattr DW$T$20, DW_AT_byte_size(0x08)
DW$262	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$262, DW_AT_name("next"), DW_AT_symbol_name("_next")
	.dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
DW$263	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$263, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
	.dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20

DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Job"), DW_AT_type(*DW$T$28)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)

DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_byte_size(0x18)
DW$264	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$264, DW_AT_name("opt"), DW_AT_symbol_name("_opt")
	.dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
DW$265	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$265, DW_AT_name("src"), DW_AT_symbol_name("_src")
	.dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
DW$266	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$266, DW_AT_name("cnt"), DW_AT_symbol_name("_cnt")
	.dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
DW$267	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$267, DW_AT_name("dst"), DW_AT_symbol_name("_dst")
	.dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
DW$268	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$268, DW_AT_name("idx"), DW_AT_symbol_name("_idx")
	.dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
DW$269	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$269, DW_AT_name("rld"), DW_AT_symbol_name("_rld")
	.dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35

DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$73, DW_AT_language(DW_LANG_C)

DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$42, DW_AT_byte_size(0x58)
DW$270	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$270, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
	.dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
DW$271	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$271, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
	.dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
DW$272	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$272, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
DW$273	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$273, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
DW$274	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$274, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
	.dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
DW$275	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$275, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
	.dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
DW$276	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$276, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
	.dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
DW$277	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$277, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
	.dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
DW$278	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$278, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
	.dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
DW$279	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$279, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
	.dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
DW$280	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$280, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
	.dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
DW$281	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$281, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
	.dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
DW$282	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$282, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
	.dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
DW$283	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$283, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
	.dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
DW$284	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$284, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
	.dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
DW$285	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$285, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
	.dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
DW$286	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$286, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
	.dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
DW$287	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$287, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
	.dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
DW$288	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$288, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
	.dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
DW$289	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$289, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
	.dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
DW$290	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$290, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
	.dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
DW$291	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$291, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
DW$292	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$292, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
	.dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
DW$293	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$293, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
	.dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
DW$294	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$294, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
	.dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
DW$295	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$295, DW_AT_name("autoSyncEnable"), DW_AT_symbol_name("_autoSyncEnable")
	.dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$42


DW$T$89	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$89, DW_AT_byte_size(0x25c)
DW$296	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$296, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
DW$297	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$297, DW_AT_name("portNum"), DW_AT_symbol_name("_portNum")
	.dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
DW$298	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$298, DW_AT_name("chanNum"), DW_AT_symbol_name("_chanNum")
	.dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
DW$299	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$299, DW_AT_name("base"), DW_AT_symbol_name("_base")
	.dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
DW$300	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$300, DW_AT_name("edmaChanNum"), DW_AT_symbol_name("_edmaChanNum")
	.dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
DW$301	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$301, DW_AT_name("edmaAddr"), DW_AT_symbol_name("_edmaAddr")
	.dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
DW$302	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$302, DW_AT_name("vIntMask"), DW_AT_symbol_name("_vIntMask")
	.dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
DW$303	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
	.dwattr DW$303, DW_AT_name("viops"), DW_AT_symbol_name("_viops")
	.dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
DW$304	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$304, DW_AT_name("qIn"), DW_AT_symbol_name("_qIn")
	.dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
	.dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
DW$305	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$305, DW_AT_name("qOut"), DW_AT_symbol_name("_qOut")
	.dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
	.dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
DW$306	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$306, DW_AT_name("qPullDown"), DW_AT_symbol_name("_qPullDown")
	.dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
	.dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
DW$307	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$307, DW_AT_name("hEdma"), DW_AT_symbol_name("_hEdma")
	.dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x184]
	.dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
DW$308	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$71)
	.dwattr DW$308, DW_AT_name("hRld"), DW_AT_symbol_name("_hRld")
	.dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x190]
	.dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
DW$309	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
	.dwattr DW$309, DW_AT_name("tcc"), DW_AT_symbol_name("_tcc")
	.dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c0]
	.dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
DW$310	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$310, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1cc]
	.dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
DW$311	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$311, DW_AT_name("interlaced"), DW_AT_symbol_name("_interlaced")
	.dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ce]
	.dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
DW$312	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
	.dwattr DW$312, DW_AT_name("cbFxn"), DW_AT_symbol_name("_cbFxn")
	.dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d0]
	.dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
DW$313	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$313, DW_AT_name("cbArg"), DW_AT_symbol_name("_cbArg")
	.dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d4]
	.dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
DW$314	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
	.dwattr DW$314, DW_AT_name("vIntFxn"), DW_AT_symbol_name("_vIntFxn")
	.dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d8]
	.dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
DW$315	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$315, DW_AT_name("queEmpty"), DW_AT_symbol_name("_queEmpty")
	.dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1dc]
	.dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
DW$316	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$316, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1de]
	.dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
DW$317	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$317, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
	.dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
DW$318	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$318, DW_AT_name("yPitch"), DW_AT_symbol_name("_yPitch")
	.dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e4]
	.dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
DW$319	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$319, DW_AT_name("cPitch"), DW_AT_symbol_name("_cPitch")
	.dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
DW$320	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$320, DW_AT_name("numLines"), DW_AT_symbol_name("_numLines")
	.dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
DW$321	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$321, DW_AT_name("numPixels"), DW_AT_symbol_name("_numPixels")
	.dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
DW$322	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$322, DW_AT_name("numLinesFld1"), DW_AT_symbol_name("_numLinesFld1")
	.dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f4]
	.dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
DW$323	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$323, DW_AT_name("numFrms"), DW_AT_symbol_name("_numFrms")
	.dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
	.dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
DW$324	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$324, DW_AT_name("numEvents"), DW_AT_symbol_name("_numEvents")
	.dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1fc]
	.dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
DW$325	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$325, DW_AT_name("numEventsFld1"), DW_AT_symbol_name("_numEventsFld1")
	.dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
DW$326	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$326, DW_AT_name("yThrld"), DW_AT_symbol_name("_yThrld")
	.dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
DW$327	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$327, DW_AT_name("cThrld"), DW_AT_symbol_name("_cThrld")
	.dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
DW$328	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
	.dwattr DW$328, DW_AT_name("curViop"), DW_AT_symbol_name("_curViop")
	.dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
DW$329	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
	.dwattr DW$329, DW_AT_name("nextViop"), DW_AT_symbol_name("_nextViop")
	.dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x210]
	.dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
DW$330	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
	.dwattr DW$330, DW_AT_name("mrViop"), DW_AT_symbol_name("_mrViop")
	.dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x214]
	.dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
DW$331	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$331, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
	.dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x218]
	.dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
DW$332	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$85)
	.dwattr DW$332, DW_AT_name("edcFxns"), DW_AT_symbol_name("_edcFxns")
	.dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x21c]
	.dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
DW$333	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$333, DW_AT_name("edcHandle"), DW_AT_symbol_name("_edcHandle")
	.dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x220]
	.dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
DW$334	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
	.dwattr DW$334, DW_AT_name("packetIOM"), DW_AT_symbol_name("_packetIOM")
	.dwattr DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x224]
	.dwattr DW$334, DW_AT_accessibility(DW_ACCESS_public)
DW$335	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$335, DW_AT_name("vIntCbArg"), DW_AT_symbol_name("_vIntCbArg")
	.dwattr DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x228]
	.dwattr DW$335, DW_AT_accessibility(DW_ACCESS_public)
DW$336	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$336, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
	.dwattr DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x22c]
	.dwattr DW$336, DW_AT_accessibility(DW_ACCESS_public)
DW$337	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$337, DW_AT_name("bufSz"), DW_AT_symbol_name("_bufSz")
	.dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x230]
	.dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
DW$338	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$338, DW_AT_name("lastLineNum"), DW_AT_symbol_name("_lastLineNum")
	.dwattr DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x234]
	.dwattr DW$338, DW_AT_accessibility(DW_ACCESS_public)
DW$339	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$339, DW_AT_name("nextEDMARlds"), DW_AT_symbol_name("_nextEDMARlds")
	.dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x238]
	.dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
DW$340	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$340, DW_AT_name("numTotalLinesFld1"), DW_AT_symbol_name("_numTotalLinesFld1")
	.dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x23c]
	.dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
DW$341	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$341, DW_AT_name("autoSyncEnable"), DW_AT_symbol_name("_autoSyncEnable")
	.dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x240]
	.dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
DW$342	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
	.dwattr DW$342, DW_AT_name("asyncModeEnable"), DW_AT_symbol_name("_asyncModeEnable")
	.dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x242]
	.dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
DW$343	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$343, DW_AT_name("pullDownMode"), DW_AT_symbol_name("_pullDownMode")
	.dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x244]
	.dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
DW$344	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$344, DW_AT_name("asyncFrameCt"), DW_AT_symbol_name("_asyncFrameCt")
	.dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x248]
	.dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
DW$345	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$345, DW_AT_name("asyncCallBackFxn"), DW_AT_symbol_name("_asyncCallBackFxn")
	.dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x24c]
	.dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
DW$346	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$346, DW_AT_name("frmSz"), DW_AT_symbol_name("_frmSz")
	.dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x250]
	.dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
DW$347	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$347, DW_AT_name("asyncCbArg"), DW_AT_symbol_name("_asyncCbArg")
	.dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x254]
	.dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
DW$348	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$348, DW_AT_name("startFlag"), DW_AT_symbol_name("_startFlag")
	.dwattr DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x258]
	.dwattr DW$348, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$89


DW$T$108	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$108, DW_AT_name("PortObj")
	.dwattr DW$T$108, DW_AT_byte_size(0x4c0)
DW$349	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$349, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$349, DW_AT_accessibility(DW_ACCESS_public)
DW$350	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$350, DW_AT_name("base"), DW_AT_symbol_name("_base")
	.dwattr DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$350, DW_AT_accessibility(DW_ACCESS_public)
DW$351	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$107)
	.dwattr DW$351, DW_AT_name("chanObj"), DW_AT_symbol_name("_chanObj")
	.dwattr DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$351, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$108

DW$T$81	.dwtag  DW_TAG_typedef, DW_AT_name("VPORT_IntCallBack"), DW_AT_type(*DW$T$80)
	.dwattr DW$T$81, DW_AT_language(DW_LANG_C)
DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$T$82	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$82, DW_AT_type(*DW$T$41)
DW$T$62	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
	.dwattr DW$T$62, DW_AT_address_class(0x20)

DW$T$72	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$72, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$72, DW_AT_byte_size(0x0c)
DW$352	.dwtag  DW_TAG_subrange_type
	.dwattr DW$352, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$72

DW$T$92	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$91)
	.dwattr DW$T$92, DW_AT_address_class(0x20)
DW$T$96	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$95)
	.dwattr DW$T$96, DW_AT_address_class(0x20)
DW$T$99	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$98)
	.dwattr DW$T$99, DW_AT_address_class(0x20)
DW$T$103	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$102)
	.dwattr DW$T$103, DW_AT_address_class(0x20)

DW$T$66	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$31)
	.dwattr DW$T$66, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$66, DW_AT_byte_size(0x0c)
DW$353	.dwtag  DW_TAG_subrange_type
	.dwattr DW$353, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$66


DW$T$70	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$69)
	.dwattr DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$70, DW_AT_byte_size(0x0c)
DW$354	.dwtag  DW_TAG_subrange_type
	.dwattr DW$354, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$70


DW$T$71	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$69)
	.dwattr DW$T$71, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$71, DW_AT_byte_size(0x30)
DW$355	.dwtag  DW_TAG_subrange_type
	.dwattr DW$355, DW_AT_upper_bound(0x0b)
	.dwendtag DW$T$71

DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)

DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$28, DW_AT_name("KNL_Job")
	.dwattr DW$T$28, DW_AT_byte_size(0x10)
DW$356	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$356, DW_AT_name("wListElem"), DW_AT_symbol_name("_wListElem")
	.dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
DW$357	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$357, DW_AT_name("wCount"), DW_AT_symbol_name("_wCount")
	.dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
DW$358	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$358, DW_AT_name("fxn"), DW_AT_symbol_name("_fxn")
	.dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$28


DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$38, DW_AT_name("DEV_Frame")
	.dwattr DW$T$38, DW_AT_byte_size(0x20)
DW$359	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$359, DW_AT_name("link"), DW_AT_symbol_name("_link")
	.dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
DW$360	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$360, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
	.dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
DW$361	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$361, DW_AT_name("size"), DW_AT_symbol_name("_size")
	.dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
DW$362	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$362, DW_AT_name("misc"), DW_AT_symbol_name("_misc")
	.dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
DW$363	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$363, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
	.dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
DW$364	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$364, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
	.dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
DW$365	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$365, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$38


DW$T$68	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$68, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$68, DW_AT_byte_size(0x140)
DW$366	.dwtag  DW_TAG_subrange_type
	.dwattr DW$366, DW_AT_upper_bound(0x09)
	.dwendtag DW$T$68

DW$T$83	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$83, DW_AT_address_class(0x20)
DW$T$85	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$84)
	.dwattr DW$T$85, DW_AT_address_class(0x20)

DW$T$107	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$106)
	.dwattr DW$T$107, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$107, DW_AT_byte_size(0x4b8)
DW$367	.dwtag  DW_TAG_subrange_type
	.dwattr DW$367, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$107

DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Fxn"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
DW$T$80	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$79)
	.dwattr DW$T$80, DW_AT_address_class(0x20)
DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_Frame"), DW_AT_type(*DW$T$55)
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)
DW$T$84	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$65)
	.dwattr DW$T$84, DW_AT_language(DW_LANG_C)
DW$T$26	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
	.dwattr DW$T$26, DW_AT_address_class(0x20)

DW$T$79	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$79, DW_AT_language(DW_LANG_C)
DW$368	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
DW$369	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$79


DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$55, DW_AT_name("FVID_Frame")
	.dwattr DW$T$55, DW_AT_byte_size(0x20)
DW$370	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$370, DW_AT_name("queElement"), DW_AT_symbol_name("_queElement")
	.dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
DW$371	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
	.dwattr DW$371, DW_AT_name("frame"), DW_AT_symbol_name("_frame")
	.dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$55


DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$65, DW_AT_name("EDC_Fxns")
	.dwattr DW$T$65, DW_AT_byte_size(0x0c)
DW$372	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
	.dwattr DW$372, DW_AT_name("open"), DW_AT_symbol_name("_open")
	.dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
DW$373	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$373, DW_AT_name("close"), DW_AT_symbol_name("_close")
	.dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
DW$374	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$374, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
	.dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$65

DW$T$60	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$59)
	.dwattr DW$T$60, DW_AT_address_class(0x20)

DW$T$25	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$375	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
	.dwendtag DW$T$25

DW$T$64	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
	.dwattr DW$T$64, DW_AT_address_class(0x20)
DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_JobHandle"), DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)

DW$T$54	.dwtag  DW_TAG_union_type
	.dwattr DW$T$54, DW_AT_byte_size(0x18)
DW$376	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$376, DW_AT_name("iFrm"), DW_AT_symbol_name("_iFrm")
	.dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
DW$377	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$377, DW_AT_name("pFrm"), DW_AT_symbol_name("_pFrm")
	.dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
DW$378	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$378, DW_AT_name("riFrm"), DW_AT_symbol_name("_riFrm")
	.dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
DW$379	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$53)
	.dwattr DW$379, DW_AT_name("rpFrm"), DW_AT_symbol_name("_rpFrm")
	.dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$54


DW$T$59	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$56)
	.dwattr DW$T$59, DW_AT_language(DW_LANG_C)
DW$380	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$58)
DW$381	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$59


DW$T$63	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$382	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$383	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
DW$384	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$63

DW$T$23	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
	.dwattr DW$T$23, DW_AT_address_class(0x20)
DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_IFrame"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_PFrame"), DW_AT_type(*DW$T$47)
	.dwattr DW$T$51, DW_AT_language(DW_LANG_C)
DW$T$52	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawIFrame"), DW_AT_type(*DW$T$48)
	.dwattr DW$T$52, DW_AT_language(DW_LANG_C)
DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawPFrame"), DW_AT_type(*DW$T$49)
	.dwattr DW$T$53, DW_AT_language(DW_LANG_C)
DW$T$56	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Handle"), DW_AT_type(*DW$T$3)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)

DW$T$46	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$46, DW_AT_name("FVID_IFrame")
	.dwattr DW$T$46, DW_AT_byte_size(0x18)
DW$385	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$385, DW_AT_name("y1"), DW_AT_symbol_name("_y1")
	.dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
DW$386	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$386, DW_AT_name("cb1"), DW_AT_symbol_name("_cb1")
	.dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
DW$387	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$387, DW_AT_name("cr1"), DW_AT_symbol_name("_cr1")
	.dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
DW$388	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$388, DW_AT_name("y2"), DW_AT_symbol_name("_y2")
	.dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
DW$389	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$389, DW_AT_name("cb2"), DW_AT_symbol_name("_cb2")
	.dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
DW$390	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$390, DW_AT_name("cr2"), DW_AT_symbol_name("_cr2")
	.dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$46


DW$T$47	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$47, DW_AT_name("FVID_PFrame")
	.dwattr DW$T$47, DW_AT_byte_size(0x0c)
DW$391	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$391, DW_AT_name("y"), DW_AT_symbol_name("_y")
	.dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
DW$392	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$392, DW_AT_name("cb"), DW_AT_symbol_name("_cb")
	.dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
DW$393	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$393, DW_AT_name("cr"), DW_AT_symbol_name("_cr")
	.dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$47


DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$48, DW_AT_name("FVID_RawIFrame")
	.dwattr DW$T$48, DW_AT_byte_size(0x08)
DW$394	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$394, DW_AT_name("buf1"), DW_AT_symbol_name("_buf1")
	.dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
DW$395	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$395, DW_AT_name("buf2"), DW_AT_symbol_name("_buf2")
	.dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$48


DW$T$49	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$49, DW_AT_name("FVID_RawPFrame")
	.dwattr DW$T$49, DW_AT_byte_size(0x04)
DW$396	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$396, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
	.dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$49

DW$T$45	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$44)
	.dwattr DW$T$45, DW_AT_address_class(0x20)

	.dwattr DW$65, DW_AT_type(*DW$T$22)
	.dwattr DW$68, DW_AT_type(*DW$T$22)
	.dwattr DW$49, DW_AT_type(*DW$T$22)
	.dwattr DW$60, DW_AT_type(*DW$T$22)
	.dwattr DW$58, DW_AT_type(*DW$T$22)
	.dwattr DW$116, DW_AT_type(*DW$T$22)
	.dwattr DW$172, DW_AT_type(*DW$T$22)
	.dwattr DW$122, DW_AT_type(*DW$T$22)
	.dwattr DW$180, DW_AT_type(*DW$T$22)
	.dwattr DW$55, DW_AT_type(*DW$T$22)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$397	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$397, DW_AT_location[DW_OP_reg0]
DW$398	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$398, DW_AT_location[DW_OP_reg1]
DW$399	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$399, DW_AT_location[DW_OP_reg2]
DW$400	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$400, DW_AT_location[DW_OP_reg3]
DW$401	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$401, DW_AT_location[DW_OP_reg4]
DW$402	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$402, DW_AT_location[DW_OP_reg5]
DW$403	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$403, DW_AT_location[DW_OP_reg6]
DW$404	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$404, DW_AT_location[DW_OP_reg7]
DW$405	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$405, DW_AT_location[DW_OP_reg8]
DW$406	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$406, DW_AT_location[DW_OP_reg9]
DW$407	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$407, DW_AT_location[DW_OP_reg10]
DW$408	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$408, DW_AT_location[DW_OP_reg11]
DW$409	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$409, DW_AT_location[DW_OP_reg12]
DW$410	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$410, DW_AT_location[DW_OP_reg13]
DW$411	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$411, DW_AT_location[DW_OP_reg14]
DW$412	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$412, DW_AT_location[DW_OP_reg15]
DW$413	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$413, DW_AT_location[DW_OP_reg16]
DW$414	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$414, DW_AT_location[DW_OP_reg17]
DW$415	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$415, DW_AT_location[DW_OP_reg18]
DW$416	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$416, DW_AT_location[DW_OP_reg19]
DW$417	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$417, DW_AT_location[DW_OP_reg20]
DW$418	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$418, DW_AT_location[DW_OP_reg21]
DW$419	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$419, DW_AT_location[DW_OP_reg22]
DW$420	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$420, DW_AT_location[DW_OP_reg23]
DW$421	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$421, DW_AT_location[DW_OP_reg24]
DW$422	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$422, DW_AT_location[DW_OP_reg25]
DW$423	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$423, DW_AT_location[DW_OP_reg26]
DW$424	.dwtag  DW_TAG_assign_register, DW_AT_name("B11")
	.dwattr DW$424, DW_AT_location[DW_OP_reg27]
DW$425	.dwtag  DW_TAG_assign_register, DW_AT_name("B12")
	.dwattr DW$425, DW_AT_location[DW_OP_reg28]
DW$426	.dwtag  DW_TAG_assign_register, DW_AT_name("B13")
	.dwattr DW$426, DW_AT_location[DW_OP_reg29]
DW$427	.dwtag  DW_TAG_assign_register, DW_AT_name("DP")
	.dwattr DW$427, DW_AT_location[DW_OP_reg30]
