;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Mon Oct 18 16:46:42 2010                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

DW$204	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$45


DW$T$48	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
DW$205	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$206	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
DW$207	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$48


DW$T$60	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$60, DW_AT_language(DW_LANG_C)
DW$208	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
DW$209	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$210	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
DW$211	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
DW$212	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$213	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$59)
DW$214	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$60


DW$T$64	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$64, DW_AT_language(DW_LANG_C)
DW$215	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$216	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
	.dwendtag DW$T$64

DW$T$131	.dwtag  DW_TAG_typedef, DW_AT_name("Fxn"), DW_AT_type(*DW$T$130)
	.dwattr DW$T$131, DW_AT_language(DW_LANG_C)

DW$T$182	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$182, DW_AT_language(DW_LANG_C)

DW$T$185	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$185, DW_AT_language(DW_LANG_C)
DW$217	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$218	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$184)
	.dwendtag DW$T$185


DW$T$186	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$186, DW_AT_language(DW_LANG_C)
DW$219	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$220	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
	.dwendtag DW$T$186


DW$T$190	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$190, DW_AT_language(DW_LANG_C)
DW$221	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$190


DW$T$192	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$192, DW_AT_language(DW_LANG_C)
DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$T$34	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$34, DW_AT_language(DW_LANG_C)
DW$T$89	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Handle"), DW_AT_type(*DW$T$34)
	.dwattr DW$T$89, DW_AT_language(DW_LANG_C)

DW$T$222	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$222, DW_AT_language(DW_LANG_C)
DW$222	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$223	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
	.dwendtag DW$T$222


DW$T$223	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$223, DW_AT_language(DW_LANG_C)
DW$224	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$223


DW$T$224	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$224, DW_AT_language(DW_LANG_C)
DW$225	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
	.dwendtag DW$T$224


DW$T$225	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$225, DW_AT_language(DW_LANG_C)

DW$T$226	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$226, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$226, DW_AT_byte_size(0x84)
DW$226	.dwtag  DW_TAG_subrange_type
	.dwattr DW$226, DW_AT_upper_bound(0x20)
	.dwendtag DW$T$226

DW$T$227	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$227, DW_AT_type(*DW$T$11)
DW$T$111	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Handle"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$111, DW_AT_language(DW_LANG_C)
DW$T$175	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Handle"), DW_AT_type(*DW$T$174)
	.dwattr DW$T$175, DW_AT_language(DW_LANG_C)
DW$T$245	.dwtag  DW_TAG_typedef, DW_AT_name("SEM_Obj"), DW_AT_type(*DW$T$30)
	.dwattr DW$T$245, DW_AT_language(DW_LANG_C)
DW$T$133	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$132)
	.dwattr DW$T$133, DW_AT_address_class(0x20)
DW$T$150	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$149)
	.dwattr DW$T$150, DW_AT_address_class(0x20)
DW$T$56	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
	.dwattr DW$T$56, DW_AT_address_class(0x20)
DW$T$184	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$183)
	.dwattr DW$T$184, DW_AT_address_class(0x20)
DW$T$53	.dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$52)
	.dwattr DW$T$53, DW_AT_language(DW_LANG_C)
DW$T$126	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$125)
	.dwattr DW$T$126, DW_AT_address_class(0x20)
DW$T$256	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$67)
	.dwattr DW$T$256, DW_AT_language(DW_LANG_C)

DW$T$269	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$268)
	.dwattr DW$T$269, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$269, DW_AT_byte_size(0xc90)
DW$227	.dwtag  DW_TAG_subrange_type
	.dwattr DW$227, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$269

DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x20)
DW$T$58	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
	.dwattr DW$T$58, DW_AT_address_class(0x20)
DW$T$142	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$141)
	.dwattr DW$T$142, DW_AT_address_class(0x20)
DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$93, DW_AT_language(DW_LANG_C)
DW$T$130	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$129)
	.dwattr DW$T$130, DW_AT_address_class(0x20)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$19	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$19, DW_AT_address_class(0x20)

DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$30, DW_AT_name("SEM_Obj")
	.dwattr DW$T$30, DW_AT_byte_size(0x1c)
DW$228	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$228, DW_AT_name("job"), DW_AT_symbol_name("_job")
	.dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
DW$229	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$229, DW_AT_name("count"), DW_AT_symbol_name("_count")
	.dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
DW$230	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$230, DW_AT_name("pendQ"), DW_AT_symbol_name("_pendQ")
	.dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$30

DW$T$174	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$174, DW_AT_address_class(0x20)
DW$T$132	.dwtag  DW_TAG_typedef, DW_AT_name("HWI_Attrs"), DW_AT_type(*DW$T$33)
	.dwattr DW$T$132, DW_AT_language(DW_LANG_C)
DW$T$149	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Config"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$149, DW_AT_language(DW_LANG_C)
DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$54)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$T$183	.dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$40)
	.dwattr DW$T$183, DW_AT_language(DW_LANG_C)
DW$T$52	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
	.dwattr DW$T$52, DW_AT_address_class(0x20)
DW$T$125	.dwtag  DW_TAG_const_type
	.dwattr DW$T$125, DW_AT_type(*DW$T$51)

DW$T$67	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$67, DW_AT_name("IOM_Fxns")
	.dwattr DW$T$67, DW_AT_byte_size(0x18)
DW$231	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$44)
	.dwattr DW$231, DW_AT_name("mdBindDev"), DW_AT_symbol_name("_mdBindDev")
	.dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
DW$232	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
	.dwattr DW$232, DW_AT_name("mdUnBindDev"), DW_AT_symbol_name("_mdUnBindDev")
	.dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
DW$233	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$233, DW_AT_name("mdControlChan"), DW_AT_symbol_name("_mdControlChan")
	.dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
DW$234	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$234, DW_AT_name("mdCreateChan"), DW_AT_symbol_name("_mdCreateChan")
	.dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
DW$235	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
	.dwattr DW$235, DW_AT_name("mdDeleteChan"), DW_AT_symbol_name("_mdDeleteChan")
	.dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
DW$236	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$236, DW_AT_name("mdSubmitChan"), DW_AT_symbol_name("_mdSubmitChan")
	.dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$67

DW$T$268	.dwtag  DW_TAG_typedef, DW_AT_name("PortObj"), DW_AT_type(*DW$T$105)
	.dwattr DW$T$268, DW_AT_language(DW_LANG_C)

DW$T$57	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$57, DW_AT_language(DW_LANG_C)
DW$237	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$238	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
	.dwendtag DW$T$57

DW$T$9	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$9, DW_AT_byte_size(0x02)
DW$T$44	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdBindDev"), DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_language(DW_LANG_C)
DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdUnBindDev"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
DW$T$63	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdDeleteChan"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$T$50	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdControlChan"), DW_AT_type(*DW$T$49)
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$T$62	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdCreateChan"), DW_AT_type(*DW$T$61)
	.dwattr DW$T$62, DW_AT_language(DW_LANG_C)
DW$T$66	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdSubmitChan"), DW_AT_type(*DW$T$65)
	.dwattr DW$T$66, DW_AT_language(DW_LANG_C)

DW$T$129	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$129, DW_AT_language(DW_LANG_C)

DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_name("QUE_Elem")
	.dwattr DW$T$20, DW_AT_byte_size(0x08)
DW$239	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$239, DW_AT_name("next"), DW_AT_symbol_name("_next")
	.dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
DW$240	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$240, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
	.dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20

DW$T$21	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Job"), DW_AT_type(*DW$T$28)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)

DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$33, DW_AT_name("HWI_Attrs")
	.dwattr DW$T$33, DW_AT_byte_size(0x0c)
DW$241	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$241, DW_AT_name("intrMask"), DW_AT_symbol_name("_intrMask")
	.dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
DW$242	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$242, DW_AT_name("ccMask"), DW_AT_symbol_name("_ccMask")
	.dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
DW$243	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$243, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
	.dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$33


DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$35, DW_AT_byte_size(0x18)
DW$244	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$244, DW_AT_name("opt"), DW_AT_symbol_name("_opt")
	.dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
DW$245	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$245, DW_AT_name("src"), DW_AT_symbol_name("_src")
	.dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
DW$246	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$246, DW_AT_name("cnt"), DW_AT_symbol_name("_cnt")
	.dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
DW$247	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$247, DW_AT_name("dst"), DW_AT_symbol_name("_dst")
	.dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
DW$248	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$248, DW_AT_name("idx"), DW_AT_symbol_name("_idx")
	.dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
DW$249	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$249, DW_AT_name("rld"), DW_AT_symbol_name("_rld")
	.dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$35

DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)

DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$40, DW_AT_byte_size(0x58)
DW$250	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$250, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
	.dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
DW$251	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$251, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
	.dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
DW$252	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$252, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
DW$253	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$253, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
DW$254	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$254, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
	.dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
DW$255	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$255, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
	.dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
DW$256	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$256, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
	.dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
DW$257	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$257, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
	.dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
DW$258	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$258, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
	.dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
DW$259	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$259, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
	.dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
DW$260	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$260, DW_AT_name("sse"), DW_AT_symbol_name("_sse")
	.dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
DW$261	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$261, DW_AT_name("vcvblnkp"), DW_AT_symbol_name("_vcvblnkp")
	.dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
DW$262	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$262, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
	.dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
DW$263	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$263, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
	.dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
DW$264	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$264, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
	.dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
DW$265	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$265, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
	.dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
DW$266	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$266, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
	.dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
DW$267	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$267, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
	.dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
DW$268	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$268, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
	.dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
DW$269	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$269, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
	.dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
DW$270	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$270, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
	.dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
DW$271	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$271, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
	.dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
DW$272	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$272, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
	.dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
DW$273	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$273, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
DW$274	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$274, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
	.dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
DW$275	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$275, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
	.dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
DW$276	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$276, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
	.dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$40

DW$T$51	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$51, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$51, DW_AT_byte_size(0x01)

DW$T$105	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$105, DW_AT_name("PortObj")
	.dwattr DW$T$105, DW_AT_byte_size(0x430)
DW$277	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$277, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
DW$278	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$278, DW_AT_name("base"), DW_AT_symbol_name("_base")
	.dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
DW$279	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$104)
	.dwattr DW$279, DW_AT_name("chanObj"), DW_AT_symbol_name("_chanObj")
	.dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$105

DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$T$32	.dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$32, DW_AT_language(DW_LANG_C)
DW$T$43	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
	.dwattr DW$T$43, DW_AT_address_class(0x20)
DW$T$46	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
	.dwattr DW$T$46, DW_AT_address_class(0x20)
DW$T$49	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$48)
	.dwattr DW$T$49, DW_AT_address_class(0x20)
DW$T$61	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$60)
	.dwattr DW$T$61, DW_AT_address_class(0x20)
DW$T$65	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$64)
	.dwattr DW$T$65, DW_AT_address_class(0x20)

DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$28, DW_AT_name("KNL_Job")
	.dwattr DW$T$28, DW_AT_byte_size(0x10)
DW$280	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$280, DW_AT_name("wListElem"), DW_AT_symbol_name("_wListElem")
	.dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
DW$281	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$281, DW_AT_name("wCount"), DW_AT_symbol_name("_wCount")
	.dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
DW$282	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$282, DW_AT_name("fxn"), DW_AT_symbol_name("_fxn")
	.dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$28


DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$38, DW_AT_name("DEV_Frame")
	.dwattr DW$T$38, DW_AT_byte_size(0x20)
DW$283	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$283, DW_AT_name("link"), DW_AT_symbol_name("_link")
	.dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
DW$284	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$284, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
	.dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
DW$285	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$285, DW_AT_name("size"), DW_AT_symbol_name("_size")
	.dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
DW$286	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$286, DW_AT_name("misc"), DW_AT_symbol_name("_misc")
	.dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
DW$287	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$287, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
	.dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
DW$288	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$288, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
	.dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
DW$289	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$289, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$38


DW$T$104	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$103)
	.dwattr DW$T$104, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$104, DW_AT_byte_size(0x428)
DW$290	.dwtag  DW_TAG_subrange_type
	.dwattr DW$290, DW_AT_upper_bound(0x01)
	.dwendtag DW$T$104

DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_Fxn"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)
DW$T$103	.dwtag  DW_TAG_typedef, DW_AT_name("_VPORT_ChanObj"), DW_AT_type(*DW$T$102)
	.dwattr DW$T$103, DW_AT_language(DW_LANG_C)
DW$T$26	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
	.dwattr DW$T$26, DW_AT_address_class(0x20)

DW$T$102	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$102, DW_AT_byte_size(0x214)
DW$291	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$291, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
DW$292	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$292, DW_AT_name("portNum"), DW_AT_symbol_name("_portNum")
	.dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
DW$293	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$293, DW_AT_name("chanNum"), DW_AT_symbol_name("_chanNum")
	.dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
DW$294	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$294, DW_AT_name("base"), DW_AT_symbol_name("_base")
	.dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
DW$295	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$295, DW_AT_name("edmaChanNum"), DW_AT_symbol_name("_edmaChanNum")
	.dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
DW$296	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
	.dwattr DW$296, DW_AT_name("edmaAddr"), DW_AT_symbol_name("_edmaAddr")
	.dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
DW$297	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$297, DW_AT_name("vIntMask"), DW_AT_symbol_name("_vIntMask")
	.dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
DW$298	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
	.dwattr DW$298, DW_AT_name("viops"), DW_AT_symbol_name("_viops")
	.dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
DW$299	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$299, DW_AT_name("qIn"), DW_AT_symbol_name("_qIn")
	.dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x16c]
	.dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
DW$300	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$300, DW_AT_name("qOut"), DW_AT_symbol_name("_qOut")
	.dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x174]
	.dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
DW$301	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
	.dwattr DW$301, DW_AT_name("hEdma"), DW_AT_symbol_name("_hEdma")
	.dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x17c]
	.dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
DW$302	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
	.dwattr DW$302, DW_AT_name("hRld"), DW_AT_symbol_name("_hRld")
	.dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x188]
	.dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
DW$303	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
	.dwattr DW$303, DW_AT_name("tcc"), DW_AT_symbol_name("_tcc")
	.dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a0]
	.dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
DW$304	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$304, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ac]
	.dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
DW$305	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
	.dwattr DW$305, DW_AT_name("cbFxn"), DW_AT_symbol_name("_cbFxn")
	.dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b0]
	.dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
DW$306	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$32)
	.dwattr DW$306, DW_AT_name("cbArg"), DW_AT_symbol_name("_cbArg")
	.dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b4]
	.dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
DW$307	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
	.dwattr DW$307, DW_AT_name("vIntFxn"), DW_AT_symbol_name("_vIntFxn")
	.dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b8]
	.dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
DW$308	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$98)
	.dwattr DW$308, DW_AT_name("queEmpty"), DW_AT_symbol_name("_queEmpty")
	.dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x1bc]
	.dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
DW$309	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$309, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x1be]
	.dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
DW$310	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$94)
	.dwattr DW$310, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c0]
	.dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
DW$311	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$311, DW_AT_name("yPitch"), DW_AT_symbol_name("_yPitch")
	.dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c4]
	.dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
DW$312	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$312, DW_AT_name("cPitch"), DW_AT_symbol_name("_cPitch")
	.dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c8]
	.dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
DW$313	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$313, DW_AT_name("numLines"), DW_AT_symbol_name("_numLines")
	.dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x1cc]
	.dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
DW$314	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$314, DW_AT_name("numPixels"), DW_AT_symbol_name("_numPixels")
	.dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d0]
	.dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
DW$315	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$315, DW_AT_name("numLinesFld1"), DW_AT_symbol_name("_numLinesFld1")
	.dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d4]
	.dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
DW$316	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$316, DW_AT_name("numFrms"), DW_AT_symbol_name("_numFrms")
	.dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d8]
	.dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
DW$317	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$317, DW_AT_name("numEvents"), DW_AT_symbol_name("_numEvents")
	.dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1dc]
	.dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
DW$318	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$318, DW_AT_name("numEventsFld1"), DW_AT_symbol_name("_numEventsFld1")
	.dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
	.dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
DW$319	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$319, DW_AT_name("yThrld"), DW_AT_symbol_name("_yThrld")
	.dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e4]
	.dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
DW$320	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$320, DW_AT_name("cThrld"), DW_AT_symbol_name("_cThrld")
	.dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e8]
	.dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
DW$321	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
	.dwattr DW$321, DW_AT_name("curViop"), DW_AT_symbol_name("_curViop")
	.dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x1ec]
	.dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
DW$322	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
	.dwattr DW$322, DW_AT_name("nextViop"), DW_AT_symbol_name("_nextViop")
	.dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f0]
	.dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
DW$323	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
	.dwattr DW$323, DW_AT_name("mrViop"), DW_AT_symbol_name("_mrViop")
	.dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f4]
	.dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
DW$324	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$324, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
	.dwattr DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f8]
	.dwattr DW$324, DW_AT_accessibility(DW_ACCESS_public)
DW$325	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$101)
	.dwattr DW$325, DW_AT_name("edcFxns"), DW_AT_symbol_name("_edcFxns")
	.dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x1fc]
	.dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
DW$326	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$326, DW_AT_name("edcHandle"), DW_AT_symbol_name("_edcHandle")
	.dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x200]
	.dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
DW$327	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$327, DW_AT_name("packetIOM"), DW_AT_symbol_name("_packetIOM")
	.dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x204]
	.dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
DW$328	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$328, DW_AT_name("vIntCbArg"), DW_AT_symbol_name("_vIntCbArg")
	.dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x208]
	.dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
DW$329	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$329, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
	.dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x20c]
	.dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
DW$330	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$330, DW_AT_name("bufSz"), DW_AT_symbol_name("_bufSz")
	.dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x210]
	.dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$102


DW$T$25	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$331	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
	.dwendtag DW$T$25

DW$T$97	.dwtag  DW_TAG_typedef, DW_AT_name("VPORT_IntCallBack"), DW_AT_type(*DW$T$96)
	.dwattr DW$T$97, DW_AT_language(DW_LANG_C)
DW$T$98	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$98, DW_AT_type(*DW$T$94)

DW$T$92	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$92, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$92, DW_AT_byte_size(0x0c)
DW$332	.dwtag  DW_TAG_subrange_type
	.dwattr DW$332, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$92


DW$T$86	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$31)
	.dwattr DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$86, DW_AT_byte_size(0x0c)
DW$333	.dwtag  DW_TAG_subrange_type
	.dwattr DW$333, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$86


DW$T$90	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$90, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$90, DW_AT_byte_size(0x0c)
DW$334	.dwtag  DW_TAG_subrange_type
	.dwattr DW$334, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$90


DW$T$91	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$89)
	.dwattr DW$T$91, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$91, DW_AT_byte_size(0x18)
DW$335	.dwtag  DW_TAG_subrange_type
	.dwattr DW$335, DW_AT_upper_bound(0x05)
	.dwendtag DW$T$91

DW$T$24	.dwtag  DW_TAG_typedef, DW_AT_name("KNL_JobHandle"), DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)

DW$T$88	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$87)
	.dwattr DW$T$88, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$88, DW_AT_byte_size(0x140)
DW$336	.dwtag  DW_TAG_subrange_type
	.dwattr DW$336, DW_AT_upper_bound(0x09)
	.dwendtag DW$T$88

DW$T$99	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$87)
	.dwattr DW$T$99, DW_AT_address_class(0x20)
DW$T$101	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$100)
	.dwattr DW$T$101, DW_AT_address_class(0x20)
DW$T$96	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$95)
	.dwattr DW$T$96, DW_AT_address_class(0x20)
DW$T$23	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
	.dwattr DW$T$23, DW_AT_address_class(0x20)
DW$T$87	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_Frame"), DW_AT_type(*DW$T$79)
	.dwattr DW$T$87, DW_AT_language(DW_LANG_C)
DW$T$100	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$85)
	.dwattr DW$T$100, DW_AT_language(DW_LANG_C)

DW$T$95	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$95, DW_AT_language(DW_LANG_C)
DW$337	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
DW$338	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$95


DW$T$79	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$79, DW_AT_name("FVID_Frame")
	.dwattr DW$T$79, DW_AT_byte_size(0x20)
DW$339	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$339, DW_AT_name("queElement"), DW_AT_symbol_name("_queElement")
	.dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
DW$340	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
	.dwattr DW$340, DW_AT_name("frame"), DW_AT_symbol_name("_frame")
	.dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$79


DW$T$85	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$85, DW_AT_name("EDC_Fxns")
	.dwattr DW$T$85, DW_AT_byte_size(0x0c)
DW$341	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
	.dwattr DW$341, DW_AT_name("open"), DW_AT_symbol_name("_open")
	.dwattr DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$341, DW_AT_accessibility(DW_ACCESS_public)
DW$342	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$46)
	.dwattr DW$342, DW_AT_name("close"), DW_AT_symbol_name("_close")
	.dwattr DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$342, DW_AT_accessibility(DW_ACCESS_public)
DW$343	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$84)
	.dwattr DW$343, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
	.dwattr DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$343, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$85

DW$T$82	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$81)
	.dwattr DW$T$82, DW_AT_address_class(0x20)
DW$T$84	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$83)
	.dwattr DW$T$84, DW_AT_address_class(0x20)

DW$T$78	.dwtag  DW_TAG_union_type
	.dwattr DW$T$78, DW_AT_byte_size(0x18)
DW$344	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
	.dwattr DW$344, DW_AT_name("iFrm"), DW_AT_symbol_name("_iFrm")
	.dwattr DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$344, DW_AT_accessibility(DW_ACCESS_public)
DW$345	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
	.dwattr DW$345, DW_AT_name("pFrm"), DW_AT_symbol_name("_pFrm")
	.dwattr DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$345, DW_AT_accessibility(DW_ACCESS_public)
DW$346	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
	.dwattr DW$346, DW_AT_name("riFrm"), DW_AT_symbol_name("_riFrm")
	.dwattr DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$346, DW_AT_accessibility(DW_ACCESS_public)
DW$347	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
	.dwattr DW$347, DW_AT_name("rpFrm"), DW_AT_symbol_name("_rpFrm")
	.dwattr DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$347, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$78


DW$T$81	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$80)
	.dwattr DW$T$81, DW_AT_language(DW_LANG_C)
DW$348	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$53)
DW$349	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$81


DW$T$83	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$83, DW_AT_language(DW_LANG_C)
DW$350	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
DW$351	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
DW$352	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
	.dwendtag DW$T$83

DW$T$74	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_IFrame"), DW_AT_type(*DW$T$70)
	.dwattr DW$T$74, DW_AT_language(DW_LANG_C)
DW$T$75	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_PFrame"), DW_AT_type(*DW$T$71)
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)
DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawIFrame"), DW_AT_type(*DW$T$72)
	.dwattr DW$T$76, DW_AT_language(DW_LANG_C)
DW$T$77	.dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawPFrame"), DW_AT_type(*DW$T$73)
	.dwattr DW$T$77, DW_AT_language(DW_LANG_C)
DW$T$80	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Handle"), DW_AT_type(*DW$T$3)
	.dwattr DW$T$80, DW_AT_language(DW_LANG_C)

DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$70, DW_AT_name("FVID_IFrame")
	.dwattr DW$T$70, DW_AT_byte_size(0x18)
DW$353	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$353, DW_AT_name("y1"), DW_AT_symbol_name("_y1")
	.dwattr DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$353, DW_AT_accessibility(DW_ACCESS_public)
DW$354	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$354, DW_AT_name("cb1"), DW_AT_symbol_name("_cb1")
	.dwattr DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$354, DW_AT_accessibility(DW_ACCESS_public)
DW$355	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$355, DW_AT_name("cr1"), DW_AT_symbol_name("_cr1")
	.dwattr DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$355, DW_AT_accessibility(DW_ACCESS_public)
DW$356	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$356, DW_AT_name("y2"), DW_AT_symbol_name("_y2")
	.dwattr DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$356, DW_AT_accessibility(DW_ACCESS_public)
DW$357	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$357, DW_AT_name("cb2"), DW_AT_symbol_name("_cb2")
	.dwattr DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$357, DW_AT_accessibility(DW_ACCESS_public)
DW$358	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$358, DW_AT_name("cr2"), DW_AT_symbol_name("_cr2")
	.dwattr DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$358, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$70


DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$71, DW_AT_name("FVID_PFrame")
	.dwattr DW$T$71, DW_AT_byte_size(0x0c)
DW$359	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$359, DW_AT_name("y"), DW_AT_symbol_name("_y")
	.dwattr DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$359, DW_AT_accessibility(DW_ACCESS_public)
DW$360	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$360, DW_AT_name("cb"), DW_AT_symbol_name("_cb")
	.dwattr DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$360, DW_AT_accessibility(DW_ACCESS_public)
DW$361	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$361, DW_AT_name("cr"), DW_AT_symbol_name("_cr")
	.dwattr DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$361, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$71


DW$T$72	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$72, DW_AT_name("FVID_RawIFrame")
	.dwattr DW$T$72, DW_AT_byte_size(0x08)
DW$362	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$362, DW_AT_name("buf1"), DW_AT_symbol_name("_buf1")
	.dwattr DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$362, DW_AT_accessibility(DW_ACCESS_public)
DW$363	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$363, DW_AT_name("buf2"), DW_AT_symbol_name("_buf2")
	.dwattr DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$363, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$72


DW$T$73	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$73, DW_AT_name("FVID_RawPFrame")
	.dwattr DW$T$73, DW_AT_byte_size(0x04)
DW$364	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$364, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
	.dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$73

DW$T$69	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$68)
	.dwattr DW$T$69, DW_AT_address_class(0x20)
DW$T$68	.dwtag  DW_TAG_typedef, DW_AT_name("Char"), DW_AT_type(*DW$T$51)
	.dwattr DW$T$68, DW_AT_language(DW_LANG_C)

	.dwattr DW$62, DW_AT_type(*DW$T$22)
	.dwattr DW$65, DW_AT_type(*DW$T$22)
	.dwattr DW$54, DW_AT_type(*DW$T$22)
	.dwattr DW$51, DW_AT_type(*DW$T$22)
	.dwattr DW$49, DW_AT_type(*DW$T$22)
	.dwattr DW$109, DW_AT_type(*DW$T$22)
	.dwattr DW$160, DW_AT_type(*DW$T$22)
	.dwattr DW$115, DW_AT_type(*DW$T$22)
	.dwattr DW$164, DW_AT_type(*DW$T$22)
	.dwattr DW$46, DW_AT_type(*DW$T$22)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$365	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$365, DW_AT_location[DW_OP_reg0]
DW$366	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$366, DW_AT_location[DW_OP_reg1]
DW$367	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$367, DW_AT_location[DW_OP_reg2]
DW$368	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$368, DW_AT_location[DW_OP_reg3]
DW$369	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$369, DW_AT_location[DW_OP_reg4]
DW$370	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$370, DW_AT_location[DW_OP_reg5]
DW$371	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$371, DW_AT_location[DW_OP_reg6]
DW$372	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$372, DW_AT_location[DW_OP_reg7]
DW$373	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$373, DW_AT_location[DW_OP_reg8]
DW$374	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$374, DW_AT_location[DW_OP_reg9]
DW$375	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$375, DW_AT_location[DW_OP_reg10]
DW$376	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$376, DW_AT_location[DW_OP_reg11]
DW$377	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$377, DW_AT_location[DW_OP_reg12]
DW$378	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$378, DW_AT_location[DW_OP_reg13]
DW$379	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$379, DW_AT_location[DW_OP_reg14]
DW$380	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$380, DW_AT_location[DW_OP_reg15]
DW$381	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$381, DW_AT_location[DW_OP_reg16]
DW$382	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$382, DW_AT_location[DW_OP_reg17]
DW$383	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$383, DW_AT_location[DW_OP_reg18]
DW$384	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$384, DW_AT_location[DW_OP_reg19]
DW$385	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$385, DW_AT_location[DW_OP_reg20]
DW$386	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$386, DW_AT_location[DW_OP_reg21]
DW$387	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$387, DW_AT_location[DW_OP_reg22]
DW$388	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$388, DW_AT_location[DW_OP_reg23]
DW$389	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$389, DW_AT_location[DW_OP_reg24]
DW$390	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$390, DW_AT_location[DW_OP_reg25]
DW$391	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$391, DW_AT_location[DW_OP_reg26]
DW$392	.dwtag  DW_TAG_assign_register, DW_AT_name("B11")
	.dwattr DW$392, DW_AT_location[DW_OP_reg27]
DW$393	.dwtag  DW_TAG_assign_register, DW_AT_name("B12")
	.dwattr DW$393, DW_AT_location[DW_OP_reg28]
DW$394	.dwtag  DW_TAG_assign_register, DW_AT_name("B13")
	.dwattr DW$394, DW_AT_location[DW_OP_reg29]
