;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Mon Nov 01 16:08:09 2010                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

DW$T$31	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$127	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$31


DW$T$33	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
DW$128	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$129	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$33


DW$T$35	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$35, DW_AT_language(DW_LANG_C)
DW$130	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
DW$131	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$35


DW$T$37	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$37, DW_AT_language(DW_LANG_C)
DW$132	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$133	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
DW$134	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$37

DW$T$28	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
	.dwattr DW$T$28, DW_AT_address_class(0x20)

DW$T$42	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)
DW$135	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$42


DW$T$45	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$45, DW_AT_language(DW_LANG_C)
DW$136	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$44)
	.dwendtag DW$T$45


DW$T$47	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
DW$137	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$6)
	.dwendtag DW$T$47


DW$T$48	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)
DW$T$24	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_address_class(0x20)
DW$T$51	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$51, DW_AT_address_class(0x20)

DW$T$54	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$54, DW_AT_byte_size(0x8d)
DW$138	.dwtag  DW_TAG_subrange_type
	.dwattr DW$138, DW_AT_upper_bound(0x8c)
	.dwendtag DW$T$54


DW$T$55	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$55, DW_AT_byte_size(0x10c)
DW$139	.dwtag  DW_TAG_subrange_type
	.dwattr DW$139, DW_AT_upper_bound(0x10b)
	.dwendtag DW$T$55

DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)

DW$T$56	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)

DW$T$58	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)
DW$140	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$141	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$142	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
	.dwendtag DW$T$58


DW$T$59	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$59, DW_AT_language(DW_LANG_C)
DW$143	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
DW$144	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$145	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
DW$146	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$147	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$44)
	.dwendtag DW$T$59


DW$T$61	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$61, DW_AT_language(DW_LANG_C)
DW$148	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$61


DW$T$63	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$149	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
DW$150	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$63


DW$T$65	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$65, DW_AT_language(DW_LANG_C)
DW$151	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$21)
DW$152	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$T$65


DW$T$67	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)
DW$153	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
	.dwendtag DW$T$67


DW$T$69	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$69, DW_AT_language(DW_LANG_C)
DW$154	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$44)
	.dwendtag DW$T$69


DW$T$70	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$70, DW_AT_language(DW_LANG_C)
DW$155	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$52)
	.dwendtag DW$T$70


DW$T$71	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$71, DW_AT_language(DW_LANG_C)
DW$156	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
DW$157	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$44)
	.dwendtag DW$T$71

DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$29	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
DW$T$21	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$21, DW_AT_address_class(0x20)
DW$T$44	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$44, DW_AT_address_class(0x20)
DW$T$27	.dwtag  DW_TAG_const_type
DW$T$23	.dwtag  DW_TAG_const_type
	.dwattr DW$T$23, DW_AT_type(*DW$T$6)
DW$T$52	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
	.dwattr DW$T$52, DW_AT_address_class(0x20)
DW$T$20	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$20, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$20, DW_AT_byte_size(0x01)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("RSAKey")
	.dwattr DW$T$22, DW_AT_byte_size(0x24)
DW$158	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$158, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
DW$159	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$159, DW_AT_name("bytes"), DW_AT_symbol_name("_bytes")
	.dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
DW$160	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$160, DW_AT_name("modulus"), DW_AT_symbol_name("_modulus")
	.dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
DW$161	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$161, DW_AT_name("exponent"), DW_AT_symbol_name("_exponent")
	.dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
DW$162	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$162, DW_AT_name("private_exponent"), DW_AT_symbol_name("_private_exponent")
	.dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
DW$163	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$163, DW_AT_name("p"), DW_AT_symbol_name("_p")
	.dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
DW$164	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$164, DW_AT_name("q"), DW_AT_symbol_name("_q")
	.dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
DW$165	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$165, DW_AT_name("iqmp"), DW_AT_symbol_name("_iqmp")
	.dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
DW$166	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$166, DW_AT_name("comment"), DW_AT_symbol_name("_comment")
	.dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22


	.dwattr DW$56, DW_AT_external(0x01)
	.dwattr DW$56, DW_AT_type(*DW$T$10)
	.dwattr DW$45, DW_AT_external(0x01)
	.dwattr DW$45, DW_AT_type(*DW$T$10)
	.dwattr DW$109, DW_AT_external(0x01)
	.dwattr DW$109, DW_AT_type(*DW$T$10)
	.dwattr DW$101, DW_AT_external(0x01)
	.dwattr DW$103, DW_AT_external(0x01)
	.dwattr DW$103, DW_AT_type(*DW$T$10)
	.dwattr DW$120, DW_AT_external(0x01)
	.dwattr DW$120, DW_AT_type(*DW$T$10)
	.dwattr DW$67, DW_AT_external(0x01)
	.dwattr DW$67, DW_AT_type(*DW$T$10)
	.dwattr DW$68, DW_AT_external(0x01)
	.dwattr DW$40, DW_AT_external(0x01)
	.dwattr DW$40, DW_AT_type(*DW$T$3)
	.dwattr DW$95, DW_AT_external(0x01)
	.dwattr DW$95, DW_AT_type(*DW$T$3)
	.dwattr DW$70, DW_AT_external(0x01)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$167	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$167, DW_AT_location[DW_OP_reg0]
DW$168	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$168, DW_AT_location[DW_OP_reg1]
DW$169	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$169, DW_AT_location[DW_OP_reg2]
DW$170	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$170, DW_AT_location[DW_OP_reg3]
DW$171	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$171, DW_AT_location[DW_OP_reg4]
DW$172	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$172, DW_AT_location[DW_OP_reg5]
DW$173	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$173, DW_AT_location[DW_OP_reg6]
DW$174	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$174, DW_AT_location[DW_OP_reg7]
DW$175	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$175, DW_AT_location[DW_OP_reg8]
DW$176	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$176, DW_AT_location[DW_OP_reg9]
DW$177	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$177, DW_AT_location[DW_OP_reg10]
DW$178	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$178, DW_AT_location[DW_OP_reg11]
DW$179	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$179, DW_AT_location[DW_OP_reg12]
DW$180	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$180, DW_AT_location[DW_OP_reg13]
DW$181	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$181, DW_AT_location[DW_OP_reg14]
DW$182	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$182, DW_AT_location[DW_OP_reg15]
DW$183	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$183, DW_AT_location[DW_OP_reg16]
DW$184	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$184, DW_AT_location[DW_OP_reg17]
DW$185	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$185, DW_AT_location[DW_OP_reg18]
DW$186	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$186, DW_AT_location[DW_OP_reg19]
DW$187	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$187, DW_AT_location[DW_OP_reg20]
DW$188	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$188, DW_AT_location[DW_OP_reg21]
DW$189	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$189, DW_AT_location[DW_OP_reg22]
DW$190	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$190, DW_AT_location[DW_OP_reg23]
DW$191	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$191, DW_AT_location[DW_OP_reg24]
DW$192	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$192, DW_AT_location[DW_OP_reg25]
DW$193	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$193, DW_AT_location[DW_OP_reg26]
DW$194	.dwtag  DW_TAG_assign_register, DW_AT_name("B11")
	.dwattr DW$194, DW_AT_location[DW_OP_reg27]
DW$195	.dwtag  DW_TAG_assign_register, DW_AT_name("B12")
