;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Mon Nov 01 16:10:03 2010                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

DW$120	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$25


DW$T$28	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
DW$121	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$122	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$28


DW$T$33	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$33, DW_AT_language(DW_LANG_C)
DW$123	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$33


DW$T$35	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$35, DW_AT_language(DW_LANG_C)
DW$124	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$125	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
DW$126	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$127	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$T$35

DW$T$41	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$41, DW_AT_address_class(0x20)

DW$T$50	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$128	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
	.dwendtag DW$T$50


DW$T$53	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$53, DW_AT_language(DW_LANG_C)
DW$129	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$52)
DW$130	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$52)
	.dwendtag DW$T$53


DW$T$57	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$57, DW_AT_language(DW_LANG_C)
DW$131	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
	.dwendtag DW$T$57


DW$T$59	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$59, DW_AT_language(DW_LANG_C)
DW$132	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
DW$133	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$134	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$59


DW$T$61	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$61, DW_AT_language(DW_LANG_C)
DW$135	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$56)
DW$136	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$61


DW$T$63	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$137	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$138	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$139	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$63


DW$T$64	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$64, DW_AT_language(DW_LANG_C)
DW$140	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$141	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
DW$142	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$64


DW$T$66	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$66, DW_AT_language(DW_LANG_C)
DW$143	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$144	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
DW$145	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$146	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
DW$147	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$66


DW$T$68	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$68, DW_AT_language(DW_LANG_C)
DW$148	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$149	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$150	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$151	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$152	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$68

DW$T$27	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$27, DW_AT_address_class(0x20)
DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)

DW$T$37	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$37, DW_AT_language(DW_LANG_C)
DW$153	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$154	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
DW$155	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$156	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$T$37


DW$T$75	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)
DW$157	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
DW$158	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
DW$159	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
	.dwendtag DW$T$75

DW$T$49	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$49, DW_AT_address_class(0x20)
DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)
DW$T$52	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
	.dwattr DW$T$52, DW_AT_address_class(0x20)
DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x08)
	.dwattr DW$T$13, DW_AT_bit_size(0x28)
	.dwattr DW$T$13, DW_AT_bit_offset(0x18)
DW$T$56	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
	.dwattr DW$T$56, DW_AT_address_class(0x20)
DW$T$92	.dwtag  DW_TAG_const_type
	.dwattr DW$T$92, DW_AT_type(*DW$T$32)
DW$T$93	.dwtag  DW_TAG_const_type
	.dwattr DW$T$93, DW_AT_type(*DW$T$39)
DW$T$40	.dwtag  DW_TAG_const_type
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("word32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$51, DW_AT_language(DW_LANG_C)
DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("SHA_State"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)

DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$32, DW_AT_name("ssh_hash")
	.dwattr DW$T$32, DW_AT_byte_size(0x14)
DW$160	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$160, DW_AT_name("init"), DW_AT_symbol_name("_init")
	.dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
DW$161	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$161, DW_AT_name("bytes"), DW_AT_symbol_name("_bytes")
	.dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
DW$162	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$162, DW_AT_name("final"), DW_AT_symbol_name("_final")
	.dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
DW$163	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$163, DW_AT_name("hlen"), DW_AT_symbol_name("_hlen")
	.dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
DW$164	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$164, DW_AT_name("text_name"), DW_AT_symbol_name("_text_name")
	.dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32


DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$39, DW_AT_name("ssh_mac")
	.dwattr DW$T$39, DW_AT_byte_size(0x20)
DW$165	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$165, DW_AT_name("make_context"), DW_AT_symbol_name("_make_context")
	.dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
DW$166	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
	.dwattr DW$166, DW_AT_name("free_context"), DW_AT_symbol_name("_free_context")
	.dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
DW$167	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$167, DW_AT_name("setkey"), DW_AT_symbol_name("_setkey")
	.dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
DW$168	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$168, DW_AT_name("generate"), DW_AT_symbol_name("_generate")
	.dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
DW$169	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$169, DW_AT_name("verify"), DW_AT_symbol_name("_verify")
	.dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
DW$170	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$170, DW_AT_name("name"), DW_AT_symbol_name("_name")
	.dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
DW$171	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$171, DW_AT_name("len"), DW_AT_symbol_name("_len")
	.dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
DW$172	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$172, DW_AT_name("text_name"), DW_AT_symbol_name("_text_name")
	.dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$39

DW$T$24	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_address_class(0x20)
DW$T$26	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
	.dwattr DW$T$26, DW_AT_address_class(0x20)
DW$T$29	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
	.dwattr DW$T$29, DW_AT_address_class(0x20)
DW$T$34	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$34, DW_AT_address_class(0x20)
DW$T$36	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
	.dwattr DW$T$36, DW_AT_address_class(0x20)
DW$T$38	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
	.dwattr DW$T$38, DW_AT_address_class(0x20)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_byte_size(0x60)
DW$173	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$173, DW_AT_name("h"), DW_AT_symbol_name("_h")
	.dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
DW$174	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$174, DW_AT_name("block"), DW_AT_symbol_name("_block")
	.dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
DW$175	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$175, DW_AT_name("blkused"), DW_AT_symbol_name("_blkused")
	.dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
DW$176	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$176, DW_AT_name("lenhi"), DW_AT_symbol_name("_lenhi")
	.dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
DW$177	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$177, DW_AT_name("lenlo"), DW_AT_symbol_name("_lenlo")
	.dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22

DW$T$31	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$31, DW_AT_address_class(0x20)

DW$T$21	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$21, DW_AT_byte_size(0x40)
DW$178	.dwtag  DW_TAG_subrange_type
	.dwattr DW$178, DW_AT_upper_bound(0x3f)
	.dwendtag DW$T$21


DW$T$20	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$20, DW_AT_byte_size(0x14)
DW$179	.dwtag  DW_TAG_subrange_type
	.dwattr DW$179, DW_AT_upper_bound(0x04)
	.dwendtag DW$T$20

DW$T$30	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$30, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$30, DW_AT_byte_size(0x01)

	.dwattr DW$19, DW_AT_external(0x01)
	.dwattr DW$32, DW_AT_external(0x01)
	.dwattr DW$40, DW_AT_external(0x01)
	.dwattr DW$57, DW_AT_external(0x01)
	.dwattr DW$106, DW_AT_external(0x01)
	.dwattr DW$100, DW_AT_external(0x01)
	.dwattr DW$88, DW_AT_type(*DW$T$10)
	.dwattr DW$73, DW_AT_type(*DW$T$3)
	.dwattr DW$56, DW_AT_type(*DW$T$3)
	.dwattr DW$49, DW_AT_type(*DW$T$10)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$180	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$180, DW_AT_location[DW_OP_reg0]
DW$181	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$181, DW_AT_location[DW_OP_reg1]
DW$182	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$182, DW_AT_location[DW_OP_reg2]
DW$183	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$183, DW_AT_location[DW_OP_reg3]
DW$184	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$184, DW_AT_location[DW_OP_reg4]
DW$185	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$185, DW_AT_location[DW_OP_reg5]
DW$186	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$186, DW_AT_location[DW_OP_reg6]
DW$187	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$187, DW_AT_location[DW_OP_reg7]
DW$188	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$188, DW_AT_location[DW_OP_reg8]
DW$189	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$189, DW_AT_location[DW_OP_reg9]
DW$190	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$190, DW_AT_location[DW_OP_reg10]
DW$191	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$191, DW_AT_location[DW_OP_reg11]
DW$192	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$192, DW_AT_location[DW_OP_reg12]
DW$193	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$193, DW_AT_location[DW_OP_reg13]
DW$194	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$194, DW_AT_location[DW_OP_reg14]
DW$195	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$195, DW_AT_location[DW_OP_reg15]
DW$196	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$196, DW_AT_location[DW_OP_reg16]
DW$197	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$197, DW_AT_location[DW_OP_reg17]
DW$198	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$198, DW_AT_location[DW_OP_reg18]
DW$199	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$199, DW_AT_location[DW_OP_reg19]
DW$200	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$200, DW_AT_location[DW_OP_reg20]
DW$201	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$201, DW_AT_location[DW_OP_reg21]
DW$202	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$202, DW_AT_location[DW_OP_reg22]
DW$203	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$203, DW_AT_location[DW_OP_reg23]
DW$204	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$204, DW_AT_location[DW_OP_reg24]
