;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Mon Jul 30 09:25:51 2007                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

DW$269	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$65)
DW$270	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
DW$271	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$65)
DW$272	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
	.dwendtag DW$T$116

DW$T$40	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$40, DW_AT_address_class(0x20)

DW$T$42	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)
DW$273	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$274	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
	.dwendtag DW$T$42

DW$T$46	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$46, DW_AT_address_class(0x20)

DW$T$55	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$275	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$276	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
DW$277	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$278	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$41)
	.dwendtag DW$T$55

DW$T$62	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
	.dwattr DW$T$62, DW_AT_address_class(0x20)
DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)
DW$T$41	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$41, DW_AT_address_class(0x20)

DW$T$49	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$49, DW_AT_language(DW_LANG_C)
DW$279	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$280	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
DW$281	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$49


DW$T$51	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$51, DW_AT_language(DW_LANG_C)
DW$282	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$283	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$51


DW$T$53	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$53, DW_AT_language(DW_LANG_C)
DW$284	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$285	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
DW$286	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$287	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
DW$288	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$53


DW$T$145	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$145, DW_AT_language(DW_LANG_C)
DW$289	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
DW$290	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$87)
DW$291	.dwtag  DW_TAG_unspecified_parameters
	.dwendtag DW$T$145


DW$T$147	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$147, DW_AT_language(DW_LANG_C)
DW$292	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$69)
DW$293	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$69)
DW$294	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$70)
	.dwendtag DW$T$147


DW$T$148	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$148, DW_AT_language(DW_LANG_C)
DW$295	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$58)
	.dwendtag DW$T$148


DW$T$150	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$150, DW_AT_language(DW_LANG_C)
DW$296	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$58)
DW$297	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$150


DW$T$152	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$152, DW_AT_language(DW_LANG_C)
DW$298	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$58)
DW$299	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$58)
	.dwendtag DW$T$152

DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$70	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$70, DW_AT_language(DW_LANG_C)

DW$T$155	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$70)
	.dwattr DW$T$155, DW_AT_language(DW_LANG_C)
DW$300	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$87)
	.dwendtag DW$T$155

DW$T$89	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
	.dwattr DW$T$89, DW_AT_address_class(0x20)
DW$T$94	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$93)
	.dwattr DW$T$94, DW_AT_address_class(0x20)
DW$T$104	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
	.dwattr DW$T$104, DW_AT_address_class(0x20)
DW$T$33	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
	.dwattr DW$T$33, DW_AT_address_class(0x20)

DW$T$38	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$38, DW_AT_language(DW_LANG_C)
DW$301	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$38

DW$T$65	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$65, DW_AT_address_class(0x20)

DW$T$162	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$162, DW_AT_language(DW_LANG_C)
DW$302	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
DW$303	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$87)
	.dwendtag DW$T$162

DW$T$87	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$86)
	.dwattr DW$T$87, DW_AT_address_class(0x20)

DW$T$164	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$86)
	.dwattr DW$T$164, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$164, DW_AT_byte_size(0x11)
DW$304	.dwtag  DW_TAG_subrange_type
	.dwattr DW$304, DW_AT_upper_bound(0x10)
	.dwendtag DW$T$164

DW$T$167	.dwtag  DW_TAG_const_type
	.dwattr DW$T$167, DW_AT_type(*DW$T$57)
DW$T$68	.dwtag  DW_TAG_const_type
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)
DW$T$61	.dwtag  DW_TAG_const_type
	.dwattr DW$T$61, DW_AT_type(*DW$T$6)

DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$24, DW_AT_name("MD5Context")
	.dwattr DW$T$24, DW_AT_byte_size(0x5c)
DW$305	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$305, DW_AT_name("core"), DW_AT_symbol_name("_core")
	.dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
DW$306	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$306, DW_AT_name("block"), DW_AT_symbol_name("_block")
	.dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
DW$307	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$307, DW_AT_name("blkused"), DW_AT_symbol_name("_blkused")
	.dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
DW$308	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$308, DW_AT_name("lenhi"), DW_AT_symbol_name("_lenhi")
	.dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
DW$309	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$309, DW_AT_name("lenlo"), DW_AT_symbol_name("_lenlo")
	.dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$24

DW$T$93	.dwtag  DW_TAG_typedef, DW_AT_name("SHA_State"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$93, DW_AT_language(DW_LANG_C)
DW$T$103	.dwtag  DW_TAG_typedef, DW_AT_name("SHA512_State"), DW_AT_type(*DW$T$31)
	.dwattr DW$T$103, DW_AT_language(DW_LANG_C)
DW$T$32	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$32, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$32, DW_AT_byte_size(0x01)
DW$T$86	.dwtag  DW_TAG_const_type
	.dwattr DW$T$86, DW_AT_type(*DW$T$32)

DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$57, DW_AT_name("ssh_signkey")
	.dwattr DW$T$57, DW_AT_byte_size(0x38)
DW$310	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$35)
	.dwattr DW$310, DW_AT_name("newkey"), DW_AT_symbol_name("_newkey")
	.dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
DW$311	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$37)
	.dwattr DW$311, DW_AT_name("freekey"), DW_AT_symbol_name("_freekey")
	.dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
DW$312	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$312, DW_AT_name("fmtkey"), DW_AT_symbol_name("_fmtkey")
	.dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
DW$313	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
	.dwattr DW$313, DW_AT_name("public_blob"), DW_AT_symbol_name("_public_blob")
	.dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
DW$314	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$43)
	.dwattr DW$314, DW_AT_name("private_blob"), DW_AT_symbol_name("_private_blob")
	.dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
DW$315	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
	.dwattr DW$315, DW_AT_name("createkey"), DW_AT_symbol_name("_createkey")
	.dwattr DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$315, DW_AT_accessibility(DW_ACCESS_public)
DW$316	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$316, DW_AT_name("openssh_createkey"), DW_AT_symbol_name("_openssh_createkey")
	.dwattr DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$316, DW_AT_accessibility(DW_ACCESS_public)
DW$317	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
	.dwattr DW$317, DW_AT_name("openssh_fmtkey"), DW_AT_symbol_name("_openssh_fmtkey")
	.dwattr DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$317, DW_AT_accessibility(DW_ACCESS_public)
DW$318	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
	.dwattr DW$318, DW_AT_name("pubkey_bits"), DW_AT_symbol_name("_pubkey_bits")
	.dwattr DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$318, DW_AT_accessibility(DW_ACCESS_public)
DW$319	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$319, DW_AT_name("fingerprint"), DW_AT_symbol_name("_fingerprint")
	.dwattr DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$319, DW_AT_accessibility(DW_ACCESS_public)
DW$320	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
	.dwattr DW$320, DW_AT_name("verifysig"), DW_AT_symbol_name("_verifysig")
	.dwattr DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$320, DW_AT_accessibility(DW_ACCESS_public)
DW$321	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
	.dwattr DW$321, DW_AT_name("sign"), DW_AT_symbol_name("_sign")
	.dwattr DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$321, DW_AT_accessibility(DW_ACCESS_public)
DW$322	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$322, DW_AT_name("name"), DW_AT_symbol_name("_name")
	.dwattr DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$322, DW_AT_accessibility(DW_ACCESS_public)
DW$323	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
	.dwattr DW$323, DW_AT_name("keytype"), DW_AT_symbol_name("_keytype")
	.dwattr DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$323, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$57

DW$T$35	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$35, DW_AT_address_class(0x20)
DW$T$45	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$44)
	.dwattr DW$T$45, DW_AT_address_class(0x20)
DW$T$48	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
	.dwattr DW$T$48, DW_AT_address_class(0x20)
DW$T$37	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
	.dwattr DW$T$37, DW_AT_address_class(0x20)

DW$T$23	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$23, DW_AT_byte_size(0x40)
DW$324	.dwtag  DW_TAG_subrange_type
	.dwattr DW$324, DW_AT_upper_bound(0x3f)
	.dwendtag DW$T$23

DW$T$43	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$42)
	.dwattr DW$T$43, DW_AT_address_class(0x20)
DW$T$56	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$55)
	.dwattr DW$T$56, DW_AT_address_class(0x20)
DW$T$50	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$49)
	.dwattr DW$T$50, DW_AT_address_class(0x20)
DW$T$52	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$51)
	.dwattr DW$T$52, DW_AT_address_class(0x20)
DW$T$54	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$53)
	.dwattr DW$T$54, DW_AT_address_class(0x20)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
DW$T$22	.dwtag  DW_TAG_typedef, DW_AT_name("MD5_Core_State"), DW_AT_type(*DW$T$21)
	.dwattr DW$T$22, DW_AT_language(DW_LANG_C)

DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$26, DW_AT_byte_size(0x60)
DW$325	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$325, DW_AT_name("h"), DW_AT_symbol_name("_h")
	.dwattr DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$325, DW_AT_accessibility(DW_ACCESS_public)
DW$326	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$326, DW_AT_name("block"), DW_AT_symbol_name("_block")
	.dwattr DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$326, DW_AT_accessibility(DW_ACCESS_public)
DW$327	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$327, DW_AT_name("blkused"), DW_AT_symbol_name("_blkused")
	.dwattr DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$327, DW_AT_accessibility(DW_ACCESS_public)
DW$328	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$328, DW_AT_name("lenhi"), DW_AT_symbol_name("_lenhi")
	.dwattr DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$328, DW_AT_accessibility(DW_ACCESS_public)
DW$329	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$329, DW_AT_name("lenlo"), DW_AT_symbol_name("_lenlo")
	.dwattr DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr DW$329, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$26


DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$31, DW_AT_byte_size(0x118)
DW$330	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$330, DW_AT_name("h"), DW_AT_symbol_name("_h")
	.dwattr DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$330, DW_AT_accessibility(DW_ACCESS_public)
DW$331	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$331, DW_AT_name("block"), DW_AT_symbol_name("_block")
	.dwattr DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr DW$331, DW_AT_accessibility(DW_ACCESS_public)
DW$332	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$332, DW_AT_name("blkused"), DW_AT_symbol_name("_blkused")
	.dwattr DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr DW$332, DW_AT_accessibility(DW_ACCESS_public)
DW$333	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$333, DW_AT_name("len"), DW_AT_symbol_name("_len")
	.dwattr DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr DW$333, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$31

DW$T$39	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
	.dwattr DW$T$39, DW_AT_address_class(0x20)

DW$T$30	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$30, DW_AT_byte_size(0x80)
DW$334	.dwtag  DW_TAG_subrange_type
	.dwattr DW$334, DW_AT_upper_bound(0x7f)
	.dwendtag DW$T$30


DW$T$20	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$20, DW_AT_byte_size(0x10)
DW$335	.dwtag  DW_TAG_subrange_type
	.dwattr DW$335, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$20


DW$T$25	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$25, DW_AT_byte_size(0x14)
DW$336	.dwtag  DW_TAG_subrange_type
	.dwattr DW$336, DW_AT_upper_bound(0x04)
	.dwendtag DW$T$25


DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$21, DW_AT_byte_size(0x10)
DW$337	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$337, DW_AT_name("h"), DW_AT_symbol_name("_h")
	.dwattr DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$337, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$21


DW$T$29	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$28)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$29, DW_AT_byte_size(0x80)
DW$338	.dwtag  DW_TAG_subrange_type
	.dwattr DW$338, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$29

DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("uint64"), DW_AT_type(*DW$T$27)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)

DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$27, DW_AT_byte_size(0x10)
DW$339	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$339, DW_AT_name("hi"), DW_AT_symbol_name("_hi")
	.dwattr DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$339, DW_AT_accessibility(DW_ACCESS_public)
DW$340	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$340, DW_AT_name("lo"), DW_AT_symbol_name("_lo")
	.dwattr DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$340, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$27

DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x08)
	.dwattr DW$T$13, DW_AT_bit_size(0x28)
	.dwattr DW$T$13, DW_AT_bit_offset(0x18)

	.dwattr DW$208, DW_AT_type(*DW$T$3)
	.dwattr DW$199, DW_AT_type(*DW$T$33)
	.dwattr DW$184, DW_AT_type(*DW$T$33)
	.dwattr DW$143, DW_AT_type(*DW$T$3)
	.dwattr DW$181, DW_AT_type(*DW$T$3)
	.dwattr DW$162, DW_AT_type(*DW$T$10)
	.dwattr DW$153, DW_AT_type(*DW$T$40)
	.dwattr DW$150, DW_AT_type(*DW$T$10)
	.dwattr DW$113, DW_AT_type(*DW$T$40)
	.dwattr DW$100, DW_AT_type(*DW$T$40)
	.dwattr DW$92, DW_AT_type(*DW$T$10)
	.dwattr DW$140, DW_AT_type(*DW$T$58)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$341	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$341, DW_AT_location[DW_OP_reg0]
DW$342	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$342, DW_AT_location[DW_OP_reg1]
DW$343	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$343, DW_AT_location[DW_OP_reg2]
DW$344	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$344, DW_AT_location[DW_OP_reg3]
DW$345	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$345, DW_AT_location[DW_OP_reg4]
DW$346	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$346, DW_AT_location[DW_OP_reg5]
DW$347	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$347, DW_AT_location[DW_OP_reg6]
DW$348	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$348, DW_AT_location[DW_OP_reg7]
DW$349	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$349, DW_AT_location[DW_OP_reg8]
DW$350	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$350, DW_AT_location[DW_OP_reg9]
DW$351	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$351, DW_AT_location[DW_OP_reg10]
DW$352	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$352, DW_AT_location[DW_OP_reg11]
DW$353	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$353, DW_AT_location[DW_OP_reg12]
DW$354	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$354, DW_AT_location[DW_OP_reg13]
DW$355	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$355, DW_AT_location[DW_OP_reg14]
DW$356	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$356, DW_AT_location[DW_OP_reg15]
DW$357	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$357, DW_AT_location[DW_OP_reg16]
DW$358	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$358, DW_AT_location[DW_OP_reg17]
DW$359	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$359, DW_AT_location[DW_OP_reg18]
DW$360	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$360, DW_AT_location[DW_OP_reg19]
DW$361	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$361, DW_AT_location[DW_OP_reg20]
DW$362	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$362, DW_AT_location[DW_OP_reg21]
DW$363	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$363, DW_AT_location[DW_OP_reg22]
DW$364	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$364, DW_AT_location[DW_OP_reg23]
DW$365	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$365, DW_AT_location[DW_OP_reg24]
DW$366	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$366, DW_AT_location[DW_OP_reg25]
DW$367	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$367, DW_AT_location[DW_OP_reg26]
DW$368	.dwtag  DW_TAG_assign_register, DW_AT_name("B11")
	.dwattr DW$368, DW_AT_location[DW_OP_reg27]
DW$369	.dwtag  DW_TAG_assign_register, DW_AT_name("B12")
	.dwattr DW$369, DW_AT_location[DW_OP_reg28]
