;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Thu Feb 17 13:26:34 2011                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

DW$186	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$187	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
DW$188	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
	.dwendtag DW$T$44


DW$T$46	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)
DW$189	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
	.dwendtag DW$T$46


DW$T$48	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$48, DW_AT_language(DW_LANG_C)
DW$190	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$191	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$192	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$43)
	.dwendtag DW$T$48

DW$T$42	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$41)
	.dwattr DW$T$42, DW_AT_address_class(0x20)

DW$T$63	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$193	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$63


DW$T$67	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)
DW$194	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$66)
	.dwendtag DW$T$67


DW$T$69	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$69, DW_AT_language(DW_LANG_C)
DW$195	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$66)
DW$196	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$42)
DW$197	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$69


DW$T$71	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$71, DW_AT_language(DW_LANG_C)
DW$198	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$66)
DW$199	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
	.dwendtag DW$T$71


DW$T$73	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$73, DW_AT_language(DW_LANG_C)
DW$200	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
	.dwendtag DW$T$73


DW$T$75	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)
DW$201	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
DW$202	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$203	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$75


DW$T$77	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$77, DW_AT_language(DW_LANG_C)
DW$204	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$66)
DW$205	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
	.dwendtag DW$T$77


DW$T$79	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$79, DW_AT_language(DW_LANG_C)
DW$206	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
	.dwendtag DW$T$79

DW$T$33	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
	.dwattr DW$T$33, DW_AT_address_class(0x20)
DW$T$38	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$38, DW_AT_address_class(0x20)
DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)

DW$T$86	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$86, DW_AT_language(DW_LANG_C)

DW$T$88	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$88, DW_AT_language(DW_LANG_C)
DW$207	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
	.dwendtag DW$T$88


DW$T$90	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$90, DW_AT_language(DW_LANG_C)
DW$208	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
DW$209	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$90


DW$T$92	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$92, DW_AT_language(DW_LANG_C)
DW$210	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
DW$211	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
	.dwendtag DW$T$92


DW$T$94	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$94, DW_AT_language(DW_LANG_C)
DW$212	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
DW$213	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$214	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
	.dwendtag DW$T$94


DW$T$95	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$95, DW_AT_language(DW_LANG_C)
DW$215	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
DW$216	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$217	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
DW$218	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$219	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$220	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
DW$221	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
	.dwendtag DW$T$95


DW$T$97	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$97, DW_AT_language(DW_LANG_C)
DW$222	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
DW$223	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$224	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
DW$225	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$226	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
	.dwendtag DW$T$97

DW$T$43	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)
DW$T$66	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$65)
	.dwattr DW$T$66, DW_AT_address_class(0x20)
DW$T$36	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
	.dwattr DW$T$36, DW_AT_address_class(0x20)
DW$T$41	.dwtag  DW_TAG_const_type
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)
DW$T$32	.dwtag  DW_TAG_const_type
	.dwattr DW$T$32, DW_AT_type(*DW$T$6)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$65	.dwtag  DW_TAG_typedef, DW_AT_name("SHA512_State"), DW_AT_type(*DW$T$25)
	.dwattr DW$T$65, DW_AT_language(DW_LANG_C)

DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$29, DW_AT_name("RSAKey")
	.dwattr DW$T$29, DW_AT_byte_size(0x24)
DW$227	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$227, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
DW$228	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$228, DW_AT_name("bytes"), DW_AT_symbol_name("_bytes")
	.dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
DW$229	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$229, DW_AT_name("modulus"), DW_AT_symbol_name("_modulus")
	.dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
DW$230	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$230, DW_AT_name("exponent"), DW_AT_symbol_name("_exponent")
	.dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
DW$231	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$231, DW_AT_name("private_exponent"), DW_AT_symbol_name("_private_exponent")
	.dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
DW$232	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$232, DW_AT_name("p"), DW_AT_symbol_name("_p")
	.dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
DW$233	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$233, DW_AT_name("q"), DW_AT_symbol_name("_q")
	.dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
DW$234	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$234, DW_AT_name("iqmp"), DW_AT_symbol_name("_iqmp")
	.dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
DW$235	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
	.dwattr DW$235, DW_AT_name("comment"), DW_AT_symbol_name("_comment")
	.dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$29


DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$25, DW_AT_byte_size(0x118)
DW$236	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$236, DW_AT_name("h"), DW_AT_symbol_name("_h")
	.dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
DW$237	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
	.dwattr DW$237, DW_AT_name("block"), DW_AT_symbol_name("_block")
	.dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
DW$238	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$238, DW_AT_name("blkused"), DW_AT_symbol_name("_blkused")
	.dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x100]
	.dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
DW$239	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$239, DW_AT_name("len"), DW_AT_symbol_name("_len")
	.dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
	.dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$25

DW$T$28	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$27)
	.dwattr DW$T$28, DW_AT_address_class(0x20)

DW$T$22	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$22, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$22, DW_AT_byte_size(0x80)
DW$240	.dwtag  DW_TAG_subrange_type
	.dwattr DW$240, DW_AT_upper_bound(0x7f)
	.dwendtag DW$T$22


DW$T$24	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$24, DW_AT_byte_size(0x10)
DW$241	.dwtag  DW_TAG_subrange_type
	.dwattr DW$241, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$24


DW$T$21	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$21, DW_AT_byte_size(0x80)
DW$242	.dwtag  DW_TAG_subrange_type
	.dwattr DW$242, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$21

DW$T$27	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$27, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$27, DW_AT_byte_size(0x01)
DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
DW$T$20	.dwtag  DW_TAG_typedef, DW_AT_name("uint64"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)

DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$19, DW_AT_byte_size(0x10)
DW$243	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$243, DW_AT_name("hi"), DW_AT_symbol_name("_hi")
	.dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
DW$244	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$13)
	.dwattr DW$244, DW_AT_name("lo"), DW_AT_symbol_name("_lo")
	.dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$19

DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x08)
	.dwattr DW$T$13, DW_AT_bit_size(0x28)
	.dwattr DW$T$13, DW_AT_bit_offset(0x18)

	.dwattr DW$169, DW_AT_external(0x01)
	.dwattr DW$142, DW_AT_type(*DW$T$26)
	.dwattr DW$146, DW_AT_type(*DW$T$10)
	.dwattr DW$163, DW_AT_external(0x01)
	.dwattr DW$163, DW_AT_type(*DW$T$10)
	.dwattr DW$157, DW_AT_external(0x01)
	.dwattr DW$157, DW_AT_type(*DW$T$10)
	.dwattr DW$107, DW_AT_type(*DW$T$10)
	.dwattr DW$136, DW_AT_external(0x01)
	.dwattr DW$136, DW_AT_type(*DW$T$10)
	.dwattr DW$130, DW_AT_external(0x01)
	.dwattr DW$130, DW_AT_type(*DW$T$10)
	.dwattr DW$80, DW_AT_type(*DW$T$26)
	.dwattr DW$104, DW_AT_external(0x01)
	.dwattr DW$104, DW_AT_type(*DW$T$26)
	.dwattr DW$60, DW_AT_external(0x01)
	.dwattr DW$60, DW_AT_type(*DW$T$10)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$245	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$245, DW_AT_location[DW_OP_reg0]
DW$246	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$246, DW_AT_location[DW_OP_reg1]
DW$247	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$247, DW_AT_location[DW_OP_reg2]
DW$248	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$248, DW_AT_location[DW_OP_reg3]
DW$249	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$249, DW_AT_location[DW_OP_reg4]
DW$250	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$250, DW_AT_location[DW_OP_reg5]
DW$251	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$251, DW_AT_location[DW_OP_reg6]
DW$252	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$252, DW_AT_location[DW_OP_reg7]
DW$253	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$253, DW_AT_location[DW_OP_reg8]
DW$254	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$254, DW_AT_location[DW_OP_reg9]
DW$255	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$255, DW_AT_location[DW_OP_reg10]
DW$256	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$256, DW_AT_location[DW_OP_reg11]
DW$257	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$257, DW_AT_location[DW_OP_reg12]
DW$258	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$258, DW_AT_location[DW_OP_reg13]
DW$259	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$259, DW_AT_location[DW_OP_reg14]
DW$260	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$260, DW_AT_location[DW_OP_reg15]
DW$261	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$261, DW_AT_location[DW_OP_reg16]
DW$262	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$262, DW_AT_location[DW_OP_reg17]
DW$263	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$263, DW_AT_location[DW_OP_reg18]
DW$264	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$264, DW_AT_location[DW_OP_reg19]
DW$265	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$265, DW_AT_location[DW_OP_reg20]
DW$266	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$266, DW_AT_location[DW_OP_reg21]
DW$267	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$267, DW_AT_location[DW_OP_reg22]
DW$268	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$268, DW_AT_location[DW_OP_reg23]
DW$269	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$269, DW_AT_location[DW_OP_reg24]
DW$270	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$270, DW_AT_location[DW_OP_reg25]
DW$271	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$271, DW_AT_location[DW_OP_reg26]
