;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Thu Feb 17 13:26:35 2011                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

RL28:      ; CALL OCCURS {_modinv}           ; |92| 
;** --------------------------------------------------------------------------*
           CALL    .S2     B11               ; |93| 
           STW     .D2T1   A4,*+B10(16)      ; |92| 
           ADDKPC  .S2     RL29,B3,0         ; |93| 
           MV      .L1     A10,A4            ; |93| 
           MVK     .L2     0x4,B6            ; |93| 

           MVK     .S1     0x3,A6            ; |93| 
||         MVK     .D2     0x6,B4            ; |93| 

RL29:      ; CALL OCCURS {B11}               ; |93| 

           CALL    .S1     _modinv           ; |94| 
||         LDW     .D2T2   *+B10(20),B4      ; |94| 

           LDW     .D2T1   *+B10(24),A4      ; |94| 
           ADDKPC  .S2     RL30,B3,3         ; |94| 
RL30:      ; CALL OCCURS {_modinv}           ; |94| 
           CALL    .S2     B11               ; |95| 
           ADDKPC  .S2     RL31,B3,0         ; |95| 
           MVK     .L2     0x5,B6            ; |95| 
           MVK     .S1     0x3,A6            ; |95| 
           MVK     .L2     0x6,B4            ; |95| 

           STW     .D2T1   A4,*+B10(28)      ; |94| 
||         MV      .L1     A10,A4            ; |95| 

RL31:      ; CALL OCCURS {B11}               ; |95| 
           CALL    .S1     _freebn           ; |100| 
           ADDKPC  .S2     RL32,B3,3         ; |100| 
           MV      .L1     A12,A4            ; |100| 
RL32:      ; CALL OCCURS {_freebn}           ; |100| 
;** --------------------------------------------------------------------------*
           MV      .L1X    SP,A31            ; |103| 

           LDW     .D1T1   *+A31(16),A12     ; |103| 
||         LDDW    .D2T2   *+SP(24),B11:B10  ; |103| 
||         MV      .L2     B13,B3            ; |103| 

           RET     .S2     B3                ; |103| 
||         LDDW    .D1T1   *+A31(8),A11:A10  ; |103| 
||         LDW     .D2T2   *+SP(20),B13      ; |103| 

           LDW     .D2T1   *++SP(32),A13     ; |103| 
           NOP             3
	.dwpsn	"SSHRSAG.C",103,1
           MVK     .L1     0x1,A4            ; |102| 
           ; BRANCH OCCURS {B3}              ; |103| 
	.dwattr DW$26, DW_AT_end_file("SSHRSAG.C")
	.dwattr DW$26, DW_AT_end_line(0x67)
	.dwattr DW$26, DW_AT_end_column(0x01)
	.dwendtag DW$26

;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_copybn
	.global	_bignum_from_long
	.global	_freebn
	.global	_decbn
	.global	_bigmul
	.global	_modinv
	.global	_bignum_cmp
	.global	_primegen
	.global	__divi

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************
DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x20)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Bignum"), DW_AT_type(*DW$T$3)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)

DW$T$23	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
DW$31	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$23


DW$T$24	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$24, DW_AT_language(DW_LANG_C)
DW$32	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$13)
	.dwendtag DW$T$24


DW$T$25	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$33	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
DW$34	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$25


DW$T$29	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$29, DW_AT_language(DW_LANG_C)
DW$35	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$36	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$37	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$38	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
DW$39	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$40	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$41	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$29

DW$T$28	.dwtag  DW_TAG_typedef, DW_AT_name("progfn_t"), DW_AT_type(*DW$T$27)
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)

DW$T$41	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$41, DW_AT_language(DW_LANG_C)
DW$42	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$41

DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)

DW$T$43	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)
DW$43	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
DW$44	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$43


DW$T$46	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)
DW$45	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$45)
DW$46	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$47	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
DW$48	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$46

DW$T$13	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
	.dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$13, DW_AT_byte_size(0x08)
	.dwattr DW$T$13, DW_AT_bit_size(0x28)
	.dwattr DW$T$13, DW_AT_bit_offset(0x18)
DW$T$45	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$45, DW_AT_address_class(0x20)
DW$T$27	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$27, DW_AT_address_class(0x20)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("RSAKey")
	.dwattr DW$T$22, DW_AT_byte_size(0x24)
DW$49	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$49, DW_AT_name("bits"), DW_AT_symbol_name("_bits")
	.dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
DW$50	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$50, DW_AT_name("bytes"), DW_AT_symbol_name("_bytes")
	.dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
DW$51	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$51, DW_AT_name("modulus"), DW_AT_symbol_name("_modulus")
	.dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
DW$52	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$52, DW_AT_name("exponent"), DW_AT_symbol_name("_exponent")
	.dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
DW$53	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$53, DW_AT_name("private_exponent"), DW_AT_symbol_name("_private_exponent")
	.dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
DW$54	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$54, DW_AT_name("p"), DW_AT_symbol_name("_p")
	.dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
DW$55	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$55, DW_AT_name("q"), DW_AT_symbol_name("_q")
	.dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
DW$56	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$56, DW_AT_name("iqmp"), DW_AT_symbol_name("_iqmp")
	.dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
DW$57	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$57, DW_AT_name("comment"), DW_AT_symbol_name("_comment")
	.dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22


DW$T$26	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$26, DW_AT_language(DW_LANG_C)
DW$58	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$59	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$60	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$61	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$26

DW$T$21	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
	.dwattr DW$T$21, DW_AT_address_class(0x20)
DW$T$20	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$20, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$20, DW_AT_byte_size(0x01)

	.dwattr DW$26, DW_AT_external(0x01)
	.dwattr DW$26, DW_AT_type(*DW$T$10)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$62	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$62, DW_AT_location[DW_OP_reg0]
DW$63	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$63, DW_AT_location[DW_OP_reg1]
DW$64	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$64, DW_AT_location[DW_OP_reg2]
DW$65	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$65, DW_AT_location[DW_OP_reg3]
DW$66	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$66, DW_AT_location[DW_OP_reg4]
DW$67	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$67, DW_AT_location[DW_OP_reg5]
DW$68	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$68, DW_AT_location[DW_OP_reg6]
DW$69	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$69, DW_AT_location[DW_OP_reg7]
DW$70	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$70, DW_AT_location[DW_OP_reg8]
DW$71	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$71, DW_AT_location[DW_OP_reg9]
DW$72	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$72, DW_AT_location[DW_OP_reg10]
DW$73	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$73, DW_AT_location[DW_OP_reg11]
DW$74	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$74, DW_AT_location[DW_OP_reg12]
DW$75	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$75, DW_AT_location[DW_OP_reg13]
DW$76	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$76, DW_AT_location[DW_OP_reg14]
DW$77	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$77, DW_AT_location[DW_OP_reg15]
DW$78	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$78, DW_AT_location[DW_OP_reg16]
DW$79	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$79, DW_AT_location[DW_OP_reg17]
DW$80	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$80, DW_AT_location[DW_OP_reg18]
DW$81	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$81, DW_AT_location[DW_OP_reg19]
DW$82	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$82, DW_AT_location[DW_OP_reg20]
DW$83	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$83, DW_AT_location[DW_OP_reg21]
DW$84	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$84, DW_AT_location[DW_OP_reg22]
DW$85	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$85, DW_AT_location[DW_OP_reg23]
DW$86	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$86, DW_AT_location[DW_OP_reg24]
DW$87	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$87, DW_AT_location[DW_OP_reg25]
DW$88	.dwtag  DW_TAG_assign_register, DW_AT_name("B10")
	.dwattr DW$88, DW_AT_location[DW_OP_reg26]
DW$89	.dwtag  DW_TAG_assign_register, DW_AT_name("B11")
	.dwattr DW$89, DW_AT_location[DW_OP_reg27]
DW$90	.dwtag  DW_TAG_assign_register, DW_AT_name("B12")
	.dwattr DW$90, DW_AT_location[DW_OP_reg28]
DW$91	.dwtag  DW_TAG_assign_register, DW_AT_name("B13")
