TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:25 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI3722                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Jan 07 14:23:25 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    2534                            .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    2535                    DW$200  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2536                    DW$201  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
    2537                            .dwendtag DW$T$27
    2538                    
    2539                    
    2540                    DW$T$29 .dwtag  DW_TAG_subroutine_type
    2541                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    2542                    DW$202  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2543                            .dwendtag DW$T$29
    2544                    
    2545                    
    2546                    DW$T$33 .dwtag  DW_TAG_subroutine_type
    2547                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    2548                    DW$203  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2549                    DW$204  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$32)
    2550                            .dwendtag DW$T$33
    2551                    
    2552                    
    2553                    DW$T$37 .dwtag  DW_TAG_subroutine_type
    2554                            .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    2555                    DW$205  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2556                    DW$206  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$26)
    2557                    DW$207  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
    2558                    DW$208  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
    2559                    DW$209  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
    2560                            .dwendtag DW$T$37
    2561                    
    2562                    DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
    2563                            .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    2564                    DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$26)
    2565                            .dwattr DW$T$35, DW_AT_address_class(0x20)
    2566                    
    2567                    DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
    2568                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
    2569                    DW$210  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2570                            .dwendtag DW$T$39
    2571                    
    2572                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
    2573                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    2574                    DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
    2575                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    2576                    DW$T$42 .dwtag  DW_TAG_volatile_type
    2577                            .dwattr DW$T$42, DW_AT_type(*DW$T$41)
    2578                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    2579                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
    2580                    
    2581                    DW$T$43 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
    2582                            .dwattr DW$T$43, DW_AT_language(DW_LANG_C)
    2583                    DW$211  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
    2584                            .dwendtag DW$T$43
    2585                    
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:25 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI3722                                PAGE   48

    2586                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$24)
    2587                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    2588                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Config"), DW_AT_type(*DW$T$23)
    2589                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    2590                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
    2591                            .dwattr DW$T$32, DW_AT_address_class(0x20)
    2592                    DW$T$46 .dwtag  DW_TAG_const_type
    2593                            .dwattr DW$T$46, DW_AT_type(*DW$T$31)
    2594                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    2595                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2596                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    2597                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    2598                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    2599                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    2600                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    2601                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    2602                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
    2603                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    2604                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    2605                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    2606                    DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
    2607                            .dwattr DW$T$24, DW_AT_address_class(0x20)
    2608                    
    2609                    DW$T$23 .dwtag  DW_TAG_structure_type
    2610                            .dwattr DW$T$23, DW_AT_byte_size(0x20)
    2611                    DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2612                            .dwattr DW$212, DW_AT_name("i2coar"), DW_AT_symbol_name("_i2coar")
    2613                            .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2614                            .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2615                    DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2616                            .dwattr DW$213, DW_AT_name("i2cier"), DW_AT_symbol_name("_i2cier")
    2617                            .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2618                            .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2619                    DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2620                            .dwattr DW$214, DW_AT_name("i2cclkl"), DW_AT_symbol_name("_i2cclkl")
    2621                            .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2622                            .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2623                    DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2624                            .dwattr DW$215, DW_AT_name("i2cclkh"), DW_AT_symbol_name("_i2cclkh")
    2625                            .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2626                            .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2627                    DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2628                            .dwattr DW$216, DW_AT_name("i2ccnt"), DW_AT_symbol_name("_i2ccnt")
    2629                            .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2630                            .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2631                    DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2632                            .dwattr DW$217, DW_AT_name("i2csar"), DW_AT_symbol_name("_i2csar")
    2633                            .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2634                            .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2635                    DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2636                            .dwattr DW$218, DW_AT_name("i2cmdr"), DW_AT_symbol_name("_i2cmdr")
    2637                            .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2638                            .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2639                    DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2640                            .dwattr DW$219, DW_AT_name("i2cpsc"), DW_AT_symbol_name("_i2cpsc")
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:25 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI3722                                PAGE   49

    2641                            .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2642                            .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2643                            .dwendtag DW$T$23
    2644                    
    2645                    
    2646                    DW$T$22 .dwtag  DW_TAG_structure_type
    2647                            .dwattr DW$T$22, DW_AT_byte_size(0x14)
    2648                    DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2649                            .dwattr DW$220, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    2650                            .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2651                            .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2652                    DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2653                            .dwattr DW$221, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    2654                            .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2655                            .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2656                    DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2657                            .dwattr DW$222, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    2658                            .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2659                            .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2660                    DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2661                            .dwattr DW$223, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
    2662                            .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2663                            .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2664                    DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2665                            .dwattr DW$224, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
    2666                            .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2667                            .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2668                            .dwendtag DW$T$22
    2669                    
    2670                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    2671                            .dwattr DW$T$21, DW_AT_address_class(0x20)
    2672                    DW$T$20 .dwtag  DW_TAG_volatile_type
    2673                            .dwattr DW$T$20, DW_AT_type(*DW$T$19)
    2674                    
    2675                            .dwattr DW$67, DW_AT_external(0x01)
    2676                            .dwattr DW$155, DW_AT_external(0x01)
    2677                            .dwattr DW$24, DW_AT_external(0x01)
    2678                            .dwattr DW$112, DW_AT_external(0x01)
    2679                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2680                    
    2681                    ;***************************************************************
    2682                    ;* DWARF CIE ENTRIES                                           *
    2683                    ;***************************************************************
    2684                    
    2685                    DW$CIE  .dwcie 1, 126
    2686                            .dwcfa  0x0c, 31, 0
    2687                            .dwcfa  0x07, 0
    2688                            .dwcfa  0x07, 1
    2689                            .dwcfa  0x07, 2
    2690                            .dwcfa  0x07, 3
    2691                            .dwcfa  0x07, 4
    2692                            .dwcfa  0x07, 5
    2693                            .dwcfa  0x07, 6
    2694                            .dwcfa  0x07, 7
    2695                            .dwcfa  0x07, 8
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:25 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI3722                                PAGE   50

    2696                            .dwcfa  0x07, 9
    2697                            .dwcfa  0x08, 10
    2698                            .dwcfa  0x08, 11
    2699                            .dwcfa  0x08, 12
    2700                            .dwcfa  0x08, 13
    2701                            .dwcfa  0x08, 14
    2702                            .dwcfa  0x08, 15
    2703                            .dwcfa  0x07, 16
    2704                            .dwcfa  0x07, 17
    2705                            .dwcfa  0x07, 18
    2706                            .dwcfa  0x07, 19
    2707                            .dwcfa  0x07, 20
    2708                            .dwcfa  0x07, 21
    2709                            .dwcfa  0x07, 22
    2710                            .dwcfa  0x07, 23
    2711                            .dwcfa  0x07, 24
    2712                            .dwcfa  0x07, 25
    2713                            .dwcfa  0x08, 26
    2714                            .dwcfa  0x08, 27
    2715                            .dwcfa  0x08, 28
    2716                            .dwcfa  0x08, 29
    2717                            .dwcfa  0x08, 30
    2718                            .dwcfa  0x08, 31
    2719                            .dwcfa  0x08, 32
    2720                            .dwcfa  0x07, 33
    2721                            .dwcfa  0x07, 34
    2722                            .dwcfa  0x07, 35
    2723                            .dwcfa  0x07, 36
    2724                            .dwcfa  0x07, 37
    2725                            .dwcfa  0x07, 38
    2726                            .dwcfa  0x07, 39
    2727                            .dwcfa  0x07, 40
    2728                            .dwcfa  0x07, 41
    2729                            .dwcfa  0x07, 42
    2730                            .dwcfa  0x07, 43
    2731                            .dwcfa  0x07, 44
    2732                            .dwcfa  0x07, 45
