TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Jan 07 14:23:27 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    1500                            .global _IMG_FEATURE_COUNT
    1501                            .global _IMG_FEATURE_STRUCT_TOTALSIZE
    1502                            .global _IMG_FEATURE_LEFT_STRUCT_ADDR
    1503                            .global _IMG_FEATURE_RIGHT_STRUCT_ADDR
    1504                    
    1505                    ;******************************************************************************
    1506                    ;* TYPE INFORMATION                                                           *
    1507                    ;******************************************************************************
    1508                    DW$T$3  .dwtag  DW_TAG_pointer_type
    1509                            .dwattr DW$T$3, DW_AT_address_class(0x20)
    1510                    
    1511                    DW$T$88 .dwtag  DW_TAG_subroutine_type
    1512                            .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
    1513                    DW$34   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$86)
    1514                    DW$35   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
    1515                    DW$36   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$87)
    1516                            .dwendtag DW$T$88
    1517                    
    1518                    
    1519                    DW$T$90 .dwtag  DW_TAG_subroutine_type
    1520                            .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
    1521                    
    1522                    DW$T$93 .dwtag  DW_TAG_subroutine_type
    1523                            .dwattr DW$T$93, DW_AT_language(DW_LANG_C)
    1524                    DW$37   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$92)
    1525                    DW$38   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    1526                            .dwendtag DW$T$93
    1527                    
    1528                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    1529                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1530                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    1531                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
    1532                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1533                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
    1534                    
    1535                    DW$T$95 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1536                            .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    1537                    
    1538                    DW$T$99 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1539                            .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    1540                    DW$39   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$98)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   29

    1541                            .dwendtag DW$T$99
    1542                    
    1543                    
    1544                    DW$T$100        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1545                            .dwattr DW$T$100, DW_AT_language(DW_LANG_C)
    1546                    DW$T$87 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    1547                            .dwattr DW$T$87, DW_AT_language(DW_LANG_C)
    1548                    DW$T$102        .dwtag  DW_TAG_typedef, DW_AT_name("LgUns"), DW_AT_type(*DW$T$11)
    1549                            .dwattr DW$T$102, DW_AT_language(DW_LANG_C)
    1550                    DW$T$98 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$97)
    1551                            .dwattr DW$T$98, DW_AT_address_class(0x20)
    1552                    DW$T$92 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$53)
    1553                            .dwattr DW$T$92, DW_AT_address_class(0x20)
    1554                    DW$T$104        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
    1555                            .dwattr DW$T$104, DW_AT_address_class(0x20)
    1556                    DW$T$105        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_reg_t"), DW_AT_type(*DW$T$84)
    1557                            .dwattr DW$T$105, DW_AT_language(DW_LANG_C)
    1558                    DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$85)
    1559                            .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    1560                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1561                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1562                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    1563                    DW$T$97 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_procimg_t"), DW_AT_type(*DW$T$32)
    1564                            .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
    1565                    DW$T$53 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1566                            .dwattr DW$T$53, DW_AT_encoding(DW_ATE_signed_char)
    1567                            .dwattr DW$T$53, DW_AT_byte_size(0x01)
    1568                    DW$T$103        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$70)
    1569                            .dwattr DW$T$103, DW_AT_language(DW_LANG_C)
    1570                    
    1571                    DW$T$84 .dwtag  DW_TAG_structure_type
    1572                            .dwattr DW$T$84, DW_AT_name("dsp_reg_t")
    1573                            .dwattr DW$T$84, DW_AT_byte_size(0xb4)
    1574                    DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    1575                            .dwattr DW$40, DW_AT_name("status_reg"), DW_AT_symbol_name("_status_reg")
    1576                            .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                            .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
    1578                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    1579                            .dwattr DW$41, DW_AT_name("distance_reg"), DW_AT_symbol_name("_distance_reg")
    1580                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1581                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
    1582                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    1583                            .dwattr DW$42, DW_AT_name("policy_reg"), DW_AT_symbol_name("_policy_reg")
    1584                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1585                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
    1586                    DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
    1587                            .dwattr DW$43, DW_AT_name("sound_reg"), DW_AT_symbol_name("_sound_reg")
    1588                            .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1589                            .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
    1590                    DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    1591                            .dwattr DW$44, DW_AT_name("result_reg"), DW_AT_symbol_name("_result_reg")
    1592                            .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1593                            .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
    1594                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
    1595                            .dwattr DW$45, DW_AT_name("quality_value"), DW_AT_symbol_name("_quality_value")
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   30

    1596                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1597                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
    1598                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1599                            .dwattr DW$46, DW_AT_name("quality_count"), DW_AT_symbol_name("_quality_count")
    1600                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1601                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
    1602                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1603                            .dwattr DW$47, DW_AT_name("alg_control_count"), DW_AT_symbol_name("_alg_control_count")
    1604                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1605                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
    1606                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1607                            .dwattr DW$48, DW_AT_name("last_img_quality"), DW_AT_symbol_name("_last_img_quality")
    1608                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1609                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
    1610                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1611                            .dwattr DW$49, DW_AT_name("last_icon_id"), DW_AT_symbol_name("_last_icon_id")
    1612                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1613                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
    1614                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1615                            .dwattr DW$50, DW_AT_name("match_input_count"), DW_AT_symbol_name("_match_input_count")
    1616                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1617                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1618                            .dwendtag DW$T$84
    1619                    
    1620                    
    1621                    DW$T$85 .dwtag  DW_TAG_enumeration_type
    1622                            .dwattr DW$T$85, DW_AT_byte_size(0x04)
    1623                    DW$51   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
    1624                    DW$52   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
    1625                    DW$53   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
    1626                    DW$54   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
    1627                    DW$55   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
    1628                    DW$56   .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
    1629                            .dwendtag DW$T$85
    1630                    
    1631                    
    1632                    DW$T$83 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    1633                            .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    1634                            .dwattr DW$T$83, DW_AT_byte_size(0x28)
    1635                    DW$57   .dwtag  DW_TAG_subrange_type
    1636                            .dwattr DW$57, DW_AT_upper_bound(0x09)
    1637                            .dwendtag DW$T$83
    1638                    
    1639                    
    1640                    DW$T$32 .dwtag  DW_TAG_structure_type
    1641                            .dwattr DW$T$32, DW_AT_name("dsp_procimg_t")
    1642                            .dwattr DW$T$32, DW_AT_byte_size(0x1c)
    1643                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    1644                            .dwattr DW$58, DW_AT_name("img_msg"), DW_AT_symbol_name("_img_msg")
    1645                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1646                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1647                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    1648                            .dwattr DW$59, DW_AT_name("result_msg"), DW_AT_symbol_name("_result_msg")
    1649                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1650                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   31

    1651                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1652                            .dwattr DW$60, DW_AT_name("last_flag"), DW_AT_symbol_name("_last_flag")
    1653                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1654                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1655                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    1656                            .dwattr DW$61, DW_AT_name("img_grab_count"), DW_AT_symbol_name("_img_grab_count")
    1657                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1658                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1659                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    1660                            .dwattr DW$62, DW_AT_name("begin_quality"), DW_AT_symbol_name("_begin_quality")
    1661                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1662                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1663                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1664                            .dwattr DW$63, DW_AT_name("need_eye"), DW_AT_symbol_name("_need_eye")
    1665                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1666                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1667                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1668                            .dwattr DW$64, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    1669                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1670                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1671                            .dwendtag DW$T$32
    1672                    
    1673                    
    1674                    DW$T$70 .dwtag  DW_TAG_structure_type
    1675                            .dwattr DW$T$70, DW_AT_name("dsp_tsk_totalreg_t")
    1676                            .dwattr DW$T$70, DW_AT_byte_size(0x138)
    1677                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    1678                            .dwattr DW$65, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
    1679                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1681                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    1682                            .dwattr DW$66, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
    1683                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1684                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1685                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    1686                            .dwattr DW$67, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
    1687                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1688                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1689                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    1690                            .dwattr DW$68, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
    1691                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1692                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1693                    DW$69   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    1694                            .dwattr DW$69, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
    1695                            .dwattr DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1696                            .dwattr DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1697                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    1698                            .dwattr DW$70, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
    1699                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1700                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1701                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    1702                            .dwattr DW$71, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
    1703                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1704                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1705                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   32

    1706                            .dwattr DW$72, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
    1707                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1708                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1709                    DW$73   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    1710                            .dwattr DW$73, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
    1711                            .dwattr DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    1712                            .dwattr DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1713                    DW$74   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1714                            .dwattr DW$74, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
    1715                            .dwattr DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1716                            .dwattr DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1717                    DW$75   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    1718                            .dwattr DW$75, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
    1719                            .dwattr DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1720                            .dwattr DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1721                    DW$76   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    1722                            .dwattr DW$76, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg"
    1723                            .dwattr DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    1724                            .dwattr DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1725                    DW$77   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1726                            .dwattr DW$77, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
    1727                            .dwattr DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    1728                            .dwattr DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1729                    DW$78   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    1730                            .dwattr DW$78, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
    1731                            .dwattr DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    1732                            .dwattr DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1733                            .dwendtag DW$T$70
    1734                    
    1735                    DW$T$78 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_status_t"), DW_AT_type(*DW$T$71)
    1736                            .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    1737                    DW$T$79 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_t"), DW_AT_type(*DW$T$72)
    1738                            .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    1739                    DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("policy_t"), DW_AT_type(*DW$T$74)
    1740                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    1741                    DW$T$81 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_sound_t"), DW_AT_type(*DW$T$75)
    1742                            .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    1743                    DW$T$82 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_t"), DW_AT_type(*DW$T$77)
    1744                            .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    1745                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$30)
    1746                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1747                    DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
    1748                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    1749                    DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("IMAGE_MSG"), DW_AT_type(*DW$T$25)
    1750                            .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    1751                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("RESULT_MSG"), DW_AT_type(*DW$T$27)
    1752                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1753                    DW$T$57 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$33)
    1754                            .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
    1755                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$34)
    1756                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1757                    DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$37)
    1758                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    1759                    DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$39)
    1760                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   33

    1761                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$40)
    1762                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    1763                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$42)
    1764                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    1765                    DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$43)
    1766                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    1767                    DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$44)
    1768                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1769                    DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$46)
    1770                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    1771                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$48)
    1772                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1773                    DW$T$66 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$51)
    1774                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    1775                    DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$52)
    1776                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    1777                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$55)
    1778                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1779                    DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$56)
    1780                            .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    1781                    
    1782                    DW$T$71 .dwtag  DW_TAG_structure_type
    1783                            .dwattr DW$T$71, DW_AT_name("dsp_status_t")
    1784                            .dwattr DW$T$71, DW_AT_byte_size(0x18)
    1785                    DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1786                            .dwattr DW$79, DW_AT_name("tsk_img_status"), DW_AT_symbol_name("_tsk_img_status")
    1787                            .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1788                            .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1789                    DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1790                            .dwattr DW$80, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    1791                            .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1792                            .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1793                    DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1794                            .dwattr DW$81, DW_AT_name("tsk_alg_saved_status"), DW_AT_symbol_name("_tsk_alg_saved_status")
    1795                            .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1796                            .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1797                    DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1798                            .dwattr DW$82, DW_AT_name("tsk_alg_inuse"), DW_AT_symbol_name("_tsk_alg_inuse")
    1799                            .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1800                            .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1801                    DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1802                            .dwattr DW$83, DW_AT_name("proc_start_time"), DW_AT_symbol_name("_proc_start_time")
    1803                            .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1804                            .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1805                    DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    1806                            .dwattr DW$84, DW_AT_name("proc_timeout"), DW_AT_symbol_name("_proc_timeout")
    1807                            .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1808                            .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1809                    DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1810                            .dwattr DW$85, DW_AT_name("tsk_testimg_tag_left"), DW_AT_symbol_name("_tsk_testimg_tag_left")
    1811                            .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1812                            .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1813                    DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1814                            .dwattr DW$86, DW_AT_name("tsk_testimg_tag_right"), DW_AT_symbol_name("_tsk_testimg_tag_right"
    1815                            .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   34

    1816                            .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1817                            .dwendtag DW$T$71
    1818                    
    1819                    
    1820                    DW$T$72 .dwtag  DW_TAG_structure_type
    1821                            .dwattr DW$T$72, DW_AT_name("dsp_distance_t")
    1822                            .dwattr DW$T$72, DW_AT_byte_size(0x24)
    1823                    DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1824                            .dwattr DW$87, DW_AT_name("same_count"), DW_AT_symbol_name("_same_count")
    1825                            .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1826                            .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1827                    DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1828                            .dwattr DW$88, DW_AT_name("last_distance"), DW_AT_symbol_name("_last_distance")
    1829                            .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1830                            .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1831                    DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1832                            .dwattr DW$89, DW_AT_name("if_has_people"), DW_AT_symbol_name("_if_has_people")
    1833                            .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1834                            .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1835                    DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1836                            .dwattr DW$90, DW_AT_name("last_if_has"), DW_AT_symbol_name("_last_if_has")
    1837                            .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1838                            .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1839                    DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1840                            .dwattr DW$91, DW_AT_name("no_count"), DW_AT_symbol_name("_no_count")
    1841                            .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1842                            .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1843                    DW$92   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1844                            .dwattr DW$92, DW_AT_name("has_count"), DW_AT_symbol_name("_has_count")
    1845                            .dwattr DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1846                            .dwattr DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1847                    DW$93   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1848                            .dwattr DW$93, DW_AT_name("disp_count"), DW_AT_symbol_name("_disp_count")
    1849                            .dwattr DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1850                            .dwattr DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1851                    DW$94   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1852                            .dwattr DW$94, DW_AT_name("if_disp_image"), DW_AT_symbol_name("_if_disp_image")
    1853                            .dwattr DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1854                            .dwattr DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1855                    DW$95   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1856                            .dwattr DW$95, DW_AT_name("wait_frame"), DW_AT_symbol_name("_wait_frame")
    1857                            .dwattr DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1858                            .dwattr DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1859                            .dwendtag DW$T$72
    1860                    
    1861                    
    1862                    DW$T$74 .dwtag  DW_TAG_structure_type
    1863                            .dwattr DW$T$74, DW_AT_name("policy_t")
    1864                            .dwattr DW$T$74, DW_AT_byte_size(0x28)
    1865                    DW$96   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1866                            .dwattr DW$96, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    1867                            .dwattr DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1868                            .dwattr DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1869                    DW$97   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1870                            .dwattr DW$97, DW_AT_name("iden_count"), DW_AT_symbol_name("_iden_count")
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   35

    1871                            .dwattr DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1872                            .dwattr DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1873                    DW$98   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1874                            .dwattr DW$98, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    1875                            .dwattr DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1876                            .dwattr DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1877                    DW$99   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1878                            .dwattr DW$99, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    1879                            .dwattr DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1880                            .dwattr DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1881                    DW$100  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    1882                            .dwattr DW$100, DW_AT_name("enroll_score_l"), DW_AT_symbol_name("_enroll_score_l")
    1883                            .dwattr DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1884                            .dwattr DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1885                    DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    1886                            .dwattr DW$101, DW_AT_name("enroll_score_r"), DW_AT_symbol_name("_enroll_score_r")
    1887                            .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1888                            .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1889                            .dwendtag DW$T$74
    1890                    
    1891                    
    1892                    DW$T$75 .dwtag  DW_TAG_structure_type
    1893                            .dwattr DW$T$75, DW_AT_name("dsp_sound_t")
    1894                            .dwattr DW$T$75, DW_AT_byte_size(0x08)
    1895                    DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1896                            .dwattr DW$102, DW_AT_name("last_sound_time"), DW_AT_symbol_name("_last_sound_time")
    1897                            .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                            .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1899                    DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1900                            .dwattr DW$103, DW_AT_name("last_sound_value"), DW_AT_symbol_name("_last_sound_value")
    1901                            .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1902                            .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1903                            .dwendtag DW$T$75
    1904                    
    1905                    
    1906                    DW$T$77 .dwtag  DW_TAG_structure_type
    1907                            .dwattr DW$T$77, DW_AT_name("dsp_result_t")
    1908                            .dwattr DW$T$77, DW_AT_byte_size(0x0c)
    1909                    DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    1910                            .dwattr DW$104, DW_AT_name("count"), DW_AT_symbol_name("_count")
    1911                            .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1912                            .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1913                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    1914                            .dwattr DW$105, DW_AT_name("result"), DW_AT_symbol_name("_result")
    1915                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1916                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1917                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    1918                            .dwattr DW$106, DW_AT_name("grab_iden_result"), DW_AT_symbol_name("_grab_iden_result")
    1919                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1920                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1921                            .dwendtag DW$T$77
    1922                    
    1923                    
    1924                    DW$T$76 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
    1925                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   36

    1926                            .dwattr DW$T$76, DW_AT_byte_size(0x04)
    1927                    DW$107  .dwtag  DW_TAG_subrange_type
    1928                            .dwattr DW$107, DW_AT_upper_bound(0x01)
    1929                            .dwendtag DW$T$76
    1930                    
    1931                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    1932                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    1933                    
    1934                    DW$T$73 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    1935                            .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    1936                            .dwattr DW$T$73, DW_AT_byte_size(0x10)
    1937                    DW$108  .dwtag  DW_TAG_subrange_type
    1938                            .dwattr DW$108, DW_AT_upper_bound(0x03)
    1939                            .dwendtag DW$T$73
    1940                    
    1941                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1942                            .dwattr DW$T$25, DW_AT_address_class(0x20)
    1943                    DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    1944                            .dwattr DW$T$27, DW_AT_address_class(0x20)
    1945                    
    1946                    DW$T$33 .dwtag  DW_TAG_structure_type
    1947                            .dwattr DW$T$33, DW_AT_name("dsp_tsk_control_t")
    1948                            .dwattr DW$T$33, DW_AT_byte_size(0x0c)
    1949                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1950                            .dwattr DW$109, DW_AT_name("tsk_img_control"), DW_AT_symbol_name("_tsk_img_control")
    1951                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1953                    DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1954                            .dwattr DW$110, DW_AT_name("tsk_img_control_count"), DW_AT_symbol_name("_tsk_img_control_count
    1955                            .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1956                            .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1957                    DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1958                            .dwattr DW$111, DW_AT_name("tsk_alg_control"), DW_AT_symbol_name("_tsk_alg_control")
    1959                            .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1960                            .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1961                    DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1962                            .dwattr DW$112, DW_AT_name("tsk_alg_control_count"), DW_AT_symbol_name("_tsk_alg_control_count
    1963                            .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1964                            .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1965                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1966                            .dwattr DW$113, DW_AT_name("tsk_adc_value"), DW_AT_symbol_name("_tsk_adc_value")
    1967                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1968                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1969                            .dwendtag DW$T$33
    1970                    
    1971                    
    1972                    DW$T$34 .dwtag  DW_TAG_structure_type
    1973                            .dwattr DW$T$34, DW_AT_name("dsp_tsk_policy_t")
    1974                            .dwattr DW$T$34, DW_AT_byte_size(0x0c)
    1975                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1976                            .dwattr DW$114, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    1977                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1978                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1979                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1980                            .dwattr DW$115, DW_AT_name("try_count"), DW_AT_symbol_name("_try_count")
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   37

    1981                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1982                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1983                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1984                            .dwattr DW$116, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    1985                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1986                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1987                    DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    1988                            .dwattr DW$117, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    1989                            .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1990                            .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1991                    DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    1992                            .dwattr DW$118, DW_AT_name("policy_flag"), DW_AT_symbol_name("_policy_flag")
    1993                            .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1994                            .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1995                            .dwendtag DW$T$34
    1996                    
    1997                    
    1998                    DW$T$37 .dwtag  DW_TAG_structure_type
    1999                            .dwattr DW$T$37, DW_AT_name("dsp_tsk_flag_t")
    2000                            .dwattr DW$T$37, DW_AT_byte_size(0x1c)
    2001                    DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2002                            .dwattr DW$119, DW_AT_name("tsk_img_resp"), DW_AT_symbol_name("_tsk_img_resp")
    2003                            .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2004                            .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2005                    DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2006                            .dwattr DW$120, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    2007                            .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2008                            .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2009                    DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2010                            .dwattr DW$121, DW_AT_name("tsk_alg_status_count"), DW_AT_symbol_name("_tsk_alg_status_count")
    2011                            .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2012                            .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2013                    DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2014                            .dwattr DW$122, DW_AT_name("req_tsk_alg_control"), DW_AT_symbol_name("_req_tsk_alg_control")
    2015                            .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2016                            .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2017                    DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2018                            .dwattr DW$123, DW_AT_name("req_tsk_alg_control_count"), DW_AT_symbol_name("_req_tsk_alg_contr
    2019                            .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2020                            .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2021                    DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2022                            .dwattr DW$124, DW_AT_name("left_data"), DW_AT_symbol_name("_left_data")
    2023                            .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2024                            .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2025                    DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2026                            .dwattr DW$125, DW_AT_name("right_data"), DW_AT_symbol_name("_right_data")
    2027                            .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2028                            .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2029                            .dwendtag DW$T$37
    2030                    
    2031                    
    2032                    DW$T$39 .dwtag  DW_TAG_structure_type
    2033                            .dwattr DW$T$39, DW_AT_name("dsp_algorithm_result_t")
    2034                            .dwattr DW$T$39, DW_AT_byte_size(0x20)
    2035                    DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   38

    2036                            .dwattr DW$126, DW_AT_name("result_type"), DW_AT_symbol_name("_result_type")
    2037                            .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2038                            .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2039                    DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    2040                            .dwattr DW$127, DW_AT_name("policy"), DW_AT_symbol_name("_policy")
    2041                            .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2042                            .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2043                    DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2044                            .dwattr DW$128, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    2045                            .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2046                            .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2047                    DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2048                            .dwattr DW$129, DW_AT_name("left_result"), DW_AT_symbol_name("_left_result")
    2049                            .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2050                            .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2051                    DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2052                            .dwattr DW$130, DW_AT_name("right_result"), DW_AT_symbol_name("_right_result")
    2053                            .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2054                            .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    2055                    DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2056                            .dwattr DW$131, DW_AT_name("result_data"), DW_AT_symbol_name("_result_data")
    2057                            .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2058                            .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2059                            .dwendtag DW$T$39
    2060                    
    2061                    
    2062                    DW$T$40 .dwtag  DW_TAG_structure_type
    2063                            .dwattr DW$T$40, DW_AT_name("dsp_algorithm_sound_t")
    2064                            .dwattr DW$T$40, DW_AT_byte_size(0x08)
    2065                    DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2066                            .dwattr DW$132, DW_AT_name("sound_value"), DW_AT_symbol_name("_sound_value")
    2067                            .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                            .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2069                    DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2070                            .dwattr DW$133, DW_AT_name("sound_count"), DW_AT_symbol_name("_sound_count")
    2071                            .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2072                            .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2073                            .dwendtag DW$T$40
    2074                    
    2075                    
    2076                    DW$T$42 .dwtag  DW_TAG_structure_type
    2077                            .dwattr DW$T$42, DW_AT_name("dsp_algorithm_devparam_t")
    2078                            .dwattr DW$T$42, DW_AT_byte_size(0x54)
    2079                    DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2080                            .dwattr DW$134, DW_AT_name("param_count"), DW_AT_symbol_name("_param_count")
    2081                            .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2082                            .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2083                    DW$135  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    2084                            .dwattr DW$135, DW_AT_name("device_param"), DW_AT_symbol_name("_device_param")
    2085                            .dwattr DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2086                            .dwattr DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2087                            .dwendtag DW$T$42
    2088                    
    2089                    
    2090                    DW$T$43 .dwtag  DW_TAG_structure_type
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   39

    2091                            .dwattr DW$T$43, DW_AT_name("dsp_tsk_watchdog_t")
    2092                            .dwattr DW$T$43, DW_AT_byte_size(0x08)
    2093                    DW$136  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2094                            .dwattr DW$136, DW_AT_name("tsk_img_watchdog"), DW_AT_symbol_name("_tsk_img_watchdog")
    2095                            .dwattr DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2096                            .dwattr DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2097                    DW$137  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2098                            .dwattr DW$137, DW_AT_name("tsk_alg_watchdog"), DW_AT_symbol_name("_tsk_alg_watchdog")
    2099                            .dwattr DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2100                            .dwattr DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2101                            .dwendtag DW$T$43
    2102                    
    2103                    
    2104                    DW$T$44 .dwtag  DW_TAG_structure_type
    2105                            .dwattr DW$T$44, DW_AT_name("dsp_icon_t")
    2106                            .dwattr DW$T$44, DW_AT_byte_size(0x14)
    2107                    DW$138  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2108                            .dwattr DW$138, DW_AT_name("req_icon_control"), DW_AT_symbol_name("_req_icon_control")
    2109                            .dwattr DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2110                            .dwattr DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2111                    DW$139  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2112                            .dwattr DW$139, DW_AT_name("req_icon_id"), DW_AT_symbol_name("_req_icon_id")
    2113                            .dwattr DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2114                            .dwattr DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2115                    DW$140  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2116                            .dwattr DW$140, DW_AT_name("dsp_icon_state"), DW_AT_symbol_name("_dsp_icon_state")
    2117                            .dwattr DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2118                            .dwattr DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2119                    DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2120                            .dwattr DW$141, DW_AT_name("icon_data"), DW_AT_symbol_name("_icon_data")
    2121                            .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2122                            .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2123                            .dwendtag DW$T$44
    2124                    
    2125                    
    2126                    DW$T$46 .dwtag  DW_TAG_structure_type
    2127                            .dwattr DW$T$46, DW_AT_name("dsp_mac_t")
    2128                            .dwattr DW$T$46, DW_AT_byte_size(0x08)
    2129                    DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    2130                            .dwattr DW$142, DW_AT_name("mac_val"), DW_AT_symbol_name("_mac_val")
    2131                            .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                            .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2133                            .dwendtag DW$T$46
    2134                    
    2135                    
    2136                    DW$T$48 .dwtag  DW_TAG_structure_type
    2137                            .dwattr DW$T$48, DW_AT_name("dsp_copyimg_t")
    2138                            .dwattr DW$T$48, DW_AT_byte_size(0x08)
    2139                    DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2140                            .dwattr DW$143, DW_AT_name("left_param"), DW_AT_symbol_name("_left_param")
    2141                            .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2142                            .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2143                    DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    2144                            .dwattr DW$144, DW_AT_name("right_param"), DW_AT_symbol_name("_right_param")
    2145                            .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   40

    2146                            .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2147                            .dwendtag DW$T$48
    2148                    
    2149                    
    2150                    DW$T$51 .dwtag  DW_TAG_structure_type
    2151                            .dwattr DW$T$51, DW_AT_name("dsp_testimg_t")
    2152                            .dwattr DW$T$51, DW_AT_byte_size(0x28)
    2153                    DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2154                            .dwattr DW$145, DW_AT_name("left_eye"), DW_AT_symbol_name("_left_eye")
    2155                            .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2156                            .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2157                    DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    2158                            .dwattr DW$146, DW_AT_name("right_eye"), DW_AT_symbol_name("_right_eye")
    2159                            .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2160                            .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2161                            .dwendtag DW$T$51
    2162                    
    2163                    
    2164                    DW$T$52 .dwtag  DW_TAG_structure_type
    2165                            .dwattr DW$T$52, DW_AT_name("dsp_distance_ctrl_t")
    2166                            .dwattr DW$T$52, DW_AT_byte_size(0x10)
    2167                    DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2168                            .dwattr DW$147, DW_AT_name("adc_noperson"), DW_AT_symbol_name("_adc_noperson")
    2169                            .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2170                            .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2171                    DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2172                            .dwattr DW$148, DW_AT_name("adc_toofar"), DW_AT_symbol_name("_adc_toofar")
    2173                            .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2174                            .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2175                    DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2176                            .dwattr DW$149, DW_AT_name("adc_ok"), DW_AT_symbol_name("_adc_ok")
    2177                            .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2178                            .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2179                    DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2180                            .dwattr DW$150, DW_AT_name("adc_tooclose"), DW_AT_symbol_name("_adc_tooclose")
    2181                            .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2182                            .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2183                    DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2184                            .dwattr DW$151, DW_AT_name("adc_smooth"), DW_AT_symbol_name("_adc_smooth")
    2185                            .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2186                            .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2187                    DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2188                            .dwattr DW$152, DW_AT_name("adc_noperson_disp"), DW_AT_symbol_name("_adc_noperson_disp")
    2189                            .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2190                            .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2191                    DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2192                            .dwattr DW$153, DW_AT_name("adc_play_sound"), DW_AT_symbol_name("_adc_play_sound")
    2193                            .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2194                            .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2195                    DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    2196                            .dwattr DW$154, DW_AT_name("adc_nouse"), DW_AT_symbol_name("_adc_nouse")
    2197                            .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2198                            .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2199                            .dwendtag DW$T$52
    2200                    
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   41

    2201                    
    2202                    DW$T$55 .dwtag  DW_TAG_structure_type
    2203                            .dwattr DW$T$55, DW_AT_name("dsp_buildtime_t")
    2204                            .dwattr DW$T$55, DW_AT_byte_size(0x20)
    2205                    DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    2206                            .dwattr DW$155, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
    2207                            .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2208                            .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2209                            .dwendtag DW$T$55
    2210                    
    2211                    
    2212                    DW$T$56 .dwtag  DW_TAG_structure_type
    2213                            .dwattr DW$T$56, DW_AT_name("switch_control_t")
    2214                            .dwattr DW$T$56, DW_AT_byte_size(0x04)
    2215                    DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2216                            .dwattr DW$156, DW_AT_name("ctrls"), DW_AT_symbol_name("_ctrls")
    2217                            .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2218                            .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2219                            .dwendtag DW$T$56
    2220                    
    2221                    
    2222                    DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    2223                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    2224                            .dwattr DW$T$45, DW_AT_byte_size(0x08)
    2225                    DW$157  .dwtag  DW_TAG_subrange_type
    2226                            .dwattr DW$157, DW_AT_upper_bound(0x07)
    2227                            .dwendtag DW$T$45
    2228                    
    2229                    DW$T$8  .dwtag  DW_TAG_base_type, DW_AT_name("short")
    2230                            .dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
    2231                            .dwattr DW$T$8, DW_AT_byte_size(0x02)
    2232                    
    2233                    DW$T$41 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    2234                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    2235                            .dwattr DW$T$41, DW_AT_byte_size(0x50)
    2236                    DW$158  .dwtag  DW_TAG_subrange_type
    2237                            .dwattr DW$158, DW_AT_upper_bound(0x13)
    2238                            .dwendtag DW$T$41
    2239                    
    2240                    
    2241                    DW$T$23 .dwtag  DW_TAG_structure_type
    2242                            .dwattr DW$T$23, DW_AT_name("dsp_image_msg_t")
    2243                            .dwattr DW$T$23, DW_AT_byte_size(0x34)
    2244                    DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2245                            .dwattr DW$159, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    2246                            .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2247                            .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2248                    DW$160  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2249                            .dwattr DW$160, DW_AT_name("img_saved_score_l"), DW_AT_symbol_name("_img_saved_score_l")
    2250                            .dwattr DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2251                            .dwattr DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2252                    DW$161  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2253                            .dwattr DW$161, DW_AT_name("img_saved_score_r"), DW_AT_symbol_name("_img_saved_score_r")
    2254                            .dwattr DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2255                            .dwattr DW$161, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   42

    2256                    DW$162  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2257                            .dwattr DW$162, DW_AT_name("img_ptr_l"), DW_AT_symbol_name("_img_ptr_l")
    2258                            .dwattr DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2259                            .dwattr DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2260                    DW$163  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    2261                            .dwattr DW$163, DW_AT_name("img_ptr_r"), DW_AT_symbol_name("_img_ptr_r")
    2262                            .dwattr DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2263                            .dwattr DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2264                    DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2265                            .dwattr DW$164, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    2266                            .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2267                            .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2268                    DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2269                            .dwattr DW$165, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    2270                            .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2271                            .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2272                    DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2273                            .dwattr DW$166, DW_AT_name("img_saved_count_l"), DW_AT_symbol_name("_img_saved_count_l")
    2274                            .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2275                            .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2276                    DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2277                            .dwattr DW$167, DW_AT_name("img_saved_count_r"), DW_AT_symbol_name("_img_saved_count_r")
    2278                            .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2279                            .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2280                    DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2281                            .dwattr DW$168, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    2282                            .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2283                            .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2284                    DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2285                            .dwattr DW$169, DW_AT_name("data_type_l"), DW_AT_symbol_name("_data_type_l")
    2286                            .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2287                            .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2288                    DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2289                            .dwattr DW$170, DW_AT_name("data_type_r"), DW_AT_symbol_name("_data_type_r")
    2290                            .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    2291                            .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2292                            .dwendtag DW$T$23
    2293                    
    2294                    
    2295                    DW$T$24 .dwtag  DW_TAG_structure_type
    2296                            .dwattr DW$T$24, DW_AT_name("dsp_result_msg_t")
    2297                            .dwattr DW$T$24, DW_AT_byte_size(0x1c)
    2298                    DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    2299                            .dwattr DW$171, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    2300                            .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                            .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2302                    DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2303                            .dwattr DW$172, DW_AT_name("result_left"), DW_AT_symbol_name("_result_left")
    2304                            .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2305                            .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2306                    DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2307                            .dwattr DW$173, DW_AT_name("result_right"), DW_AT_symbol_name("_result_right")
    2308                            .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2309                            .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2310                    DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   43

    2311                            .dwattr DW$174, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    2312                            .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2313                            .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2314                    DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    2315                            .dwattr DW$175, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    2316                            .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2317                            .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2318                    DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2319                            .dwattr DW$176, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    2320                            .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2321                            .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2322                            .dwendtag DW$T$24
    2323                    
    2324                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_memory_t"), DW_AT_type(*DW$T$35)
    2325                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    2326                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    2327                            .dwattr DW$T$47, DW_AT_address_class(0x20)
    2328                    DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_img_t"), DW_AT_type(*DW$T$49)
    2329                            .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    2330                    
    2331                    DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$53)
    2332                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    2333                            .dwattr DW$T$54, DW_AT_byte_size(0x20)
    2334                    DW$177  .dwtag  DW_TAG_subrange_type
    2335                            .dwattr DW$177, DW_AT_upper_bound(0x1f)
    2336                            .dwendtag DW$T$54
    2337                    
    2338                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    2339                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    2340                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    2341                    DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
    2342                            .dwattr DW$T$22, DW_AT_address_class(0x20)
    2343                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
    2344                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    2345                    
    2346                    DW$T$35 .dwtag  DW_TAG_structure_type
    2347                            .dwattr DW$T$35, DW_AT_name("dsp_tsk_memory_t")
    2348                            .dwattr DW$T$35, DW_AT_byte_size(0x08)
    2349                    DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2350                            .dwattr DW$178, DW_AT_name("dataptr_len"), DW_AT_symbol_name("_dataptr_len")
    2351                            .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2352                            .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2353                    DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    2354                            .dwattr DW$179, DW_AT_name("data_ptr"), DW_AT_symbol_name("_data_ptr")
    2355                            .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2356                            .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2357                            .dwendtag DW$T$35
    2358                    
    2359                    
    2360                    DW$T$49 .dwtag  DW_TAG_structure_type
    2361                            .dwattr DW$T$49, DW_AT_name("dsp_img_t")
    2362                            .dwattr DW$T$49, DW_AT_byte_size(0x14)
    2363                    DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2364                            .dwattr DW$180, DW_AT_name("tag_arm"), DW_AT_symbol_name("_tag_arm")
    2365                            .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   44

    2366                            .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2367                    DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2368                            .dwattr DW$181, DW_AT_name("tag_dsp"), DW_AT_symbol_name("_tag_dsp")
    2369                            .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2370                            .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2371                    DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    2372                            .dwattr DW$182, DW_AT_name("type"), DW_AT_symbol_name("_type")
    2373                            .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2374                            .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2375                    DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    2376                            .dwattr DW$183, DW_AT_name("img_data"), DW_AT_symbol_name("_img_data")
    2377                            .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2378                            .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2379                            .dwendtag DW$T$49
    2380                    
    2381                    
    2382                    DW$T$20 .dwtag  DW_TAG_structure_type
    2383                            .dwattr DW$T$20, DW_AT_name("QUE_Elem")
    2384                            .dwattr DW$T$20, DW_AT_byte_size(0x08)
    2385                    DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2386                            .dwattr DW$184, DW_AT_name("next"), DW_AT_symbol_name("_next")
    2387                            .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2388                            .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2389                    DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    2390                            .dwattr DW$185, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
    2391                            .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2392                            .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2393                            .dwendtag DW$T$20
    2394                    
    2395                    DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    2396                            .dwattr DW$T$19, DW_AT_address_class(0x20)
    2397                    
    2398                            .dwattr DW$32, DW_AT_external(0x01)
    2399                            .dwattr DW$32, DW_AT_type(*DW$T$10)
    2400                            .dwattr DW$30, DW_AT_external(0x01)
    2401                            .dwattr DW$30, DW_AT_type(*DW$T$10)
    2402                            .dwattr DW$20, DW_AT_external(0x01)
    2403                            .dwattr DW$20, DW_AT_type(*DW$T$10)
    2404                            .dwattr DW$29, DW_AT_external(0x01)
    2405                            .dwattr DW$29, DW_AT_type(*DW$T$10)
    2406                            .dwattr DW$28, DW_AT_external(0x01)
    2407                            .dwattr DW$28, DW_AT_type(*DW$T$10)
    2408                            .dwattr DW$33, DW_AT_external(0x01)
    2409                            .dwattr DW$33, DW_AT_type(*DW$T$10)
    2410                            .dwattr DW$24, DW_AT_external(0x01)
    2411                            .dwattr DW$24, DW_AT_type(*DW$T$10)
    2412                            .dwattr DW$25, DW_AT_external(0x01)
    2413                            .dwattr DW$25, DW_AT_type(*DW$T$10)
    2414                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    2415                    
    2416                    ;***************************************************************
    2417                    ;* DWARF CIE ENTRIES                                           *
    2418                    ;***************************************************************
    2419                    
    2420                    DW$CIE  .dwcie 1, 126
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:28 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9682                                PAGE   45

    2421                            .dwcfa  0x0c, 31, 0
    2422                            .dwcfa  0x07, 0
    2423                            .dwcfa  0x07, 1
    2424                            .dwcfa  0x07, 2
    2425                            .dwcfa  0x07, 3
    2426                            .dwcfa  0x07, 4
    2427                            .dwcfa  0x07, 5
    2428                            .dwcfa  0x07, 6
    2429                            .dwcfa  0x07, 7
    2430                            .dwcfa  0x07, 8
    2431                            .dwcfa  0x07, 9
    2432                            .dwcfa  0x08, 10
    2433                            .dwcfa  0x08, 11
    2434                            .dwcfa  0x08, 12
    2435                            .dwcfa  0x08, 13
    2436                            .dwcfa  0x08, 14
    2437                            .dwcfa  0x08, 15
    2438                            .dwcfa  0x07, 16
    2439                            .dwcfa  0x07, 17
    2440                            .dwcfa  0x07, 18
    2441                            .dwcfa  0x07, 19
    2442                            .dwcfa  0x07, 20
    2443                            .dwcfa  0x07, 21
    2444                            .dwcfa  0x07, 22
    2445                            .dwcfa  0x07, 23
    2446                            .dwcfa  0x07, 24
    2447                            .dwcfa  0x07, 25
    2448                            .dwcfa  0x08, 26
    2449                            .dwcfa  0x08, 27
    2450                            .dwcfa  0x08, 28
    2451                            .dwcfa  0x08, 29
    2452                            .dwcfa  0x08, 30
    2453                            .dwcfa  0x08, 31
