TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Jan 07 14:23:31 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    4762                            .dwattr DW$T$115, DW_AT_language(DW_LANG_C)
    4763                    DW$157  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    4764                    DW$158  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    4765                    DW$159  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$114)
    4766                    DW$160  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    4767                            .dwendtag DW$T$115
    4768                    
    4769                    
    4770                    DW$T$117        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    4771                            .dwattr DW$T$117, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   89

    4772                    DW$161  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$100)
    4773                            .dwendtag DW$T$117
    4774                    
    4775                    
    4776                    DW$T$119        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    4777                            .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    4778                    
    4779                    DW$T$121        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    4780                            .dwattr DW$T$121, DW_AT_language(DW_LANG_C)
    4781                    DW$162  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
    4782                            .dwendtag DW$T$121
    4783                    
    4784                    
    4785                    DW$T$123        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    4786                            .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    4787                            .dwattr DW$T$123, DW_AT_byte_size(0x08)
    4788                    DW$163  .dwtag  DW_TAG_subrange_type
    4789                            .dwattr DW$163, DW_AT_upper_bound(0x01)
    4790                            .dwendtag DW$T$123
    4791                    
    4792                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    4793                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    4794                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    4795                    DW$T$126        .dwtag  DW_TAG_volatile_type
    4796                            .dwattr DW$T$126, DW_AT_type(*DW$T$29)
    4797                    DW$T$96 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    4798                            .dwattr DW$T$96, DW_AT_language(DW_LANG_C)
    4799                    DW$T$105        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$96)
    4800                            .dwattr DW$T$105, DW_AT_address_class(0x20)
    4801                    DW$T$114        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$11)
    4802                            .dwattr DW$T$114, DW_AT_address_class(0x20)
    4803                    DW$T$127        .dwtag  DW_TAG_typedef, DW_AT_name("LgUns"), DW_AT_type(*DW$T$11)
    4804                            .dwattr DW$T$127, DW_AT_language(DW_LANG_C)
    4805                    DW$T$89 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Handle"), DW_AT_type(*DW$T$19)
    4806                            .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    4807                    DW$T$128        .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
    4808                            .dwattr DW$T$128, DW_AT_language(DW_LANG_C)
    4809                    DW$T$100        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$99)
    4810                            .dwattr DW$T$100, DW_AT_address_class(0x20)
    4811                    DW$T$111        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$53)
    4812                            .dwattr DW$T$111, DW_AT_address_class(0x20)
    4813                    DW$T$130        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$129)
    4814                            .dwattr DW$T$130, DW_AT_address_class(0x20)
    4815                    DW$T$132        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_reg_t"), DW_AT_type(*DW$T$84)
    4816                            .dwattr DW$T$132, DW_AT_language(DW_LANG_C)
    4817                    DW$T$134        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$133)
    4818                            .dwattr DW$T$134, DW_AT_address_class(0x20)
    4819                    DW$T$95 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$94)
    4820                            .dwattr DW$T$95, DW_AT_language(DW_LANG_C)
    4821                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    4822                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4823                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    4824                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    4825                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    4826                    DW$T$29 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   90

    4827                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
    4828                    
    4829                    DW$T$20 .dwtag  DW_TAG_structure_type
    4830                            .dwattr DW$T$20, DW_AT_name("QUE_Elem")
    4831                            .dwattr DW$T$20, DW_AT_byte_size(0x08)
    4832                    DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4833                            .dwattr DW$164, DW_AT_name("next"), DW_AT_symbol_name("_next")
    4834                            .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4835                            .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    4836                    DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    4837                            .dwattr DW$165, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
    4838                            .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4839                            .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    4840                            .dwendtag DW$T$20
    4841                    
    4842                    DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    4843                            .dwattr DW$T$19, DW_AT_address_class(0x20)
    4844                    DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_procimg_t"), DW_AT_type(*DW$T$32)
    4845                            .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    4846                    DW$T$53 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    4847                            .dwattr DW$T$53, DW_AT_encoding(DW_ATE_signed_char)
    4848                            .dwattr DW$T$53, DW_AT_byte_size(0x01)
    4849                    DW$T$129        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$70)
    4850                            .dwattr DW$T$129, DW_AT_language(DW_LANG_C)
    4851                    
    4852                    DW$T$84 .dwtag  DW_TAG_structure_type
    4853                            .dwattr DW$T$84, DW_AT_name("dsp_reg_t")
    4854                            .dwattr DW$T$84, DW_AT_byte_size(0xb4)
    4855                    DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    4856                            .dwattr DW$166, DW_AT_name("status_reg"), DW_AT_symbol_name("_status_reg")
    4857                            .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4858                            .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    4859                    DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$79)
    4860                            .dwattr DW$167, DW_AT_name("distance_reg"), DW_AT_symbol_name("_distance_reg")
    4861                            .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4862                            .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    4863                    DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    4864                            .dwattr DW$168, DW_AT_name("policy_reg"), DW_AT_symbol_name("_policy_reg")
    4865                            .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    4866                            .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    4867                    DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$81)
    4868                            .dwattr DW$169, DW_AT_name("sound_reg"), DW_AT_symbol_name("_sound_reg")
    4869                            .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    4870                            .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    4871                    DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$82)
    4872                            .dwattr DW$170, DW_AT_name("result_reg"), DW_AT_symbol_name("_result_reg")
    4873                            .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    4874                            .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    4875                    DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$83)
    4876                            .dwattr DW$171, DW_AT_name("quality_value"), DW_AT_symbol_name("_quality_value")
    4877                            .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    4878                            .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    4879                    DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4880                            .dwattr DW$172, DW_AT_name("quality_count"), DW_AT_symbol_name("_quality_count")
    4881                            .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   91

    4882                            .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    4883                    DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4884                            .dwattr DW$173, DW_AT_name("alg_control_count"), DW_AT_symbol_name("_alg_control_count")
    4885                            .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    4886                            .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    4887                    DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4888                            .dwattr DW$174, DW_AT_name("last_img_quality"), DW_AT_symbol_name("_last_img_quality")
    4889                            .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    4890                            .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    4891                    DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4892                            .dwattr DW$175, DW_AT_name("last_icon_id"), DW_AT_symbol_name("_last_icon_id")
    4893                            .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    4894                            .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    4895                    DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4896                            .dwattr DW$176, DW_AT_name("match_input_count"), DW_AT_symbol_name("_match_input_count")
    4897                            .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    4898                            .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    4899                            .dwendtag DW$T$84
    4900                    
    4901                    DW$T$133        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_iden_feature_t"), DW_AT_type(*DW$T$8
    4902                            .dwattr DW$T$133, DW_AT_language(DW_LANG_C)
    4903                    
    4904                    DW$T$94 .dwtag  DW_TAG_enumeration_type
    4905                            .dwattr DW$T$94, DW_AT_byte_size(0x04)
    4906                    DW$177  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
    4907                    DW$178  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
    4908                    DW$179  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
    4909                    DW$180  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
    4910                    DW$181  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
    4911                    DW$182  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
    4912                            .dwendtag DW$T$94
    4913                    
    4914                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    4915                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4916                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    4917                    
    4918                    DW$T$83 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    4919                            .dwattr DW$T$83, DW_AT_language(DW_LANG_C)
    4920                            .dwattr DW$T$83, DW_AT_byte_size(0x28)
    4921                    DW$183  .dwtag  DW_TAG_subrange_type
    4922                            .dwattr DW$183, DW_AT_upper_bound(0x09)
    4923                            .dwendtag DW$T$83
    4924                    
    4925                    
    4926                    DW$T$32 .dwtag  DW_TAG_structure_type
    4927                            .dwattr DW$T$32, DW_AT_name("dsp_procimg_t")
    4928                            .dwattr DW$T$32, DW_AT_byte_size(0x1c)
    4929                    DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    4930                            .dwattr DW$184, DW_AT_name("img_msg"), DW_AT_symbol_name("_img_msg")
    4931                            .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4932                            .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    4933                    DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    4934                            .dwattr DW$185, DW_AT_name("result_msg"), DW_AT_symbol_name("_result_msg")
    4935                            .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4936                            .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   92

    4937                    DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    4938                            .dwattr DW$186, DW_AT_name("last_flag"), DW_AT_symbol_name("_last_flag")
    4939                            .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4940                            .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    4941                    DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
    4942                            .dwattr DW$187, DW_AT_name("img_grab_count"), DW_AT_symbol_name("_img_grab_count")
    4943                            .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4944                            .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    4945                    DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
    4946                            .dwattr DW$188, DW_AT_name("begin_quality"), DW_AT_symbol_name("_begin_quality")
    4947                            .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4948                            .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    4949                    DW$189  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    4950                            .dwattr DW$189, DW_AT_name("need_eye"), DW_AT_symbol_name("_need_eye")
    4951                            .dwattr DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4952                            .dwattr DW$189, DW_AT_accessibility(DW_ACCESS_public)
    4953                    DW$190  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    4954                            .dwattr DW$190, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    4955                            .dwattr DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4956                            .dwattr DW$190, DW_AT_accessibility(DW_ACCESS_public)
    4957                            .dwendtag DW$T$32
    4958                    
    4959                    
    4960                    DW$T$70 .dwtag  DW_TAG_structure_type
    4961                            .dwattr DW$T$70, DW_AT_name("dsp_tsk_totalreg_t")
    4962                            .dwattr DW$T$70, DW_AT_byte_size(0x138)
    4963                    DW$191  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$57)
    4964                            .dwattr DW$191, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
    4965                            .dwattr DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4966                            .dwattr DW$191, DW_AT_accessibility(DW_ACCESS_public)
    4967                    DW$192  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    4968                            .dwattr DW$192, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
    4969                            .dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4970                            .dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
    4971                    DW$193  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
    4972                            .dwattr DW$193, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
    4973                            .dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4974                            .dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
    4975                    DW$194  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    4976                            .dwattr DW$194, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
    4977                            .dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    4978                            .dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
    4979                    DW$195  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    4980                            .dwattr DW$195, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
    4981                            .dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    4982                            .dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
    4983                    DW$196  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    4984                            .dwattr DW$196, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
    4985                            .dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    4986                            .dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
    4987                    DW$197  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
    4988                            .dwattr DW$197, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
    4989                            .dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    4990                            .dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
    4991                    DW$198  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   93

    4992                            .dwattr DW$198, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
    4993                            .dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    4994                            .dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
    4995                    DW$199  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
    4996                            .dwattr DW$199, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
    4997                            .dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    4998                            .dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
    4999                    DW$200  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    5000                            .dwattr DW$200, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
    5001                            .dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    5002                            .dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
    5003                    DW$201  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
    5004                            .dwattr DW$201, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
    5005                            .dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    5006                            .dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
    5007                    DW$202  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$67)
    5008                            .dwattr DW$202, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg
    5009                            .dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    5010                            .dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
    5011                    DW$203  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    5012                            .dwattr DW$203, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
    5013                            .dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    5014                            .dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
    5015                    DW$204  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
    5016                            .dwattr DW$204, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
    5017                            .dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    5018                            .dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
    5019                            .dwendtag DW$T$70
    5020                    
    5021                    DW$T$78 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_status_t"), DW_AT_type(*DW$T$71)
    5022                            .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    5023                    DW$T$79 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_t"), DW_AT_type(*DW$T$72)
    5024                            .dwattr DW$T$79, DW_AT_language(DW_LANG_C)
    5025                    DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("policy_t"), DW_AT_type(*DW$T$74)
    5026                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    5027                    DW$T$81 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_sound_t"), DW_AT_type(*DW$T$75)
    5028                            .dwattr DW$T$81, DW_AT_language(DW_LANG_C)
    5029                    DW$T$82 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_t"), DW_AT_type(*DW$T$77)
    5030                            .dwattr DW$T$82, DW_AT_language(DW_LANG_C)
    5031                    
    5032                    DW$T$87 .dwtag  DW_TAG_structure_type
    5033                            .dwattr DW$T$87, DW_AT_name("dsp_algorithm_iden_feature_t")
    5034                            .dwattr DW$T$87, DW_AT_byte_size(0x10)
    5035                    DW$205  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5036                            .dwattr DW$205, DW_AT_name("single_feature_len"), DW_AT_symbol_name("_single_feature_len")
    5037                            .dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5038                            .dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
    5039                    DW$206  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5040                            .dwattr DW$206, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    5041                            .dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5042                            .dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
    5043                    DW$207  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$86)
    5044                            .dwattr DW$207, DW_AT_name("iden_feature_data"), DW_AT_symbol_name("_iden_feature_data")
    5045                            .dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5046                            .dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   94

    5047                            .dwendtag DW$T$87
    5048                    
    5049                    DW$T$26 .dwtag  DW_TAG_typedef, DW_AT_name("IMAGE_MSG"), DW_AT_type(*DW$T$25)
    5050                            .dwattr DW$T$26, DW_AT_language(DW_LANG_C)
    5051                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("RESULT_MSG"), DW_AT_type(*DW$T$27)
    5052                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    5053                    DW$T$57 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$33)
    5054                            .dwattr DW$T$57, DW_AT_language(DW_LANG_C)
    5055                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$34)
    5056                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    5057                    DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$37)
    5058                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    5059                    DW$T$59 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$39)
    5060                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    5061                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$40)
    5062                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    5063                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$42)
    5064                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    5065                    DW$T$62 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$43)
    5066                            .dwattr DW$T$62, DW_AT_language(DW_LANG_C)
    5067                    DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$44)
    5068                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    5069                    DW$T$64 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$46)
    5070                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    5071                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$48)
    5072                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    5073                    DW$T$66 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$51)
    5074                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    5075                    DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$52)
    5076                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    5077                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$55)
    5078                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    5079                    DW$T$69 .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$56)
    5080                            .dwattr DW$T$69, DW_AT_language(DW_LANG_C)
    5081                    
    5082                    DW$T$71 .dwtag  DW_TAG_structure_type
    5083                            .dwattr DW$T$71, DW_AT_name("dsp_status_t")
    5084                            .dwattr DW$T$71, DW_AT_byte_size(0x18)
    5085                    DW$208  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5086                            .dwattr DW$208, DW_AT_name("tsk_img_status"), DW_AT_symbol_name("_tsk_img_status")
    5087                            .dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5088                            .dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
    5089                    DW$209  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5090                            .dwattr DW$209, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    5091                            .dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5092                            .dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
    5093                    DW$210  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5094                            .dwattr DW$210, DW_AT_name("tsk_alg_saved_status"), DW_AT_symbol_name("_tsk_alg_saved_status")
    5095                            .dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5096                            .dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
    5097                    DW$211  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5098                            .dwattr DW$211, DW_AT_name("tsk_alg_inuse"), DW_AT_symbol_name("_tsk_alg_inuse")
    5099                            .dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5100                            .dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
    5101                    DW$212  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   95

    5102                            .dwattr DW$212, DW_AT_name("proc_start_time"), DW_AT_symbol_name("_proc_start_time")
    5103                            .dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5104                            .dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
    5105                    DW$213  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5106                            .dwattr DW$213, DW_AT_name("proc_timeout"), DW_AT_symbol_name("_proc_timeout")
    5107                            .dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5108                            .dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
    5109                    DW$214  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5110                            .dwattr DW$214, DW_AT_name("tsk_testimg_tag_left"), DW_AT_symbol_name("_tsk_testimg_tag_left")
    5111                            .dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5112                            .dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
    5113                    DW$215  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5114                            .dwattr DW$215, DW_AT_name("tsk_testimg_tag_right"), DW_AT_symbol_name("_tsk_testimg_tag_right
    5115                            .dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5116                            .dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
    5117                            .dwendtag DW$T$71
    5118                    
    5119                    
    5120                    DW$T$72 .dwtag  DW_TAG_structure_type
    5121                            .dwattr DW$T$72, DW_AT_name("dsp_distance_t")
    5122                            .dwattr DW$T$72, DW_AT_byte_size(0x24)
    5123                    DW$216  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5124                            .dwattr DW$216, DW_AT_name("same_count"), DW_AT_symbol_name("_same_count")
    5125                            .dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5126                            .dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
    5127                    DW$217  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5128                            .dwattr DW$217, DW_AT_name("last_distance"), DW_AT_symbol_name("_last_distance")
    5129                            .dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5130                            .dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
    5131                    DW$218  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5132                            .dwattr DW$218, DW_AT_name("if_has_people"), DW_AT_symbol_name("_if_has_people")
    5133                            .dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5134                            .dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
    5135                    DW$219  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5136                            .dwattr DW$219, DW_AT_name("last_if_has"), DW_AT_symbol_name("_last_if_has")
    5137                            .dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5138                            .dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
    5139                    DW$220  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5140                            .dwattr DW$220, DW_AT_name("no_count"), DW_AT_symbol_name("_no_count")
    5141                            .dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5142                            .dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
    5143                    DW$221  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5144                            .dwattr DW$221, DW_AT_name("has_count"), DW_AT_symbol_name("_has_count")
    5145                            .dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5146                            .dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
    5147                    DW$222  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5148                            .dwattr DW$222, DW_AT_name("disp_count"), DW_AT_symbol_name("_disp_count")
    5149                            .dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5150                            .dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
    5151                    DW$223  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5152                            .dwattr DW$223, DW_AT_name("if_disp_image"), DW_AT_symbol_name("_if_disp_image")
    5153                            .dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5154                            .dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
    5155                    DW$224  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5156                            .dwattr DW$224, DW_AT_name("wait_frame"), DW_AT_symbol_name("_wait_frame")
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   96

    5157                            .dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5158                            .dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
    5159                            .dwendtag DW$T$72
    5160                    
    5161                    
    5162                    DW$T$74 .dwtag  DW_TAG_structure_type
    5163                            .dwattr DW$T$74, DW_AT_name("policy_t")
    5164                            .dwattr DW$T$74, DW_AT_byte_size(0x28)
    5165                    DW$225  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5166                            .dwattr DW$225, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    5167                            .dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5168                            .dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
    5169                    DW$226  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5170                            .dwattr DW$226, DW_AT_name("iden_count"), DW_AT_symbol_name("_iden_count")
    5171                            .dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5172                            .dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
    5173                    DW$227  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5174                            .dwattr DW$227, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    5175                            .dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5176                            .dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
    5177                    DW$228  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5178                            .dwattr DW$228, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    5179                            .dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5180                            .dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
    5181                    DW$229  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    5182                            .dwattr DW$229, DW_AT_name("enroll_score_l"), DW_AT_symbol_name("_enroll_score_l")
    5183                            .dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5184                            .dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
    5185                    DW$230  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    5186                            .dwattr DW$230, DW_AT_name("enroll_score_r"), DW_AT_symbol_name("_enroll_score_r")
    5187                            .dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5188                            .dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
    5189                            .dwendtag DW$T$74
    5190                    
    5191                    
    5192                    DW$T$75 .dwtag  DW_TAG_structure_type
    5193                            .dwattr DW$T$75, DW_AT_name("dsp_sound_t")
    5194                            .dwattr DW$T$75, DW_AT_byte_size(0x08)
    5195                    DW$231  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5196                            .dwattr DW$231, DW_AT_name("last_sound_time"), DW_AT_symbol_name("_last_sound_time")
    5197                            .dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5198                            .dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
    5199                    DW$232  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5200                            .dwattr DW$232, DW_AT_name("last_sound_value"), DW_AT_symbol_name("_last_sound_value")
    5201                            .dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5202                            .dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
    5203                            .dwendtag DW$T$75
    5204                    
    5205                    
    5206                    DW$T$77 .dwtag  DW_TAG_structure_type
    5207                            .dwattr DW$T$77, DW_AT_name("dsp_result_t")
    5208                            .dwattr DW$T$77, DW_AT_byte_size(0x0c)
    5209                    DW$233  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    5210                            .dwattr DW$233, DW_AT_name("count"), DW_AT_symbol_name("_count")
    5211                            .dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   97

    5212                            .dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
    5213                    DW$234  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    5214                            .dwattr DW$234, DW_AT_name("result"), DW_AT_symbol_name("_result")
    5215                            .dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5216                            .dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
    5217                    DW$235  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    5218                            .dwattr DW$235, DW_AT_name("grab_iden_result"), DW_AT_symbol_name("_grab_iden_result")
    5219                            .dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5220                            .dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
    5221                            .dwendtag DW$T$77
    5222                    
    5223                    DW$T$86 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_byte_data_t"), DW_AT_type(*DW$T$85)
    5224                            .dwattr DW$T$86, DW_AT_language(DW_LANG_C)
    5225                    
    5226                    DW$T$76 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
    5227                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    5228                            .dwattr DW$T$76, DW_AT_byte_size(0x04)
    5229                    DW$236  .dwtag  DW_TAG_subrange_type
    5230                            .dwattr DW$236, DW_AT_upper_bound(0x01)
    5231                            .dwendtag DW$T$76
    5232                    
    5233                    
    5234                    DW$T$73 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    5235                            .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    5236                            .dwattr DW$T$73, DW_AT_byte_size(0x10)
    5237                    DW$237  .dwtag  DW_TAG_subrange_type
    5238                            .dwattr DW$237, DW_AT_upper_bound(0x03)
    5239                            .dwendtag DW$T$73
    5240                    
    5241                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    5242                            .dwattr DW$T$25, DW_AT_address_class(0x20)
    5243                    DW$T$27 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    5244                            .dwattr DW$T$27, DW_AT_address_class(0x20)
    5245                    
    5246                    DW$T$33 .dwtag  DW_TAG_structure_type
    5247                            .dwattr DW$T$33, DW_AT_name("dsp_tsk_control_t")
    5248                            .dwattr DW$T$33, DW_AT_byte_size(0x0c)
    5249                    DW$238  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5250                            .dwattr DW$238, DW_AT_name("tsk_img_control"), DW_AT_symbol_name("_tsk_img_control")
    5251                            .dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5252                            .dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
    5253                    DW$239  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5254                            .dwattr DW$239, DW_AT_name("tsk_img_control_count"), DW_AT_symbol_name("_tsk_img_control_count
    5255                            .dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5256                            .dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
    5257                    DW$240  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5258                            .dwattr DW$240, DW_AT_name("tsk_alg_control"), DW_AT_symbol_name("_tsk_alg_control")
    5259                            .dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5260                            .dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
    5261                    DW$241  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5262                            .dwattr DW$241, DW_AT_name("tsk_alg_control_count"), DW_AT_symbol_name("_tsk_alg_control_count
    5263                            .dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5264                            .dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
    5265                    DW$242  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5266                            .dwattr DW$242, DW_AT_name("tsk_adc_value"), DW_AT_symbol_name("_tsk_adc_value")
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   98

    5267                            .dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5268                            .dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
    5269                            .dwendtag DW$T$33
    5270                    
    5271                    
    5272                    DW$T$34 .dwtag  DW_TAG_structure_type
    5273                            .dwattr DW$T$34, DW_AT_name("dsp_tsk_policy_t")
    5274                            .dwattr DW$T$34, DW_AT_byte_size(0x0c)
    5275                    DW$243  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5276                            .dwattr DW$243, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    5277                            .dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5278                            .dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
    5279                    DW$244  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5280                            .dwattr DW$244, DW_AT_name("try_count"), DW_AT_symbol_name("_try_count")
    5281                            .dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5282                            .dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
    5283                    DW$245  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5284                            .dwattr DW$245, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    5285                            .dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5286                            .dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
    5287                    DW$246  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5288                            .dwattr DW$246, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    5289                            .dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5290                            .dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
    5291                    DW$247  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5292                            .dwattr DW$247, DW_AT_name("policy_flag"), DW_AT_symbol_name("_policy_flag")
    5293                            .dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5294                            .dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
    5295                            .dwendtag DW$T$34
    5296                    
    5297                    
    5298                    DW$T$37 .dwtag  DW_TAG_structure_type
    5299                            .dwattr DW$T$37, DW_AT_name("dsp_tsk_flag_t")
    5300                            .dwattr DW$T$37, DW_AT_byte_size(0x1c)
    5301                    DW$248  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5302                            .dwattr DW$248, DW_AT_name("tsk_img_resp"), DW_AT_symbol_name("_tsk_img_resp")
    5303                            .dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5304                            .dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
    5305                    DW$249  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5306                            .dwattr DW$249, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    5307                            .dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5308                            .dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
    5309                    DW$250  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5310                            .dwattr DW$250, DW_AT_name("tsk_alg_status_count"), DW_AT_symbol_name("_tsk_alg_status_count")
    5311                            .dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5312                            .dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
    5313                    DW$251  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5314                            .dwattr DW$251, DW_AT_name("req_tsk_alg_control"), DW_AT_symbol_name("_req_tsk_alg_control")
    5315                            .dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5316                            .dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
    5317                    DW$252  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5318                            .dwattr DW$252, DW_AT_name("req_tsk_alg_control_count"), DW_AT_symbol_name("_req_tsk_alg_contr
    5319                            .dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5320                            .dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
    5321                    DW$253  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE   99

    5322                            .dwattr DW$253, DW_AT_name("left_data"), DW_AT_symbol_name("_left_data")
    5323                            .dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5324                            .dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
    5325                    DW$254  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    5326                            .dwattr DW$254, DW_AT_name("right_data"), DW_AT_symbol_name("_right_data")
    5327                            .dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5328                            .dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
    5329                            .dwendtag DW$T$37
    5330                    
    5331                    
    5332                    DW$T$39 .dwtag  DW_TAG_structure_type
    5333                            .dwattr DW$T$39, DW_AT_name("dsp_algorithm_result_t")
    5334                            .dwattr DW$T$39, DW_AT_byte_size(0x20)
    5335                    DW$255  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5336                            .dwattr DW$255, DW_AT_name("result_type"), DW_AT_symbol_name("_result_type")
    5337                            .dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5338                            .dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
    5339                    DW$256  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
    5340                            .dwattr DW$256, DW_AT_name("policy"), DW_AT_symbol_name("_policy")
    5341                            .dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5342                            .dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
    5343                    DW$257  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5344                            .dwattr DW$257, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    5345                            .dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5346                            .dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
    5347                    DW$258  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5348                            .dwattr DW$258, DW_AT_name("left_result"), DW_AT_symbol_name("_left_result")
    5349                            .dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5350                            .dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
    5351                    DW$259  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5352                            .dwattr DW$259, DW_AT_name("right_result"), DW_AT_symbol_name("_right_result")
    5353                            .dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5354                            .dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
    5355                    DW$260  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5356                            .dwattr DW$260, DW_AT_name("result_data"), DW_AT_symbol_name("_result_data")
    5357                            .dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5358                            .dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
    5359                            .dwendtag DW$T$39
    5360                    
    5361                    
    5362                    DW$T$40 .dwtag  DW_TAG_structure_type
    5363                            .dwattr DW$T$40, DW_AT_name("dsp_algorithm_sound_t")
    5364                            .dwattr DW$T$40, DW_AT_byte_size(0x08)
    5365                    DW$261  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5366                            .dwattr DW$261, DW_AT_name("sound_value"), DW_AT_symbol_name("_sound_value")
    5367                            .dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5368                            .dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
    5369                    DW$262  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5370                            .dwattr DW$262, DW_AT_name("sound_count"), DW_AT_symbol_name("_sound_count")
    5371                            .dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5372                            .dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
    5373                            .dwendtag DW$T$40
    5374                    
    5375                    
    5376                    DW$T$42 .dwtag  DW_TAG_structure_type
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE  100

    5377                            .dwattr DW$T$42, DW_AT_name("dsp_algorithm_devparam_t")
    5378                            .dwattr DW$T$42, DW_AT_byte_size(0x54)
    5379                    DW$263  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5380                            .dwattr DW$263, DW_AT_name("param_count"), DW_AT_symbol_name("_param_count")
    5381                            .dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5382                            .dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
    5383                    DW$264  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    5384                            .dwattr DW$264, DW_AT_name("device_param"), DW_AT_symbol_name("_device_param")
    5385                            .dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5386                            .dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
    5387                            .dwendtag DW$T$42
    5388                    
    5389                    
    5390                    DW$T$43 .dwtag  DW_TAG_structure_type
    5391                            .dwattr DW$T$43, DW_AT_name("dsp_tsk_watchdog_t")
    5392                            .dwattr DW$T$43, DW_AT_byte_size(0x08)
    5393                    DW$265  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5394                            .dwattr DW$265, DW_AT_name("tsk_img_watchdog"), DW_AT_symbol_name("_tsk_img_watchdog")
    5395                            .dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5396                            .dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
    5397                    DW$266  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5398                            .dwattr DW$266, DW_AT_name("tsk_alg_watchdog"), DW_AT_symbol_name("_tsk_alg_watchdog")
    5399                            .dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5400                            .dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
    5401                            .dwendtag DW$T$43
    5402                    
    5403                    
    5404                    DW$T$44 .dwtag  DW_TAG_structure_type
    5405                            .dwattr DW$T$44, DW_AT_name("dsp_icon_t")
    5406                            .dwattr DW$T$44, DW_AT_byte_size(0x14)
    5407                    DW$267  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5408                            .dwattr DW$267, DW_AT_name("req_icon_control"), DW_AT_symbol_name("_req_icon_control")
    5409                            .dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5410                            .dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
    5411                    DW$268  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5412                            .dwattr DW$268, DW_AT_name("req_icon_id"), DW_AT_symbol_name("_req_icon_id")
    5413                            .dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5414                            .dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
    5415                    DW$269  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5416                            .dwattr DW$269, DW_AT_name("dsp_icon_state"), DW_AT_symbol_name("_dsp_icon_state")
    5417                            .dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5418                            .dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
    5419                    DW$270  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    5420                            .dwattr DW$270, DW_AT_name("icon_data"), DW_AT_symbol_name("_icon_data")
    5421                            .dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5422                            .dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
    5423                            .dwendtag DW$T$44
    5424                    
    5425                    
    5426                    DW$T$46 .dwtag  DW_TAG_structure_type
    5427                            .dwattr DW$T$46, DW_AT_name("dsp_mac_t")
    5428                            .dwattr DW$T$46, DW_AT_byte_size(0x08)
    5429                    DW$271  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    5430                            .dwattr DW$271, DW_AT_name("mac_val"), DW_AT_symbol_name("_mac_val")
    5431                            .dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE  101

    5432                            .dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
    5433                            .dwendtag DW$T$46
    5434                    
    5435                    
    5436                    DW$T$48 .dwtag  DW_TAG_structure_type
    5437                            .dwattr DW$T$48, DW_AT_name("dsp_copyimg_t")
    5438                            .dwattr DW$T$48, DW_AT_byte_size(0x08)
    5439                    DW$272  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    5440                            .dwattr DW$272, DW_AT_name("left_param"), DW_AT_symbol_name("_left_param")
    5441                            .dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5442                            .dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
    5443                    DW$273  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$47)
    5444                            .dwattr DW$273, DW_AT_name("right_param"), DW_AT_symbol_name("_right_param")
    5445                            .dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5446                            .dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
    5447                            .dwendtag DW$T$48
    5448                    
    5449                    
    5450                    DW$T$51 .dwtag  DW_TAG_structure_type
    5451                            .dwattr DW$T$51, DW_AT_name("dsp_testimg_t")
    5452                            .dwattr DW$T$51, DW_AT_byte_size(0x28)
    5453                    DW$274  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    5454                            .dwattr DW$274, DW_AT_name("left_eye"), DW_AT_symbol_name("_left_eye")
    5455                            .dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5456                            .dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
    5457                    DW$275  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$50)
    5458                            .dwattr DW$275, DW_AT_name("right_eye"), DW_AT_symbol_name("_right_eye")
    5459                            .dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5460                            .dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
    5461                            .dwendtag DW$T$51
    5462                    
    5463                    
    5464                    DW$T$52 .dwtag  DW_TAG_structure_type
    5465                            .dwattr DW$T$52, DW_AT_name("dsp_distance_ctrl_t")
    5466                            .dwattr DW$T$52, DW_AT_byte_size(0x10)
    5467                    DW$276  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5468                            .dwattr DW$276, DW_AT_name("adc_noperson"), DW_AT_symbol_name("_adc_noperson")
    5469                            .dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5470                            .dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
    5471                    DW$277  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5472                            .dwattr DW$277, DW_AT_name("adc_toofar"), DW_AT_symbol_name("_adc_toofar")
    5473                            .dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    5474                            .dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
    5475                    DW$278  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5476                            .dwattr DW$278, DW_AT_name("adc_ok"), DW_AT_symbol_name("_adc_ok")
    5477                            .dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5478                            .dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
    5479                    DW$279  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5480                            .dwattr DW$279, DW_AT_name("adc_tooclose"), DW_AT_symbol_name("_adc_tooclose")
    5481                            .dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    5482                            .dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
    5483                    DW$280  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5484                            .dwattr DW$280, DW_AT_name("adc_smooth"), DW_AT_symbol_name("_adc_smooth")
    5485                            .dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5486                            .dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE  102

    5487                    DW$281  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5488                            .dwattr DW$281, DW_AT_name("adc_noperson_disp"), DW_AT_symbol_name("_adc_noperson_disp")
    5489                            .dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    5490                            .dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
    5491                    DW$282  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5492                            .dwattr DW$282, DW_AT_name("adc_play_sound"), DW_AT_symbol_name("_adc_play_sound")
    5493                            .dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5494                            .dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
    5495                    DW$283  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    5496                            .dwattr DW$283, DW_AT_name("adc_nouse"), DW_AT_symbol_name("_adc_nouse")
    5497                            .dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    5498                            .dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
    5499                            .dwendtag DW$T$52
    5500                    
    5501                    
    5502                    DW$T$55 .dwtag  DW_TAG_structure_type
    5503                            .dwattr DW$T$55, DW_AT_name("dsp_buildtime_t")
    5504                            .dwattr DW$T$55, DW_AT_byte_size(0x20)
    5505                    DW$284  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
    5506                            .dwattr DW$284, DW_AT_name("datetime"), DW_AT_symbol_name("_datetime")
    5507                            .dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5508                            .dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
    5509                            .dwendtag DW$T$55
    5510                    
    5511                    
    5512                    DW$T$56 .dwtag  DW_TAG_structure_type
    5513                            .dwattr DW$T$56, DW_AT_name("switch_control_t")
    5514                            .dwattr DW$T$56, DW_AT_byte_size(0x04)
    5515                    DW$285  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5516                            .dwattr DW$285, DW_AT_name("ctrls"), DW_AT_symbol_name("_ctrls")
    5517                            .dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5518                            .dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
    5519                            .dwendtag DW$T$56
    5520                    
    5521                    
    5522                    DW$T$85 .dwtag  DW_TAG_structure_type
    5523                            .dwattr DW$T$85, DW_AT_name("dsp_byte_data_t")
    5524                            .dwattr DW$T$85, DW_AT_byte_size(0x08)
    5525                    DW$286  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5526                            .dwattr DW$286, DW_AT_name("data_len"), DW_AT_symbol_name("_data_len")
    5527                            .dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5528                            .dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
    5529                    DW$287  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    5530                            .dwattr DW$287, DW_AT_name("data_byte"), DW_AT_symbol_name("_data_byte")
    5531                            .dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5532                            .dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
    5533                            .dwendtag DW$T$85
    5534                    
    5535                    
    5536                    DW$T$45 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
    5537                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    5538                            .dwattr DW$T$45, DW_AT_byte_size(0x08)
    5539                    DW$288  .dwtag  DW_TAG_subrange_type
    5540                            .dwattr DW$288, DW_AT_upper_bound(0x07)
    5541                            .dwendtag DW$T$45
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE  103

    5542                    
    5543                    DW$T$8  .dwtag  DW_TAG_base_type, DW_AT_name("short")
    5544                            .dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5545                            .dwattr DW$T$8, DW_AT_byte_size(0x02)
    5546                    
    5547                    DW$T$41 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    5548                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    5549                            .dwattr DW$T$41, DW_AT_byte_size(0x50)
    5550                    DW$289  .dwtag  DW_TAG_subrange_type
    5551                            .dwattr DW$289, DW_AT_upper_bound(0x13)
    5552                            .dwendtag DW$T$41
    5553                    
    5554                    
    5555                    DW$T$23 .dwtag  DW_TAG_structure_type
    5556                            .dwattr DW$T$23, DW_AT_name("dsp_image_msg_t")
    5557                            .dwattr DW$T$23, DW_AT_byte_size(0x34)
    5558                    DW$290  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    5559                            .dwattr DW$290, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    5560                            .dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5561                            .dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
    5562                    DW$291  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5563                            .dwattr DW$291, DW_AT_name("img_saved_score_l"), DW_AT_symbol_name("_img_saved_score_l")
    5564                            .dwattr DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5565                            .dwattr DW$291, DW_AT_accessibility(DW_ACCESS_public)
    5566                    DW$292  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5567                            .dwattr DW$292, DW_AT_name("img_saved_score_r"), DW_AT_symbol_name("_img_saved_score_r")
    5568                            .dwattr DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5569                            .dwattr DW$292, DW_AT_accessibility(DW_ACCESS_public)
    5570                    DW$293  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    5571                            .dwattr DW$293, DW_AT_name("img_ptr_l"), DW_AT_symbol_name("_img_ptr_l")
    5572                            .dwattr DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5573                            .dwattr DW$293, DW_AT_accessibility(DW_ACCESS_public)
    5574                    DW$294  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    5575                            .dwattr DW$294, DW_AT_name("img_ptr_r"), DW_AT_symbol_name("_img_ptr_r")
    5576                            .dwattr DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5577                            .dwattr DW$294, DW_AT_accessibility(DW_ACCESS_public)
    5578                    DW$295  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5579                            .dwattr DW$295, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    5580                            .dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5581                            .dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
    5582                    DW$296  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5583                            .dwattr DW$296, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    5584                            .dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    5585                            .dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
    5586                    DW$297  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5587                            .dwattr DW$297, DW_AT_name("img_saved_count_l"), DW_AT_symbol_name("_img_saved_count_l")
    5588                            .dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    5589                            .dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
    5590                    DW$298  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5591                            .dwattr DW$298, DW_AT_name("img_saved_count_r"), DW_AT_symbol_name("_img_saved_count_r")
    5592                            .dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    5593                            .dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
    5594                    DW$299  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5595                            .dwattr DW$299, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    5596                            .dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE  104

    5597                            .dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
    5598                    DW$300  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5599                            .dwattr DW$300, DW_AT_name("data_type_l"), DW_AT_symbol_name("_data_type_l")
    5600                            .dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    5601                            .dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
    5602                    DW$301  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5603                            .dwattr DW$301, DW_AT_name("data_type_r"), DW_AT_symbol_name("_data_type_r")
    5604                            .dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    5605                            .dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
    5606                            .dwendtag DW$T$23
    5607                    
    5608                    
    5609                    DW$T$24 .dwtag  DW_TAG_structure_type
    5610                            .dwattr DW$T$24, DW_AT_name("dsp_result_msg_t")
    5611                            .dwattr DW$T$24, DW_AT_byte_size(0x1c)
    5612                    DW$302  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    5613                            .dwattr DW$302, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    5614                            .dwattr DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5615                            .dwattr DW$302, DW_AT_accessibility(DW_ACCESS_public)
    5616                    DW$303  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5617                            .dwattr DW$303, DW_AT_name("result_left"), DW_AT_symbol_name("_result_left")
    5618                            .dwattr DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5619                            .dwattr DW$303, DW_AT_accessibility(DW_ACCESS_public)
    5620                    DW$304  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5621                            .dwattr DW$304, DW_AT_name("result_right"), DW_AT_symbol_name("_result_right")
    5622                            .dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5623                            .dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
    5624                    DW$305  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5625                            .dwattr DW$305, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    5626                            .dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5627                            .dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
    5628                    DW$306  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    5629                            .dwattr DW$306, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    5630                            .dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5631                            .dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
    5632                    DW$307  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5633                            .dwattr DW$307, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    5634                            .dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5635                            .dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
    5636                            .dwendtag DW$T$24
    5637                    
    5638                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_memory_t"), DW_AT_type(*DW$T$35)
    5639                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    5640                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$36)
    5641                            .dwattr DW$T$47, DW_AT_address_class(0x20)
    5642                    DW$T$50 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_img_t"), DW_AT_type(*DW$T$49)
    5643                            .dwattr DW$T$50, DW_AT_language(DW_LANG_C)
    5644                    
    5645                    DW$T$54 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$53)
    5646                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    5647                            .dwattr DW$T$54, DW_AT_byte_size(0x20)
    5648                    DW$308  .dwtag  DW_TAG_subrange_type
    5649                            .dwattr DW$308, DW_AT_upper_bound(0x1f)
    5650                            .dwendtag DW$T$54
    5651                    
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE  105

    5652                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
    5653                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    5654                    
    5655                    DW$T$35 .dwtag  DW_TAG_structure_type
    5656                            .dwattr DW$T$35, DW_AT_name("dsp_tsk_memory_t")
    5657                            .dwattr DW$T$35, DW_AT_byte_size(0x08)
    5658                    DW$309  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5659                            .dwattr DW$309, DW_AT_name("dataptr_len"), DW_AT_symbol_name("_dataptr_len")
    5660                            .dwattr DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5661                            .dwattr DW$309, DW_AT_accessibility(DW_ACCESS_public)
    5662                    DW$310  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    5663                            .dwattr DW$310, DW_AT_name("data_ptr"), DW_AT_symbol_name("_data_ptr")
    5664                            .dwattr DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5665                            .dwattr DW$310, DW_AT_accessibility(DW_ACCESS_public)
    5666                            .dwendtag DW$T$35
    5667                    
    5668                    
    5669                    DW$T$49 .dwtag  DW_TAG_structure_type
    5670                            .dwattr DW$T$49, DW_AT_name("dsp_img_t")
    5671                            .dwattr DW$T$49, DW_AT_byte_size(0x14)
    5672                    DW$311  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5673                            .dwattr DW$311, DW_AT_name("tag_arm"), DW_AT_symbol_name("_tag_arm")
    5674                            .dwattr DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    5675                            .dwattr DW$311, DW_AT_accessibility(DW_ACCESS_public)
    5676                    DW$312  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5677                            .dwattr DW$312, DW_AT_name("tag_dsp"), DW_AT_symbol_name("_tag_dsp")
    5678                            .dwattr DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5679                            .dwattr DW$312, DW_AT_accessibility(DW_ACCESS_public)
    5680                    DW$313  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    5681                            .dwattr DW$313, DW_AT_name("type"), DW_AT_symbol_name("_type")
    5682                            .dwattr DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    5683                            .dwattr DW$313, DW_AT_accessibility(DW_ACCESS_public)
    5684                    DW$314  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    5685                            .dwattr DW$314, DW_AT_name("img_data"), DW_AT_symbol_name("_img_data")
    5686                            .dwattr DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    5687                            .dwattr DW$314, DW_AT_accessibility(DW_ACCESS_public)
    5688                            .dwendtag DW$T$49
    5689                    
    5690                    
    5691                            .dwattr DW$40, DW_AT_external(0x01)
    5692                            .dwattr DW$40, DW_AT_type(*DW$T$10)
    5693                            .dwattr DW$83, DW_AT_external(0x01)
    5694                            .dwattr DW$83, DW_AT_type(*DW$T$10)
    5695                            .dwattr DW$113, DW_AT_external(0x01)
    5696                            .dwattr DW$113, DW_AT_type(*DW$T$10)
    5697                            .dwattr DW$109, DW_AT_external(0x01)
    5698                            .dwattr DW$109, DW_AT_type(*DW$T$10)
    5699                            .dwattr DW$89, DW_AT_external(0x01)
    5700                            .dwattr DW$100, DW_AT_external(0x01)
    5701                            .dwattr DW$140, DW_AT_external(0x01)
    5702                            .dwattr DW$121, DW_AT_external(0x01)
    5703                            .dwattr DW$129, DW_AT_external(0x01)
    5704                            .dwattr DW$115, DW_AT_external(0x01)
    5705                            .dwattr DW$70, DW_AT_external(0x01)
    5706                            .dwattr DW$70, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:31 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4522                                PAGE  106

    5707                            .dwattr DW$133, DW_AT_external(0x01)
    5708                            .dwattr DW$87, DW_AT_external(0x01)
    5709                            .dwattr DW$87, DW_AT_type(*DW$T$10)
    5710                            .dwattr DW$84, DW_AT_external(0x01)
    5711                            .dwattr DW$84, DW_AT_type(*DW$T$10)
    5712                            .dwattr DW$81, DW_AT_external(0x01)
    5713                            .dwattr DW$81, DW_AT_type(*DW$T$10)
    5714                            .dwattr DW$88, DW_AT_external(0x01)
    5715                            .dwattr DW$88, DW_AT_type(*DW$T$10)
    5716                            .dwattr DW$82, DW_AT_external(0x01)
    5717                            .dwattr DW$82, DW_AT_type(*DW$T$10)
    5718                            .dwattr DW$92, DW_AT_external(0x01)
    5719                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    5720                    
    5721                    ;***************************************************************
    5722                    ;* DWARF CIE ENTRIES                                           *
    5723                    ;***************************************************************
    5724                    
    5725                    DW$CIE  .dwcie 1, 126
    5726                            .dwcfa  0x0c, 31, 0
    5727                            .dwcfa  0x07, 0
    5728                            .dwcfa  0x07, 1
    5729                            .dwcfa  0x07, 2
    5730                            .dwcfa  0x07, 3
    5731                            .dwcfa  0x07, 4
    5732                            .dwcfa  0x07, 5
    5733                            .dwcfa  0x07, 6
    5734                            .dwcfa  0x07, 7
    5735                            .dwcfa  0x07, 8
    5736                            .dwcfa  0x07, 9
    5737                            .dwcfa  0x08, 10
    5738                            .dwcfa  0x08, 11
    5739                            .dwcfa  0x08, 12
    5740                            .dwcfa  0x08, 13
    5741                            .dwcfa  0x08, 14
    5742                            .dwcfa  0x08, 15
    5743                            .dwcfa  0x07, 16
    5744                            .dwcfa  0x07, 17
    5745                            .dwcfa  0x07, 18
