TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4962                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Jan 07 14:23:34 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    1439                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
    1440                    DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
    1441                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1442                    DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$33)
    1443                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
    1444                    
    1445                    DW$T$63 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
    1446                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1447                    DW$71   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1448                            .dwendtag DW$T$63
    1449                    
    1450                    
    1451                    DW$T$59 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1452                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    1453                    DW$72   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
    1454                    DW$73   .dwtag  DW_TAG_unspecified_parameters
    1455                            .dwendtag DW$T$59
    1456                    
    1457                    
    1458                    DW$T$61 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4962                                PAGE   28

    1459                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    1460                    
    1461                    DW$T$64 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
    1462                            .dwattr DW$T$64, DW_AT_language(DW_LANG_C)
    1463                    DW$74   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
    1464                    DW$75   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$11)
    1465                    DW$76   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1466                            .dwendtag DW$T$64
    1467                    
    1468                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
    1469                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1470                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    1471                    
    1472                    DW$T$65 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$24)
    1473                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1474                            .dwattr DW$T$65, DW_AT_byte_size(0x8a)
    1475                    DW$77   .dwtag  DW_TAG_subrange_type
    1476                            .dwattr DW$77, DW_AT_upper_bound(0x44)
    1477                            .dwendtag DW$T$65
    1478                    
    1479                    
    1480                    DW$T$66 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$24)
    1481                            .dwattr DW$T$66, DW_AT_language(DW_LANG_C)
    1482                            .dwattr DW$T$66, DW_AT_byte_size(0x200)
    1483                    DW$78   .dwtag  DW_TAG_subrange_type
    1484                            .dwattr DW$78, DW_AT_upper_bound(0xff)
    1485                            .dwendtag DW$T$66
    1486                    
    1487                    DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$26)
    1488                            .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
    1489                    DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("OV7725_Params"), DW_AT_type(*DW$T$28)
    1490                            .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
    1491                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
    1492                            .dwattr DW$T$47, DW_AT_address_class(0x20)
    1493                    DW$T$30 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1494                            .dwattr DW$T$30, DW_AT_encoding(DW_ATE_signed_char)
    1495                            .dwattr DW$T$30, DW_AT_byte_size(0x01)
    1496                    DW$T$31 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
    1497                            .dwattr DW$T$31, DW_AT_address_class(0x20)
    1498                    DW$T$32 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$31)
    1499                            .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
    1500                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$43)
    1501                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    1502                    DW$T$3  .dwtag  DW_TAG_pointer_type
    1503                            .dwattr DW$T$3, DW_AT_address_class(0x20)
    1504                    DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$55)
    1505                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1506                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("OV7725_Reg"), DW_AT_type(*DW$T$19)
    1507                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
    1508                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
    1509                            .dwattr DW$T$26, DW_AT_address_class(0x20)
    1510                    
    1511                    DW$T$28 .dwtag  DW_TAG_structure_type
    1512                            .dwattr DW$T$28, DW_AT_byte_size(0x0c)
    1513                    DW$79   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4962                                PAGE   29

    1514                            .dwattr DW$79, DW_AT_name("num"), DW_AT_symbol_name("_num")
    1515                            .dwattr DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                            .dwattr DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1517                    DW$80   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1518                            .dwattr DW$80, DW_AT_name("reg"), DW_AT_symbol_name("_reg")
    1519                            .dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1520                            .dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1521                    DW$81   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    1522                            .dwattr DW$81, DW_AT_name("hI2C"), DW_AT_symbol_name("_hI2C")
    1523                            .dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1524                            .dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1525                            .dwendtag DW$T$28
    1526                    
    1527                    
    1528                    DW$T$43 .dwtag  DW_TAG_structure_type
    1529                            .dwattr DW$T$43, DW_AT_name("EDC_Fxns")
    1530                            .dwattr DW$T$43, DW_AT_byte_size(0x0c)
    1531                    DW$82   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1532                            .dwattr DW$82, DW_AT_name("open"), DW_AT_symbol_name("_open")
    1533                            .dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                            .dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1535                    DW$83   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
    1536                            .dwattr DW$83, DW_AT_name("close"), DW_AT_symbol_name("_close")
    1537                            .dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1538                            .dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1539                    DW$84   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
    1540                            .dwattr DW$84, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
    1541                            .dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1542                            .dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1543                            .dwendtag DW$T$43
    1544                    
    1545                    DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
    1546                            .dwattr DW$T$36, DW_AT_address_class(0x20)
    1547                    DW$T$55 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    1548                            .dwattr DW$T$55, DW_AT_language(DW_LANG_C)
    1549                    DW$T$39 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$38)
    1550                            .dwattr DW$T$39, DW_AT_address_class(0x20)
    1551                    DW$T$42 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$41)
    1552                            .dwattr DW$T$42, DW_AT_address_class(0x20)
    1553                    
    1554                    DW$T$19 .dwtag  DW_TAG_structure_type
    1555                            .dwattr DW$T$19, DW_AT_byte_size(0x02)
    1556                    DW$85   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1557                            .dwattr DW$85, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
    1558                            .dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1559                            .dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1560                    DW$86   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$6)
    1561                            .dwattr DW$86, DW_AT_name("val"), DW_AT_symbol_name("_val")
    1562                            .dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1563                            .dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1564                            .dwendtag DW$T$19
    1565                    
    1566                    DW$T$25 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    1567                            .dwattr DW$T$25, DW_AT_address_class(0x20)
    1568                    
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4962                                PAGE   30

    1569                    DW$T$23 .dwtag  DW_TAG_structure_type
    1570                            .dwattr DW$T$23, DW_AT_byte_size(0x14)
    1571                    DW$87   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1572                            .dwattr DW$87, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    1573                            .dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                            .dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1575                    DW$88   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1576                            .dwattr DW$88, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    1577                            .dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1578                            .dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1579                    DW$89   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1580                            .dwattr DW$89, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    1581                            .dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1582                            .dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1583                    DW$90   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1584                            .dwattr DW$90, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
    1585                            .dwattr DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1586                            .dwattr DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1587                    DW$91   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
    1588                            .dwattr DW$91, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
    1589                            .dwattr DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1590                            .dwattr DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1591                            .dwendtag DW$T$23
    1592                    
    1593                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    1594                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1595                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    1596                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    1597                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1598                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    1599                    
    1600                    DW$T$38 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
    1601                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
    1602                    DW$92   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
    1603                            .dwendtag DW$T$38
    1604                    
    1605                    
    1606                    DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$33)
    1607                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1608                    DW$93   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
    1609                    DW$94   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$40)
    1610                    DW$95   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
    1611                            .dwendtag DW$T$41
    1612                    
    1613                    DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
    1614                            .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
    1615                    DW$T$22 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$21)
    1616                            .dwattr DW$T$22, DW_AT_address_class(0x20)
    1617                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
    1618                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    1619                    DW$T$37 .dwtag  DW_TAG_typedef, DW_AT_name("Ptr"), DW_AT_type(*DW$T$3)
    1620                            .dwattr DW$T$37, DW_AT_language(DW_LANG_C)
    1621                    DW$T$21 .dwtag  DW_TAG_volatile_type
    1622                            .dwattr DW$T$21, DW_AT_type(*DW$T$20)
    1623                    
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:34 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI4962                                PAGE   31

    1624                            .dwattr DW$27, DW_AT_external(0x01)
    1625                            .dwattr DW$32, DW_AT_external(0x01)
    1626                            .dwattr DW$41, DW_AT_type(*DW$T$56)
    1627                            .dwattr DW$38, DW_AT_external(0x01)
    1628                            .dwattr DW$35, DW_AT_external(0x01)
    1629                            .dwattr DW$52, DW_AT_type(*DW$T$33)
    1630                            .dwattr DW$55, DW_AT_type(*DW$T$10)
    1631                            .dwattr DW$46, DW_AT_type(*DW$T$29)
    1632                            .dwattr DW$16, DW_AT_external(0x01)
    1633                            .dwattr DW$24, DW_AT_external(0x01)
    1634                            .dwattr DW$31, DW_AT_external(0x01)
    1635                            .dwattr DW$11, DW_AT_external(0x01)
    1636                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
    1637                    
    1638                    ;***************************************************************
    1639                    ;* DWARF CIE ENTRIES                                           *
    1640                    ;***************************************************************
    1641                    
