TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:37 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI7402                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Jan 07 14:23:37 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

     658                    DW$T$28 .dwtag  DW_TAG_subroutine_type
     659                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     660                    DW$41   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:37 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI7402                                PAGE   13

     661                    DW$42   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     662                    DW$43   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     663                            .dwendtag DW$T$28
     664                    
     665                    
     666                    DW$T$32 .dwtag  DW_TAG_subroutine_type
     667                            .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
     668                    DW$44   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
     669                    DW$45   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
     670                            .dwendtag DW$T$32
     671                    
     672                    
     673                    DW$T$34 .dwtag  DW_TAG_subroutine_type
     674                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     675                    DW$46   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$33)
     676                            .dwendtag DW$T$34
     677                    
     678                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     679                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     680                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     681                    
     682                    DW$T$39 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     683                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     684                    DW$47   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$36)
     685                    DW$48   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$38)
     686                            .dwendtag DW$T$39
     687                    
     688                    
     689                    DW$T$41 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     690                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
     691                    DW$49   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$37)
     692                    DW$50   .dwtag  DW_TAG_unspecified_parameters
     693                            .dwendtag DW$T$41
     694                    
     695                    
     696                    DW$T$42 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
     697                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     698                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
     699                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     700                    
     701                    DW$T$44 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     702                            .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
     703                    DW$51   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
     704                    DW$52   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     705                    DW$53   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
     706                            .dwendtag DW$T$44
     707                    
     708                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("GPIO_Handle"), DW_AT_type(*DW$T$24)
     709                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
     710                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$30)
     711                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     712                    DW$T$33 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     713                            .dwattr DW$T$33, DW_AT_encoding(DW_ATE_signed_char)
     714                            .dwattr DW$T$33, DW_AT_byte_size(0x01)
     715                    DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:37 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI7402                                PAGE   14

     716                            .dwattr DW$T$36, DW_AT_address_class(0x20)
     717                    DW$T$37 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
     718                            .dwattr DW$T$37, DW_AT_address_class(0x20)
     719                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("va_list"), DW_AT_type(*DW$T$37)
     720                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     721                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     722                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     723                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     724                    DW$T$24 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
     725                            .dwattr DW$T$24, DW_AT_address_class(0x20)
     726                    DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
     727                            .dwattr DW$T$30, DW_AT_address_class(0x20)
     728                    DW$T$35 .dwtag  DW_TAG_const_type
     729                            .dwattr DW$T$35, DW_AT_type(*DW$T$33)
     730                    
     731                    DW$T$22 .dwtag  DW_TAG_structure_type
     732                            .dwattr DW$T$22, DW_AT_byte_size(0x0c)
     733                    DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     734                            .dwattr DW$54, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     735                            .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     736                            .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     737                    DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     738                            .dwattr DW$55, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     739                            .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     740                            .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     741                    DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     742                            .dwattr DW$56, DW_AT_name("pinAllocMask"), DW_AT_symbol_name("_pinAllocMask")
     743                            .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     744                            .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     745                            .dwendtag DW$T$22
     746                    
     747                    
     748                    DW$T$23 .dwtag  DW_TAG_structure_type
     749                            .dwattr DW$T$23, DW_AT_byte_size(0x14)
     750                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     751                            .dwattr DW$57, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
     752                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     753                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     754                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     755                            .dwattr DW$58, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
     756                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     757                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     758                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     759                            .dwattr DW$59, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
     760                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     761                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     762                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     763                            .dwattr DW$60, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
     764                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     765                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     766                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     767                            .dwattr DW$61, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
     768                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     769                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     770                            .dwendtag DW$T$23
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:37 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI7402                                PAGE   15

     771                    
     772                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
     773                            .dwattr DW$T$21, DW_AT_address_class(0x20)
     774                    DW$T$20 .dwtag  DW_TAG_volatile_type
     775                            .dwattr DW$T$20, DW_AT_type(*DW$T$19)
     776                    
     777                            .dwattr DW$30, DW_AT_external(0x01)
     778                            .dwattr DW$27, DW_AT_external(0x01)
     779                            .dwattr DW$33, DW_AT_external(0x01)
     780                            .dwattr DW$36, DW_AT_external(0x01)
     781                            .dwattr DW$22, DW_AT_external(0x01)
     782                            .dwattr DW$17, DW_AT_external(0x01)
     783                            .dwattr DW$17, DW_AT_type(*DW$T$10)
     784                            .dwattr DW$CU, DW_AT_language(DW_LANG_C)
     785                    
     786                    ;***************************************************************
     787                    ;* DWARF CIE ENTRIES                                           *
     788                    ;***************************************************************
     789                    
     790                    DW$CIE  .dwcie 1, 126
     791                            .dwcfa  0x0c, 31, 0
     792                            .dwcfa  0x07, 0
     793                            .dwcfa  0x07, 1
     794                            .dwcfa  0x07, 2
     795                            .dwcfa  0x07, 3
     796                            .dwcfa  0x07, 4
     797                            .dwcfa  0x07, 5
     798                            .dwcfa  0x07, 6
     799                            .dwcfa  0x07, 7
     800                            .dwcfa  0x07, 8
     801                            .dwcfa  0x07, 9
     802                            .dwcfa  0x08, 10
     803                            .dwcfa  0x08, 11
     804                            .dwcfa  0x08, 12
     805                            .dwcfa  0x08, 13
     806                            .dwcfa  0x08, 14
     807                            .dwcfa  0x08, 15
     808                            .dwcfa  0x07, 16
     809                            .dwcfa  0x07, 17
     810                            .dwcfa  0x07, 18
     811                            .dwcfa  0x07, 19
     812                            .dwcfa  0x07, 20
     813                            .dwcfa  0x07, 21
     814                            .dwcfa  0x07, 22
     815                            .dwcfa  0x07, 23
     816                            .dwcfa  0x07, 24
     817                            .dwcfa  0x07, 25
     818                            .dwcfa  0x08, 26
     819                            .dwcfa  0x08, 27
     820                            .dwcfa  0x08, 28
     821                            .dwcfa  0x08, 29
     822                            .dwcfa  0x08, 30
     823                            .dwcfa  0x08, 31
     824                            .dwcfa  0x08, 32
     825                            .dwcfa  0x07, 33
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:37 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI7402                                PAGE   16

     826                            .dwcfa  0x07, 34
     827                            .dwcfa  0x07, 35
     828                            .dwcfa  0x07, 36
     829                            .dwcfa  0x07, 37
