TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Jan 07 14:23:39 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

      94 00000084 F010F010          .field          240,8                   ; _EMB_vDisParamsChan._cClipHigh @ 888
      95 00000088 00000000          .field          0,8                     ; _EMB_vDisParamsChan._yDefVal @ 896
      96 00000088 00000000          .field          0,8                     ; _EMB_vDisParamsChan._cbDefVal @ 904
      97 00000088 00000000          .field          0,8                     ; _EMB_vDisParamsChan._crDefVal @ 912
      98 00000088 00000000          .field          0,8
      99 0000008c 00000000          .field          0,32                    ; _EMB_vDisParamsChan._rgbX @ 928
     100 00000090 00000001          .field          1,32                    ; _EMB_vDisParamsChan._incPix @ 960
     101 00000094 00000050          .field          80,16                   ; _EMB_vDisParamsChan._thrld @ 992
     102 00000094 00000050          .field          0,16
     103 00000098 80000000          .field          -2147483648,32                  ; _EMB_vDisParamsChan._buf_addr @ 1024
     104 0000009c 00000001          .field          1,32                    ; _EMB_vDisParamsChan._mergeFlds @ 1056
     105 000000a0 00000001          .field          1,32                    ; _EMB_vDisParamsChan._edmaPri @ 1088
     106 000000a4 00000008          .field          8,32                    ; _EMB_vDisParamsChan._irqId @ 1120
     107          00000090  IR_1:   .set    144
     108                    
     109 000000a8                   .sect   ".cinit"
     110                            .align  8
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    3

     111 000000a8 00000020          .field          IR_2,32
     112 000000ac 00000094-         .field          _EMB_vDisParamsPort+0,32
     113 000000b0 00000000          .field          0,16                    ; _EMB_vDisParamsPort._dualChanEnable @ 0
     114 000000b0 00000000          .field          0,16
     115 000000b4 00000001          .field          1,32                    ; _EMB_vDisParamsPort._vclk1Polarity @ 32
     116 000000b8 00000000          .field          0,32                    ; _EMB_vDisParamsPort._vc1Polarity @ 64
     117 000000bc 00000000          .field          0,32                    ; _EMB_vDisParamsPort._vc2Polarity @ 96
     118 000000c0 00000000          .field          0,32                    ; _EMB_vDisParamsPort._vc3Polarity @ 128
     119 000000c4 FFFFFFFF          .field          -1,32                   ; _EMB_vDisParamsPort._edcTbl[0] @ 160
     120 000000c8 FFFFFFFF          .field          -1,32                   ; _EMB_vDisParamsPort._edcTbl[1] @ 192
     121 000000cc 00000365          .field          869,32                  ; _EMB_vDisParamsPort._pin_cfg @ 224
     122          00000020  IR_2:   .set    32
     123                    
     124                            .global _vdis_buf
     125 00000000           _vdis_buf:      .usect  ".far",4,4
     126                    DW$1    .dwtag  DW_TAG_variable, DW_AT_name("vdis_buf"), DW_AT_symbol_name("_vdis_buf")
     127                            .dwattr DW$1, DW_AT_location[DW_OP_addr _vdis_buf]
     128                            .dwattr DW$1, DW_AT_type(*DW$T$44)
     129                            .dwattr DW$1, DW_AT_external(0x01)
     130                            .global _EMB_vDisParamsChan
     131 00000004           _EMB_vDisParamsChan:    .usect  ".far",144,4
     132                    DW$2    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vDisParamsChan"), DW_AT_symbol_name("_EMB_vDisParamsC
     133                            .dwattr DW$2, DW_AT_location[DW_OP_addr _EMB_vDisParamsChan]
     134                            .dwattr DW$2, DW_AT_type(*DW$T$45)
     135                            .dwattr DW$2, DW_AT_external(0x01)
     136                            .global _EMB_vDisParamsPort
     137 00000094           _EMB_vDisParamsPort:    .usect  ".far",32,4
     138                    DW$3    .dwtag  DW_TAG_variable, DW_AT_name("EMB_vDisParamsPort"), DW_AT_symbol_name("_EMB_vDisParamsP
     139                            .dwattr DW$3, DW_AT_location[DW_OP_addr _EMB_vDisParamsPort]
     140                            .dwattr DW$3, DW_AT_type(*DW$T$46)
     141                            .dwattr DW$3, DW_AT_external(0x01)
     142                    ;       E:\CCStudio_v3.1\C6000\cgtools\bin\acp6x.exe -@C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2964 
     143                    
     144                    ;******************************************************************************
     145                    ;* TYPE INFORMATION                                                           *
     146                    ;******************************************************************************
     147                    DW$T$44 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$9)
     148                            .dwattr DW$T$44, DW_AT_address_class(0x20)
     149                    DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTDIS_Params"), DW_AT_type(*DW$T$23)
     150                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
     151                    DW$T$46 .dwtag  DW_TAG_typedef, DW_AT_name("VPORTDIS_PortParams"), DW_AT_type(*DW$T$43)
     152                            .dwattr DW$T$46, DW_AT_language(DW_LANG_C)
     153                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     154                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     155                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     156                    
     157                    DW$T$23 .dwtag  DW_TAG_structure_type
     158                            .dwattr DW$T$23, DW_AT_byte_size(0x90)
     159                    DW$4    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     160                            .dwattr DW$4, DW_AT_name("dmode"), DW_AT_symbol_name("_dmode")
     161                            .dwattr DW$4, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     162                            .dwattr DW$4, DW_AT_accessibility(DW_ACCESS_public)
     163                    DW$5    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     164                            .dwattr DW$5, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
     165                            .dwattr DW$5, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    4

     166                            .dwattr DW$5, DW_AT_accessibility(DW_ACCESS_public)
     167                    DW$6    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     168                            .dwattr DW$6, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
     169                            .dwattr DW$6, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     170                            .dwattr DW$6, DW_AT_accessibility(DW_ACCESS_public)
     171                    DW$7    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     172                            .dwattr DW$7, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
     173                            .dwattr DW$7, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     174                            .dwattr DW$7, DW_AT_accessibility(DW_ACCESS_public)
     175                    DW$8    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     176                            .dwattr DW$8, DW_AT_name("defValEn"), DW_AT_symbol_name("_defValEn")
     177                            .dwattr DW$8, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     178                            .dwattr DW$8, DW_AT_accessibility(DW_ACCESS_public)
     179                    DW$9    .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     180                            .dwattr DW$9, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
     181                            .dwattr DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     182                            .dwattr DW$9, DW_AT_accessibility(DW_ACCESS_public)
     183                    DW$10   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     184                            .dwattr DW$10, DW_AT_name("vctl1Config"), DW_AT_symbol_name("_vctl1Config")
     185                            .dwattr DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     186                            .dwattr DW$10, DW_AT_accessibility(DW_ACCESS_public)
     187                    DW$11   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     188                            .dwattr DW$11, DW_AT_name("vctl2Config"), DW_AT_symbol_name("_vctl2Config")
     189                            .dwattr DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     190                            .dwattr DW$11, DW_AT_accessibility(DW_ACCESS_public)
     191                    DW$12   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     192                            .dwattr DW$12, DW_AT_name("vctl3Config"), DW_AT_symbol_name("_vctl3Config")
     193                            .dwattr DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     194                            .dwattr DW$12, DW_AT_accessibility(DW_ACCESS_public)
     195                    DW$13   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     196                            .dwattr DW$13, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
     197                            .dwattr DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     198                            .dwattr DW$13, DW_AT_accessibility(DW_ACCESS_public)
     199                    DW$14   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     200                            .dwattr DW$14, DW_AT_name("frmHSize"), DW_AT_symbol_name("_frmHSize")
     201                            .dwattr DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     202                            .dwattr DW$14, DW_AT_accessibility(DW_ACCESS_public)
     203                    DW$15   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     204                            .dwattr DW$15, DW_AT_name("frmVSize"), DW_AT_symbol_name("_frmVSize")
     205                            .dwattr DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     206                            .dwattr DW$15, DW_AT_accessibility(DW_ACCESS_public)
     207                    DW$16   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     208                            .dwattr DW$16, DW_AT_name("imgHOffsetFld1"), DW_AT_symbol_name("_imgHOffsetFld1")
     209                            .dwattr DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     210                            .dwattr DW$16, DW_AT_accessibility(DW_ACCESS_public)
     211                    DW$17   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     212                            .dwattr DW$17, DW_AT_name("imgVOffsetFld1"), DW_AT_symbol_name("_imgVOffsetFld1")
     213                            .dwattr DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     214                            .dwattr DW$17, DW_AT_accessibility(DW_ACCESS_public)
     215                    DW$18   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     216                            .dwattr DW$18, DW_AT_name("imgHSizeFld1"), DW_AT_symbol_name("_imgHSizeFld1")
     217                            .dwattr DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     218                            .dwattr DW$18, DW_AT_accessibility(DW_ACCESS_public)
     219                    DW$19   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     220                            .dwattr DW$19, DW_AT_name("imgVSizeFld1"), DW_AT_symbol_name("_imgVSizeFld1")
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    5

     221                            .dwattr DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     222                            .dwattr DW$19, DW_AT_accessibility(DW_ACCESS_public)
     223                    DW$20   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     224                            .dwattr DW$20, DW_AT_name("imgHOffsetFld2"), DW_AT_symbol_name("_imgHOffsetFld2")
     225                            .dwattr DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     226                            .dwattr DW$20, DW_AT_accessibility(DW_ACCESS_public)
     227                    DW$21   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
     228                            .dwattr DW$21, DW_AT_name("imgVOffsetFld2"), DW_AT_symbol_name("_imgVOffsetFld2")
     229                            .dwattr DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     230                            .dwattr DW$21, DW_AT_accessibility(DW_ACCESS_public)
     231                    DW$22   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     232                            .dwattr DW$22, DW_AT_name("imgHSizeFld2"), DW_AT_symbol_name("_imgHSizeFld2")
     233                            .dwattr DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     234                            .dwattr DW$22, DW_AT_accessibility(DW_ACCESS_public)
     235                    DW$23   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     236                            .dwattr DW$23, DW_AT_name("imgVSizeFld2"), DW_AT_symbol_name("_imgVSizeFld2")
     237                            .dwattr DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     238                            .dwattr DW$23, DW_AT_accessibility(DW_ACCESS_public)
     239                    DW$24   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     240                            .dwattr DW$24, DW_AT_name("hBlnkStart"), DW_AT_symbol_name("_hBlnkStart")
     241                            .dwattr DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     242                            .dwattr DW$24, DW_AT_accessibility(DW_ACCESS_public)
     243                    DW$25   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     244                            .dwattr DW$25, DW_AT_name("hBlnkStop"), DW_AT_symbol_name("_hBlnkStop")
     245                            .dwattr DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     246                            .dwattr DW$25, DW_AT_accessibility(DW_ACCESS_public)
     247                    DW$26   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     248                            .dwattr DW$26, DW_AT_name("vBlnkXStartFld1"), DW_AT_symbol_name("_vBlnkXStartFld1")
     249                            .dwattr DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     250                            .dwattr DW$26, DW_AT_accessibility(DW_ACCESS_public)
     251                    DW$27   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     252                            .dwattr DW$27, DW_AT_name("vBlnkYStartFld1"), DW_AT_symbol_name("_vBlnkYStartFld1")
     253                            .dwattr DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     254                            .dwattr DW$27, DW_AT_accessibility(DW_ACCESS_public)
     255                    DW$28   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     256                            .dwattr DW$28, DW_AT_name("vBlnkXStopFld1"), DW_AT_symbol_name("_vBlnkXStopFld1")
     257                            .dwattr DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     258                            .dwattr DW$28, DW_AT_accessibility(DW_ACCESS_public)
     259                    DW$29   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     260                            .dwattr DW$29, DW_AT_name("vBlnkYStopFld1"), DW_AT_symbol_name("_vBlnkYStopFld1")
     261                            .dwattr DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     262                            .dwattr DW$29, DW_AT_accessibility(DW_ACCESS_public)
     263                    DW$30   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     264                            .dwattr DW$30, DW_AT_name("vBlnkXStartFld2"), DW_AT_symbol_name("_vBlnkXStartFld2")
     265                            .dwattr DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     266                            .dwattr DW$30, DW_AT_accessibility(DW_ACCESS_public)
     267                    DW$31   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     268                            .dwattr DW$31, DW_AT_name("vBlnkYStartFld2"), DW_AT_symbol_name("_vBlnkYStartFld2")
     269                            .dwattr DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     270                            .dwattr DW$31, DW_AT_accessibility(DW_ACCESS_public)
     271                    DW$32   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     272                            .dwattr DW$32, DW_AT_name("vBlnkXStopFld2"), DW_AT_symbol_name("_vBlnkXStopFld2")
     273                            .dwattr DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     274                            .dwattr DW$32, DW_AT_accessibility(DW_ACCESS_public)
     275                    DW$33   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    6

     276                            .dwattr DW$33, DW_AT_name("vBlnkYStopFld2"), DW_AT_symbol_name("_vBlnkYStopFld2")
     277                            .dwattr DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     278                            .dwattr DW$33, DW_AT_accessibility(DW_ACCESS_public)
     279                    DW$34   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     280                            .dwattr DW$34, DW_AT_name("xStartFld1"), DW_AT_symbol_name("_xStartFld1")
     281                            .dwattr DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     282                            .dwattr DW$34, DW_AT_accessibility(DW_ACCESS_public)
     283                    DW$35   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     284                            .dwattr DW$35, DW_AT_name("yStartFld1"), DW_AT_symbol_name("_yStartFld1")
     285                            .dwattr DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
     286                            .dwattr DW$35, DW_AT_accessibility(DW_ACCESS_public)
     287                    DW$36   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     288                            .dwattr DW$36, DW_AT_name("xStartFld2"), DW_AT_symbol_name("_xStartFld2")
     289                            .dwattr DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     290                            .dwattr DW$36, DW_AT_accessibility(DW_ACCESS_public)
     291                    DW$37   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     292                            .dwattr DW$37, DW_AT_name("yStartFld2"), DW_AT_symbol_name("_yStartFld2")
     293                            .dwattr DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
     294                            .dwattr DW$37, DW_AT_accessibility(DW_ACCESS_public)
     295                    DW$38   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     296                            .dwattr DW$38, DW_AT_name("hSyncStart"), DW_AT_symbol_name("_hSyncStart")
     297                            .dwattr DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     298                            .dwattr DW$38, DW_AT_accessibility(DW_ACCESS_public)
     299                    DW$39   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     300                            .dwattr DW$39, DW_AT_name("hSyncStop"), DW_AT_symbol_name("_hSyncStop")
     301                            .dwattr DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     302                            .dwattr DW$39, DW_AT_accessibility(DW_ACCESS_public)
     303                    DW$40   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     304                            .dwattr DW$40, DW_AT_name("vSyncXStartFld1"), DW_AT_symbol_name("_vSyncXStartFld1")
     305                            .dwattr DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     306                            .dwattr DW$40, DW_AT_accessibility(DW_ACCESS_public)
     307                    DW$41   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     308                            .dwattr DW$41, DW_AT_name("vSyncYStartFld1"), DW_AT_symbol_name("_vSyncYStartFld1")
     309                            .dwattr DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
     310                            .dwattr DW$41, DW_AT_accessibility(DW_ACCESS_public)
     311                    DW$42   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     312                            .dwattr DW$42, DW_AT_name("vSyncXStopFld1"), DW_AT_symbol_name("_vSyncXStopFld1")
     313                            .dwattr DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     314                            .dwattr DW$42, DW_AT_accessibility(DW_ACCESS_public)
     315                    DW$43   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     316                            .dwattr DW$43, DW_AT_name("vSyncYStopFld1"), DW_AT_symbol_name("_vSyncYStopFld1")
     317                            .dwattr DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
     318                            .dwattr DW$43, DW_AT_accessibility(DW_ACCESS_public)
     319                    DW$44   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     320                            .dwattr DW$44, DW_AT_name("vSyncXStartFld2"), DW_AT_symbol_name("_vSyncXStartFld2")
     321                            .dwattr DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     322                            .dwattr DW$44, DW_AT_accessibility(DW_ACCESS_public)
     323                    DW$45   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     324                            .dwattr DW$45, DW_AT_name("vSyncYStartFld2"), DW_AT_symbol_name("_vSyncYStartFld2")
     325                            .dwattr DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
     326                            .dwattr DW$45, DW_AT_accessibility(DW_ACCESS_public)
     327                    DW$46   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     328                            .dwattr DW$46, DW_AT_name("vSyncXStopFld2"), DW_AT_symbol_name("_vSyncXStopFld2")
     329                            .dwattr DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     330                            .dwattr DW$46, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    7

     331                    DW$47   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     332                            .dwattr DW$47, DW_AT_name("vSyncYStopFld2"), DW_AT_symbol_name("_vSyncYStopFld2")
     333                            .dwattr DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
     334                            .dwattr DW$47, DW_AT_accessibility(DW_ACCESS_public)
     335                    DW$48   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     336                            .dwattr DW$48, DW_AT_name("yClipLow"), DW_AT_symbol_name("_yClipLow")
     337                            .dwattr DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
     338                            .dwattr DW$48, DW_AT_accessibility(DW_ACCESS_public)
     339                    DW$49   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     340                            .dwattr DW$49, DW_AT_name("yClipHigh"), DW_AT_symbol_name("_yClipHigh")
     341                            .dwattr DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
     342                            .dwattr DW$49, DW_AT_accessibility(DW_ACCESS_public)
     343                    DW$50   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     344                            .dwattr DW$50, DW_AT_name("cClipLow"), DW_AT_symbol_name("_cClipLow")
     345                            .dwattr DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
     346                            .dwattr DW$50, DW_AT_accessibility(DW_ACCESS_public)
     347                    DW$51   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     348                            .dwattr DW$51, DW_AT_name("cClipHigh"), DW_AT_symbol_name("_cClipHigh")
     349                            .dwattr DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x6f]
     350                            .dwattr DW$51, DW_AT_accessibility(DW_ACCESS_public)
     351                    DW$52   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     352                            .dwattr DW$52, DW_AT_name("yDefVal"), DW_AT_symbol_name("_yDefVal")
     353                            .dwattr DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
     354                            .dwattr DW$52, DW_AT_accessibility(DW_ACCESS_public)
     355                    DW$53   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     356                            .dwattr DW$53, DW_AT_name("cbDefVal"), DW_AT_symbol_name("_cbDefVal")
     357                            .dwattr DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
     358                            .dwattr DW$53, DW_AT_accessibility(DW_ACCESS_public)
     359                    DW$54   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
     360                            .dwattr DW$54, DW_AT_name("crDefVal"), DW_AT_symbol_name("_crDefVal")
     361                            .dwattr DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     362                            .dwattr DW$54, DW_AT_accessibility(DW_ACCESS_public)
     363                    DW$55   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     364                            .dwattr DW$55, DW_AT_name("rgbX"), DW_AT_symbol_name("_rgbX")
     365                            .dwattr DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     366                            .dwattr DW$55, DW_AT_accessibility(DW_ACCESS_public)
     367                    DW$56   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     368                            .dwattr DW$56, DW_AT_name("incPix"), DW_AT_symbol_name("_incPix")
     369                            .dwattr DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     370                            .dwattr DW$56, DW_AT_accessibility(DW_ACCESS_public)
     371                    DW$57   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
     372                            .dwattr DW$57, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
     373                            .dwattr DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
     374                            .dwattr DW$57, DW_AT_accessibility(DW_ACCESS_public)
     375                    DW$58   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
     376                            .dwattr DW$58, DW_AT_name("buf_addr"), DW_AT_symbol_name("_buf_addr")
     377                            .dwattr DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
     378                            .dwattr DW$58, DW_AT_accessibility(DW_ACCESS_public)
     379                    DW$59   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     380                            .dwattr DW$59, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
     381                            .dwattr DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
     382                            .dwattr DW$59, DW_AT_accessibility(DW_ACCESS_public)
     383                    DW$60   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     384                            .dwattr DW$60, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
     385                            .dwattr DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    8

     386                            .dwattr DW$60, DW_AT_accessibility(DW_ACCESS_public)
     387                    DW$61   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
     388                            .dwattr DW$61, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
     389                            .dwattr DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
     390                            .dwattr DW$61, DW_AT_accessibility(DW_ACCESS_public)
     391                            .dwendtag DW$T$23
     392                    
     393                    
     394                    DW$T$43 .dwtag  DW_TAG_structure_type
     395                            .dwattr DW$T$43, DW_AT_name("VPORTDIS_PortParams")
     396                            .dwattr DW$T$43, DW_AT_byte_size(0x20)
     397                    DW$62   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
     398                            .dwattr DW$62, DW_AT_name("dualChanEnable"), DW_AT_symbol_name("_dualChanEnable")
     399                            .dwattr DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     400                            .dwattr DW$62, DW_AT_accessibility(DW_ACCESS_public)
     401                    DW$63   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
     402                            .dwattr DW$63, DW_AT_name("vclk1Polarity"), DW_AT_symbol_name("_vclk1Polarity")
     403                            .dwattr DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     404                            .dwattr DW$63, DW_AT_accessibility(DW_ACCESS_public)
     405                    DW$64   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     406                            .dwattr DW$64, DW_AT_name("vc1Polarity"), DW_AT_symbol_name("_vc1Polarity")
     407                            .dwattr DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     408                            .dwattr DW$64, DW_AT_accessibility(DW_ACCESS_public)
     409                    DW$65   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     410                            .dwattr DW$65, DW_AT_name("vc2Polarity"), DW_AT_symbol_name("_vc2Polarity")
     411                            .dwattr DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     412                            .dwattr DW$65, DW_AT_accessibility(DW_ACCESS_public)
     413                    DW$66   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$34)
     414                            .dwattr DW$66, DW_AT_name("vc3Polarity"), DW_AT_symbol_name("_vc3Polarity")
     415                            .dwattr DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     416                            .dwattr DW$66, DW_AT_accessibility(DW_ACCESS_public)
     417                    DW$67   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
     418                            .dwattr DW$67, DW_AT_name("edcTbl"), DW_AT_symbol_name("_edcTbl")
     419                            .dwattr DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     420                            .dwattr DW$67, DW_AT_accessibility(DW_ACCESS_public)
     421                    DW$68   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
     422                            .dwattr DW$68, DW_AT_name("pin_cfg"), DW_AT_symbol_name("_pin_cfg")
     423                            .dwattr DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     424                            .dwattr DW$68, DW_AT_accessibility(DW_ACCESS_public)
     425                            .dwendtag DW$T$43
     426                    
     427                    DW$T$3  .dwtag  DW_TAG_pointer_type
     428                            .dwattr DW$T$3, DW_AT_address_class(0x20)
     429                    DW$T$22 .dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
     430                            .dwattr DW$T$22, DW_AT_language(DW_LANG_C)
     431                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("Int16"), DW_AT_type(*DW$T$8)
     432                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
     433                    DW$T$20 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
     434                            .dwattr DW$T$20, DW_AT_language(DW_LANG_C)
     435                    DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$38)
     436                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     437                    DW$T$10 .dwtag  DW_TAG_base_type, DW_AT_name("int")
     438                            .dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
     439                            .dwattr DW$T$10, DW_AT_byte_size(0x04)
     440                    DW$T$19 .dwtag  DW_TAG_typedef, DW_AT_name("Int"), DW_AT_type(*DW$T$10)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE    9

     441                            .dwattr DW$T$19, DW_AT_language(DW_LANG_C)
     442                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     443                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
     444                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
     445                    DW$T$34 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     446                            .dwattr DW$T$34, DW_AT_language(DW_LANG_C)
     447                    
     448                    DW$T$42 .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$41)
     449                            .dwattr DW$T$42, DW_AT_language(DW_LANG_C)
     450                            .dwattr DW$T$42, DW_AT_byte_size(0x08)
     451                    DW$69   .dwtag  DW_TAG_subrange_type
     452                            .dwattr DW$69, DW_AT_upper_bound(0x01)
     453                            .dwendtag DW$T$42
     454                    
     455                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     456                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     457                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
     458                    DW$T$8  .dwtag  DW_TAG_base_type, DW_AT_name("short")
     459                            .dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
     460                            .dwattr DW$T$8, DW_AT_byte_size(0x02)
     461                    DW$T$38 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
     462                            .dwattr DW$T$38, DW_AT_language(DW_LANG_C)
     463                    DW$T$41 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
     464                            .dwattr DW$T$41, DW_AT_address_class(0x20)
     465                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$37)
     466                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
     467                    
     468                    DW$T$37 .dwtag  DW_TAG_structure_type
     469                            .dwattr DW$T$37, DW_AT_name("EDC_Fxns")
     470                            .dwattr DW$T$37, DW_AT_byte_size(0x0c)
     471                    DW$70   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
     472                            .dwattr DW$70, DW_AT_name("open"), DW_AT_symbol_name("_open")
     473                            .dwattr DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     474                            .dwattr DW$70, DW_AT_accessibility(DW_ACCESS_public)
     475                    DW$71   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
     476                            .dwattr DW$71, DW_AT_name("close"), DW_AT_symbol_name("_close")
     477                            .dwattr DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     478                            .dwattr DW$71, DW_AT_accessibility(DW_ACCESS_public)
     479                    DW$72   .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
     480                            .dwattr DW$72, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
     481                            .dwattr DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     482                            .dwattr DW$72, DW_AT_accessibility(DW_ACCESS_public)
     483                            .dwendtag DW$T$37
     484                    
     485                    DW$T$30 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$29)
     486                            .dwattr DW$T$30, DW_AT_address_class(0x20)
     487                    DW$T$33 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$32)
     488                            .dwattr DW$T$33, DW_AT_address_class(0x20)
     489                    DW$T$36 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$35)
     490                            .dwattr DW$T$36, DW_AT_address_class(0x20)
     491                    
     492                    DW$T$29 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
     493                            .dwattr DW$T$29, DW_AT_language(DW_LANG_C)
     494                    DW$73   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
     495                    DW$74   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
TMS320C6x COFF Assembler PC v5.1.0 Fri Jan 07 14:23:39 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2962                                PAGE   10

     496                            .dwendtag DW$T$29
     497                    
     498                    DW$T$28 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$19)
     499                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
     500                    
     501                    DW$T$32 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     502                            .dwattr DW$T$32, DW_AT_language(DW_LANG_C)
     503                    DW$75   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
     504                            .dwendtag DW$T$32
     505                    
     506                    
     507                    DW$T$35 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
     508                            .dwattr DW$T$35, DW_AT_language(DW_LANG_C)
     509                    DW$76   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$31)
     510                    DW$77   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
     511                    DW$78   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$28)
     512                            .dwendtag DW$T$35
     513                    
     514                    DW$T$27 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$26)
     515                            .dwattr DW$T$27, DW_AT_language(DW_LANG_C)
     516                    DW$T$24 .dwtag  DW_TAG_typedef, DW_AT_name("EDC_Handle"), DW_AT_type(*DW$T$3)
     517                            .dwattr DW$T$24, DW_AT_language(DW_LANG_C)
     518                    DW$T$31 .dwtag  DW_TAG_typedef, DW_AT_name("Ptr"), DW_AT_type(*DW$T$3)
     519                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
     520                    DW$T$26 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
     521                            .dwattr DW$T$26, DW_AT_address_class(0x20)
     522                    DW$T$25 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
     523                            .dwattr DW$T$25, DW_AT_encoding(DW_ATE_signed_char)
     524                            .dwattr DW$T$25, DW_AT_byte_size(0x01)
     525                    
     526                    
     527                    ;***************************************************************
     528                    ;* DWARF CIE ENTRIES                                           *
     529                    ;***************************************************************
     530                    
     531                    DW$CIE  .dwcie 1, 126
     532                            .dwcfa  0x0c, 31, 0
     533                            .dwcfa  0x07, 0
