TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Mon Oct 25 10:31:16 2010                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

     948                            .dwattr DW$T$113, DW_AT_language(DW_LANG_C)
     949                    DW$T$23 .dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
     950                            .dwattr DW$T$23, DW_AT_language(DW_LANG_C)
     951                    DW$T$98 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
     952                            .dwattr DW$T$98, DW_AT_address_class(0x20)
     953                    DW$T$85 .dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
     954                            .dwattr DW$T$85, DW_AT_language(DW_LANG_C)
     955                    DW$T$13 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned long")
     956                            .dwattr DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
     957                            .dwattr DW$T$13, DW_AT_byte_size(0x08)
     958                            .dwattr DW$T$13, DW_AT_bit_size(0x28)
     959                            .dwattr DW$T$13, DW_AT_bit_offset(0x18)
     960                    DW$T$39 .dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$38)
     961                            .dwattr DW$T$39, DW_AT_language(DW_LANG_C)
     962                    DW$T$104        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$103)
     963                            .dwattr DW$T$104, DW_AT_address_class(0x20)
     964                    DW$T$94 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_Handle"), DW_AT_type(*DW$T$93)
     965                            .dwattr DW$T$94, DW_AT_language(DW_LANG_C)
     966                    
     967                    DW$T$120        .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$94)
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   20

     968                            .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
     969                    DW$96   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$39)
     970                    DW$97   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
     971                    DW$98   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$97)
     972                    DW$99   .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
     973                    DW$100  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$119)
     974                            .dwendtag DW$T$120
     975                    
     976                    DW$T$122        .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Handle"), DW_AT_type(*DW$T$94)
     977                            .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
     978                    DW$T$119        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$118)
     979                            .dwattr DW$T$119, DW_AT_address_class(0x20)
     980                    DW$T$100        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$99)
     981                            .dwattr DW$T$100, DW_AT_address_class(0x20)
     982                    DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("BUF_Handle"), DW_AT_type(*DW$T$79)
     983                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
     984                    DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("BUF_Obj"), DW_AT_type(*DW$T$64)
     985                            .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
     986                    DW$T$124        .dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$66)
     987                            .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
     988                    DW$T$127        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$126)
     989                            .dwattr DW$T$127, DW_AT_address_class(0x20)
     990                    DW$T$84 .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$83)
     991                            .dwattr DW$T$84, DW_AT_language(DW_LANG_C)
     992                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
     993                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
     994                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
     995                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
     996                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
     997                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
     998                    DW$T$11 .dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
     999                            .dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1000                            .dwattr DW$T$11, DW_AT_byte_size(0x04)
    1001                    DW$T$38 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
    1002                            .dwattr DW$T$38, DW_AT_address_class(0x20)
    1003                    DW$T$103        .dwtag  DW_TAG_const_type
    1004                            .dwattr DW$T$103, DW_AT_type(*DW$T$37)
    1005                    DW$T$93 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$57)
    1006                            .dwattr DW$T$93, DW_AT_address_class(0x20)
    1007                    DW$T$118        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_Attrs"), DW_AT_type(*DW$T$58)
    1008                            .dwattr DW$T$118, DW_AT_language(DW_LANG_C)
    1009                    DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_AppCallback"), DW_AT_type(*DW$T$62)
    1010                            .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    1011                    
    1012                    DW$T$64 .dwtag  DW_TAG_structure_type
    1013                            .dwattr DW$T$64, DW_AT_name("BUF_Obj")
    1014                            .dwattr DW$T$64, DW_AT_byte_size(0x1c)
    1015                    DW$101  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1016                            .dwattr DW$101, DW_AT_name("startaddr"), DW_AT_symbol_name("_startaddr")
    1017                            .dwattr DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1018                            .dwattr DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1019                    DW$102  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1020                            .dwattr DW$102, DW_AT_name("size"), DW_AT_symbol_name("_size")
    1021                            .dwattr DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1022                            .dwattr DW$102, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   21

    1023                    DW$103  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$63)
    1024                            .dwattr DW$103, DW_AT_name("postalignsize"), DW_AT_symbol_name("_postalignsize")
    1025                            .dwattr DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1026                            .dwattr DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1027                    DW$104  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1028                            .dwattr DW$104, DW_AT_name("nextfree"), DW_AT_symbol_name("_nextfree")
    1029                            .dwattr DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1030                            .dwattr DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1031                    DW$105  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1032                            .dwattr DW$105, DW_AT_name("totalbuffers"), DW_AT_symbol_name("_totalbuffers")
    1033                            .dwattr DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1034                            .dwattr DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1035                    DW$106  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1036                            .dwattr DW$106, DW_AT_name("freebuffers"), DW_AT_symbol_name("_freebuffers")
    1037                            .dwattr DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1038                            .dwattr DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1039                    DW$107  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1040                            .dwattr DW$107, DW_AT_name("segid"), DW_AT_symbol_name("_segid")
    1041                            .dwattr DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1042                            .dwattr DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1043                            .dwendtag DW$T$64
    1044                    
    1045                    DW$T$79 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$64)
    1046                            .dwattr DW$T$79, DW_AT_address_class(0x20)
    1047                    
    1048                    DW$T$66 .dwtag  DW_TAG_structure_type
    1049                            .dwattr DW$T$66, DW_AT_byte_size(0x58)
    1050                    DW$108  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1051                            .dwattr DW$108, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
    1052                            .dwattr DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1053                            .dwattr DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1054                    DW$109  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1055                            .dwattr DW$109, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
    1056                            .dwattr DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1057                            .dwattr DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1058                    DW$110  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1059                            .dwattr DW$110, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
    1060                            .dwattr DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1061                            .dwattr DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1062                    DW$111  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1063                            .dwattr DW$111, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
    1064                            .dwattr DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1065                            .dwattr DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1066                    DW$112  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1067                            .dwattr DW$112, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
    1068                            .dwattr DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1069                            .dwattr DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1070                    DW$113  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1071                            .dwattr DW$113, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
    1072                            .dwattr DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1073                            .dwattr DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1074                    DW$114  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1075                            .dwattr DW$114, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
    1076                            .dwattr DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1077                            .dwattr DW$114, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   22

    1078                    DW$115  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1079                            .dwattr DW$115, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
    1080                            .dwattr DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1081                            .dwattr DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1082                    DW$116  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1083                            .dwattr DW$116, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
    1084                            .dwattr DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1085                            .dwattr DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1086                    DW$117  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1087                            .dwattr DW$117, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
    1088                            .dwattr DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1089                            .dwattr DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1090                    DW$118  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1091                            .dwattr DW$118, DW_AT_name("sse"), DW_AT_symbol_name("_sse")
    1092                            .dwattr DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1093                            .dwattr DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1094                    DW$119  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1095                            .dwattr DW$119, DW_AT_name("vcvblnkp"), DW_AT_symbol_name("_vcvblnkp")
    1096                            .dwattr DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1097                            .dwattr DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1098                    DW$120  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1099                            .dwattr DW$120, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
    1100                            .dwattr DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1101                            .dwattr DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1102                    DW$121  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1103                            .dwattr DW$121, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
    1104                            .dwattr DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1105                            .dwattr DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1106                    DW$122  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1107                            .dwattr DW$122, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
    1108                            .dwattr DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1109                            .dwattr DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1110                    DW$123  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1111                            .dwattr DW$123, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
    1112                            .dwattr DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1113                            .dwattr DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1114                    DW$124  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1115                            .dwattr DW$124, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
    1116                            .dwattr DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1117                            .dwattr DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1118                    DW$125  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1119                            .dwattr DW$125, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
    1120                            .dwattr DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1121                            .dwattr DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1122                    DW$126  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1123                            .dwattr DW$126, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
    1124                            .dwattr DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1125                            .dwattr DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1126                    DW$127  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1127                            .dwattr DW$127, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
    1128                            .dwattr DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1129                            .dwattr DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1130                    DW$128  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    1131                            .dwattr DW$128, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
    1132                            .dwattr DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   23

    1133                            .dwattr DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1134                    DW$129  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1135                            .dwattr DW$129, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
    1136                            .dwattr DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1137                            .dwattr DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1138                    DW$130  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1139                            .dwattr DW$130, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
    1140                            .dwattr DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1141                            .dwattr DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1142                    DW$131  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1143                            .dwattr DW$131, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
    1144                            .dwattr DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1145                            .dwattr DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1146                    DW$132  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1147                            .dwattr DW$132, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
    1148                            .dwattr DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1149                            .dwattr DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1150                    DW$133  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1151                            .dwattr DW$133, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
    1152                            .dwattr DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1153                            .dwattr DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1154                    DW$134  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1155                            .dwattr DW$134, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
    1156                            .dwattr DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1157                            .dwattr DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1158                            .dwendtag DW$T$66
    1159                    
    1160                    DW$T$126        .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Frame"), DW_AT_type(*DW$T$78)
    1161                            .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
    1162                    
    1163                    DW$T$83 .dwtag  DW_TAG_enumeration_type
    1164                            .dwattr DW$T$83, DW_AT_byte_size(0x04)
    1165                    DW$135  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
    1166                    DW$136  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
    1167                    DW$137  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
    1168                    DW$138  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
    1169                    DW$139  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
    1170                    DW$140  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
    1171                            .dwendtag DW$T$83
    1172                    
    1173                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
    1174                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    1175                    DW$T$63 .dwtag  DW_TAG_typedef, DW_AT_name("MEM_sizep"), DW_AT_type(*DW$T$11)
    1176                            .dwattr DW$T$63, DW_AT_language(DW_LANG_C)
    1177                    DW$T$37 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    1178                            .dwattr DW$T$37, DW_AT_encoding(DW_ATE_signed_char)
    1179                            .dwattr DW$T$37, DW_AT_byte_size(0x01)
    1180                    
    1181                    DW$T$57 .dwtag  DW_TAG_structure_type
    1182                            .dwattr DW$T$57, DW_AT_name("GIO_Obj")
    1183                            .dwattr DW$T$57, DW_AT_byte_size(0x3c)
    1184                    DW$141  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
    1185                            .dwattr DW$141, DW_AT_name("fxns"), DW_AT_symbol_name("_fxns")
    1186                            .dwattr DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1187                            .dwattr DW$141, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   24

    1188                    DW$142  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1189                            .dwattr DW$142, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
    1190                            .dwattr DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1191                            .dwattr DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1192                    DW$143  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1193                            .dwattr DW$143, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    1194                            .dwattr DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1195                            .dwattr DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1196                    DW$144  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$41)
    1197                            .dwattr DW$144, DW_AT_name("syncPacket"), DW_AT_symbol_name("_syncPacket")
    1198                            .dwattr DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1199                            .dwattr DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1200                    DW$145  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$56)
    1201                            .dwattr DW$145, DW_AT_name("freeList"), DW_AT_symbol_name("_freeList")
    1202                            .dwattr DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1203                            .dwattr DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1204                    DW$146  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1205                            .dwattr DW$146, DW_AT_name("syncObj"), DW_AT_symbol_name("_syncObj")
    1206                            .dwattr DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1207                            .dwattr DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1208                    DW$147  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1209                            .dwattr DW$147, DW_AT_name("mdChan"), DW_AT_symbol_name("_mdChan")
    1210                            .dwattr DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1211                            .dwattr DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1212                            .dwendtag DW$T$57
    1213                    
    1214                    
    1215                    DW$T$58 .dwtag  DW_TAG_structure_type
    1216                            .dwattr DW$T$58, DW_AT_name("GIO_Attrs")
    1217                            .dwattr DW$T$58, DW_AT_byte_size(0x08)
    1218                    DW$148  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1219                            .dwattr DW$148, DW_AT_name("nPackets"), DW_AT_symbol_name("_nPackets")
    1220                            .dwattr DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                            .dwattr DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1222                    DW$149  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1223                            .dwattr DW$149, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    1224                            .dwattr DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1225                            .dwattr DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1226                            .dwendtag DW$T$58
    1227                    
    1228                    
    1229                    DW$T$62 .dwtag  DW_TAG_structure_type
    1230                            .dwattr DW$T$62, DW_AT_name("GIO_AppCallback")
    1231                            .dwattr DW$T$62, DW_AT_byte_size(0x08)
    1232                    DW$150  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$61)
    1233                            .dwattr DW$150, DW_AT_name("fxn"), DW_AT_symbol_name("_fxn")
    1234                            .dwattr DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                            .dwattr DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1236                    DW$151  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1237                            .dwattr DW$151, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
    1238                            .dwattr DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1239                            .dwattr DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1240                            .dwendtag DW$T$62
    1241                    
    1242                    
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   25

    1243                    DW$T$78 .dwtag  DW_TAG_structure_type
    1244                            .dwattr DW$T$78, DW_AT_name("FVID_Frame")
    1245                            .dwattr DW$T$78, DW_AT_byte_size(0x20)
    1246                    DW$152  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1247                            .dwattr DW$152, DW_AT_name("queElement"), DW_AT_symbol_name("_queElement")
    1248                            .dwattr DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                            .dwattr DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1250                    DW$153  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
    1251                            .dwattr DW$153, DW_AT_name("frame"), DW_AT_symbol_name("_frame")
    1252                            .dwattr DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1253                            .dwattr DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1254                            .dwendtag DW$T$78
    1255                    
    1256                    DW$T$61 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_TappCallback"), DW_AT_type(*DW$T$60)
    1257                            .dwattr DW$T$61, DW_AT_language(DW_LANG_C)
    1258                    DW$T$21 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$20)
    1259                            .dwattr DW$T$21, DW_AT_language(DW_LANG_C)
    1260                    DW$T$56 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$20)
    1261                            .dwattr DW$T$56, DW_AT_language(DW_LANG_C)
    1262                    DW$T$41 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$40)
    1263                            .dwattr DW$T$41, DW_AT_language(DW_LANG_C)
    1264                    DW$T$55 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$54)
    1265                            .dwattr DW$T$55, DW_AT_address_class(0x20)
    1266                    
    1267                    DW$T$77 .dwtag  DW_TAG_union_type
    1268                            .dwattr DW$T$77, DW_AT_byte_size(0x18)
    1269                    DW$154  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$73)
    1270                            .dwattr DW$154, DW_AT_name("iFrm"), DW_AT_symbol_name("_iFrm")
    1271                            .dwattr DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272                            .dwattr DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1273                    DW$155  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    1274                            .dwattr DW$155, DW_AT_name("pFrm"), DW_AT_symbol_name("_pFrm")
    1275                            .dwattr DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                            .dwattr DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1277                    DW$156  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
    1278                            .dwattr DW$156, DW_AT_name("riFrm"), DW_AT_symbol_name("_riFrm")
    1279                            .dwattr DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1280                            .dwattr DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1281                    DW$157  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    1282                            .dwattr DW$157, DW_AT_name("rpFrm"), DW_AT_symbol_name("_rpFrm")
    1283                            .dwattr DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                            .dwattr DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1285                            .dwendtag DW$T$77
    1286                    
    1287                    DW$T$60 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$59)
    1288                            .dwattr DW$T$60, DW_AT_address_class(0x20)
    1289                    
    1290                    DW$T$20 .dwtag  DW_TAG_structure_type
    1291                            .dwattr DW$T$20, DW_AT_name("QUE_Elem")
    1292                            .dwattr DW$T$20, DW_AT_byte_size(0x08)
    1293                    DW$158  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    1294                            .dwattr DW$158, DW_AT_name("next"), DW_AT_symbol_name("_next")
    1295                            .dwattr DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1296                            .dwattr DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1297                    DW$159  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   26

    1298                            .dwattr DW$159, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
    1299                            .dwattr DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1300                            .dwattr DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1301                            .dwendtag DW$T$20
    1302                    
    1303                    DW$T$19 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    1304                            .dwattr DW$T$19, DW_AT_address_class(0x20)
    1305                    DW$T$40 .dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$26)
    1306                            .dwattr DW$T$40, DW_AT_language(DW_LANG_C)
    1307                    DW$T$54 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$53)
    1308                            .dwattr DW$T$54, DW_AT_language(DW_LANG_C)
    1309                    DW$T$73 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_IFrame"), DW_AT_type(*DW$T$69)
    1310                            .dwattr DW$T$73, DW_AT_language(DW_LANG_C)
    1311                    DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_PFrame"), DW_AT_type(*DW$T$70)
    1312                            .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    1313                    DW$T$75 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawIFrame"), DW_AT_type(*DW$T$71)
    1314                            .dwattr DW$T$75, DW_AT_language(DW_LANG_C)
    1315                    DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawPFrame"), DW_AT_type(*DW$T$72)
    1316                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    1317                    
    1318                    DW$T$59 .dwtag  DW_TAG_subroutine_type
    1319                            .dwattr DW$T$59, DW_AT_language(DW_LANG_C)
    1320                    DW$160  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1321                    DW$161  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    1322                    DW$162  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1323                    DW$163  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$23)
    1324                            .dwendtag DW$T$59
    1325                    
    1326                    
    1327                    DW$T$26 .dwtag  DW_TAG_structure_type
    1328                            .dwattr DW$T$26, DW_AT_name("DEV_Frame")
    1329                            .dwattr DW$T$26, DW_AT_byte_size(0x20)
    1330                    DW$164  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    1331                            .dwattr DW$164, DW_AT_name("link"), DW_AT_symbol_name("_link")
    1332                            .dwattr DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1333                            .dwattr DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1334                    DW$165  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$22)
    1335                            .dwattr DW$165, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
    1336                            .dwattr DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1337                            .dwattr DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1338                    DW$166  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1339                            .dwattr DW$166, DW_AT_name("size"), DW_AT_symbol_name("_size")
    1340                            .dwattr DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1341                            .dwattr DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1342                    DW$167  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1343                            .dwattr DW$167, DW_AT_name("misc"), DW_AT_symbol_name("_misc")
    1344                            .dwattr DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1345                            .dwattr DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1346                    DW$168  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    1347                            .dwattr DW$168, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
    1348                            .dwattr DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1349                            .dwattr DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1350                    DW$169  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    1351                            .dwattr DW$169, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
    1352                            .dwattr DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   27

    1353                            .dwattr DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1354                    DW$170  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
    1355                            .dwattr DW$170, DW_AT_name("status"), DW_AT_symbol_name("_status")
    1356                            .dwattr DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1357                            .dwattr DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1358                            .dwendtag DW$T$26
    1359                    
    1360                    
    1361                    DW$T$53 .dwtag  DW_TAG_structure_type
    1362                            .dwattr DW$T$53, DW_AT_name("IOM_Fxns")
    1363                            .dwattr DW$T$53, DW_AT_byte_size(0x18)
    1364                    DW$171  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
    1365                            .dwattr DW$171, DW_AT_name("mdBindDev"), DW_AT_symbol_name("_mdBindDev")
    1366                            .dwattr DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1367                            .dwattr DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1368                    DW$172  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$33)
    1369                            .dwattr DW$172, DW_AT_name("mdUnBindDev"), DW_AT_symbol_name("_mdUnBindDev")
    1370                            .dwattr DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1371                            .dwattr DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1372                    DW$173  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
    1373                            .dwattr DW$173, DW_AT_name("mdControlChan"), DW_AT_symbol_name("_mdControlChan")
    1374                            .dwattr DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1375                            .dwattr DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1376                    DW$174  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
    1377                            .dwattr DW$174, DW_AT_name("mdCreateChan"), DW_AT_symbol_name("_mdCreateChan")
    1378                            .dwattr DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1379                            .dwattr DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1380                    DW$175  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$49)
    1381                            .dwattr DW$175, DW_AT_name("mdDeleteChan"), DW_AT_symbol_name("_mdDeleteChan")
    1382                            .dwattr DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1383                            .dwattr DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1384                    DW$176  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$52)
    1385                            .dwattr DW$176, DW_AT_name("mdSubmitChan"), DW_AT_symbol_name("_mdSubmitChan")
    1386                            .dwattr DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1387                            .dwattr DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1388                            .dwendtag DW$T$53
    1389                    
    1390                    
    1391                    DW$T$69 .dwtag  DW_TAG_structure_type
    1392                            .dwattr DW$T$69, DW_AT_name("FVID_IFrame")
    1393                            .dwattr DW$T$69, DW_AT_byte_size(0x18)
    1394                    DW$177  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1395                            .dwattr DW$177, DW_AT_name("y1"), DW_AT_symbol_name("_y1")
    1396                            .dwattr DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1397                            .dwattr DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1398                    DW$178  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1399                            .dwattr DW$178, DW_AT_name("cb1"), DW_AT_symbol_name("_cb1")
    1400                            .dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1401                            .dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1402                    DW$179  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1403                            .dwattr DW$179, DW_AT_name("cr1"), DW_AT_symbol_name("_cr1")
    1404                            .dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1405                            .dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1406                    DW$180  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1407                            .dwattr DW$180, DW_AT_name("y2"), DW_AT_symbol_name("_y2")
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   28

    1408                            .dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1409                            .dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1410                    DW$181  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1411                            .dwattr DW$181, DW_AT_name("cb2"), DW_AT_symbol_name("_cb2")
    1412                            .dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1413                            .dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1414                    DW$182  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1415                            .dwattr DW$182, DW_AT_name("cr2"), DW_AT_symbol_name("_cr2")
    1416                            .dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1417                            .dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1418                            .dwendtag DW$T$69
    1419                    
    1420                    
    1421                    DW$T$70 .dwtag  DW_TAG_structure_type
    1422                            .dwattr DW$T$70, DW_AT_name("FVID_PFrame")
    1423                            .dwattr DW$T$70, DW_AT_byte_size(0x0c)
    1424                    DW$183  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1425                            .dwattr DW$183, DW_AT_name("y"), DW_AT_symbol_name("_y")
    1426                            .dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                            .dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1428                    DW$184  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1429                            .dwattr DW$184, DW_AT_name("cb"), DW_AT_symbol_name("_cb")
    1430                            .dwattr DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1431                            .dwattr DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1432                    DW$185  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1433                            .dwattr DW$185, DW_AT_name("cr"), DW_AT_symbol_name("_cr")
    1434                            .dwattr DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1435                            .dwattr DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1436                            .dwendtag DW$T$70
    1437                    
    1438                    
    1439                    DW$T$71 .dwtag  DW_TAG_structure_type
    1440                            .dwattr DW$T$71, DW_AT_name("FVID_RawIFrame")
    1441                            .dwattr DW$T$71, DW_AT_byte_size(0x08)
    1442                    DW$186  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1443                            .dwattr DW$186, DW_AT_name("buf1"), DW_AT_symbol_name("_buf1")
    1444                            .dwattr DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                            .dwattr DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1446                    DW$187  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1447                            .dwattr DW$187, DW_AT_name("buf2"), DW_AT_symbol_name("_buf2")
    1448                            .dwattr DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1449                            .dwattr DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1450                            .dwendtag DW$T$71
    1451                    
    1452                    
    1453                    DW$T$72 .dwtag  DW_TAG_structure_type
    1454                            .dwattr DW$T$72, DW_AT_name("FVID_RawPFrame")
    1455                            .dwattr DW$T$72, DW_AT_byte_size(0x04)
    1456                    DW$188  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    1457                            .dwattr DW$188, DW_AT_name("buf"), DW_AT_symbol_name("_buf")
    1458                            .dwattr DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                            .dwattr DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1460                            .dwendtag DW$T$72
    1461                    
    1462                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$24)
TMS320C6x COFF Assembler PC v5.1.0 Mon Oct 25 10:31:17 2010

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI9522                                PAGE   29

    1463                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    1464                    DW$T$30 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdBindDev"), DW_AT_type(*DW$T$29)
    1465                            .dwattr DW$T$30, DW_AT_language(DW_LANG_C)
    1466                    DW$T$33 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdUnBindDev"), DW_AT_type(*DW$T$32)
    1467                            .dwattr DW$T$33, DW_AT_language(DW_LANG_C)
    1468                    DW$T$49 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdDeleteChan"), DW_AT_type(*DW$T$32)
    1469                            .dwattr DW$T$49, DW_AT_language(DW_LANG_C)
    1470                    DW$T$36 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdControlChan"), DW_AT_type(*DW$T$35)
    1471                            .dwattr DW$T$36, DW_AT_language(DW_LANG_C)
    1472                    DW$T$48 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdCreateChan"), DW_AT_type(*DW$T$47)
    1473                            .dwattr DW$T$48, DW_AT_language(DW_LANG_C)
    1474                    DW$T$52 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdSubmitChan"), DW_AT_type(*DW$T$51)
    1475                            .dwattr DW$T$52, DW_AT_language(DW_LANG_C)
    1476                    DW$T$68 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$67)
    1477                            .dwattr DW$T$68, DW_AT_address_class(0x20)
    1478                    DW$T$29 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
    1479                            .dwattr DW$T$29, DW_AT_address_class(0x20)
    1480                    DW$T$32 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$31)
    1481                            .dwattr DW$T$32, DW_AT_address_class(0x20)
    1482                    DW$T$35 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
    1483                            .dwattr DW$T$35, DW_AT_address_class(0x20)
    1484                    DW$T$47 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$46)
    1485                            .dwattr DW$T$47, DW_AT_address_class(0x20)
    1486                    DW$T$51 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$50)
    1487                            .dwattr DW$T$51, DW_AT_address_class(0x20)
    1488                    DW$T$67 .dwtag  DW_TAG_typedef, DW_AT_name("Char"), DW_AT_type(*DW$T$37)
    1489                            .dwattr DW$T$67, DW_AT_language(DW_LANG_C)
    1490                    
    1491                    DW$T$28 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
    1492                            .dwattr DW$T$28, DW_AT_language(DW_LANG_C)
    1493                    DW$189  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
    1494                    DW$190  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
    1495                    DW$191  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1496                            .dwendtag DW$T$28
    1497                    
    1498                    
    1499                    DW$T$31 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
    1500                            .dwattr DW$T$31, DW_AT_language(DW_LANG_C)
    1501                    DW$192  .dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$22)
    1502                            .dwendtag DW$T$31
    1503                    
    1504                    
    1505                    DW$T$34 .dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$24)
