TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
       3                    ;* Date/Time created: Fri Mar 25 16:51:06 2011                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_ve
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C64xx                                          *
      11                    ;*   Optimization      : Disabled                                             *
      12                    ;*   Optimizing for    : Compile time, Ease of Development                    *

    5917                            .dwendtag DW$T$238
    5918                    
    5919                    DW$T$240        .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Handle"), DW_AT_type(*DW$T$202)
    5920                            .dwattr DW$T$240, DW_AT_language(DW_LANG_C)
    5921                    DW$T$236        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_Attrs"), DW_AT_type(*DW$T$62)
    5922                            .dwattr DW$T$236, DW_AT_language(DW_LANG_C)
    5923                    DW$T$237        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$236)
    5924                            .dwattr DW$T$237, DW_AT_address_class(0x20)
    5925                    DW$T$208        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$207)
    5926                            .dwattr DW$T$208, DW_AT_address_class(0x20)
    5927                    DW$T$180        .dwtag  DW_TAG_typedef, DW_AT_name("I2C_Handle"), DW_AT_type(*DW$T$179)
    5928                            .dwattr DW$T$180, DW_AT_language(DW_LANG_C)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  113

    5929                    DW$T$153        .dwtag  DW_TAG_typedef, DW_AT_name("BUF_Handle"), DW_AT_type(*DW$T$152)
    5930                            .dwattr DW$T$153, DW_AT_language(DW_LANG_C)
    5931                    DW$T$241        .dwtag  DW_TAG_typedef, DW_AT_name("BUF_Obj"), DW_AT_type(*DW$T$69)
    5932                            .dwattr DW$T$241, DW_AT_language(DW_LANG_C)
    5933                    DW$T$74 .dwtag  DW_TAG_typedef, DW_AT_name("IMAGE_MSG"), DW_AT_type(*DW$T$73)
    5934                            .dwattr DW$T$74, DW_AT_language(DW_LANG_C)
    5935                    DW$T$76 .dwtag  DW_TAG_typedef, DW_AT_name("RESULT_MSG"), DW_AT_type(*DW$T$75)
    5936                            .dwattr DW$T$76, DW_AT_language(DW_LANG_C)
    5937                    DW$T$186        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_procimg_t"), DW_AT_type(*DW$T$79)
    5938                            .dwattr DW$T$186, DW_AT_language(DW_LANG_C)
    5939                    DW$T$187        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$186)
    5940                            .dwattr DW$T$187, DW_AT_address_class(0x20)
    5941                    DW$T$242        .dwtag  DW_TAG_typedef, DW_AT_name("VPORTCAP_Params"), DW_AT_type(*DW$T$81)
    5942                            .dwattr DW$T$242, DW_AT_language(DW_LANG_C)
    5943                    DW$T$245        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$244)
    5944                            .dwattr DW$T$245, DW_AT_address_class(0x20)
    5945                    DW$T$108        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$97)
    5946                            .dwattr DW$T$108, DW_AT_address_class(0x20)
    5947                    DW$T$248        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$247)
    5948                            .dwattr DW$T$248, DW_AT_address_class(0x20)
    5949                    DW$T$249        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_reg_t"), DW_AT_type(*DW$T$144)
    5950                            .dwattr DW$T$249, DW_AT_language(DW_LANG_C)
    5951                    DW$T$252        .dwtag  DW_TAG_typedef, DW_AT_name("MATCH_MSG"), DW_AT_type(*DW$T$251)
    5952                            .dwattr DW$T$252, DW_AT_language(DW_LANG_C)
    5953                    DW$T$254        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$253)
    5954                            .dwattr DW$T$254, DW_AT_address_class(0x20)
    5955                    DW$T$157        .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$156)
    5956                            .dwattr DW$T$157, DW_AT_language(DW_LANG_C)
    5957                    DW$T$161        .dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Wait"), DW_AT_type(*DW$T$160)
    5958                            .dwattr DW$T$161, DW_AT_language(DW_LANG_C)
    5959                    DW$T$147        .dwtag  DW_TAG_const_type
    5960                    DW$T$6  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
    5961                            .dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5962                            .dwattr DW$T$6, DW_AT_byte_size(0x01)
    5963                    DW$T$9  .dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
    5964                            .dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    5965                            .dwattr DW$T$9, DW_AT_byte_size(0x02)
    5966                    DW$T$80 .dwtag  DW_TAG_typedef, DW_AT_name("Uint16"), DW_AT_type(*DW$T$9)
    5967                            .dwattr DW$T$80, DW_AT_language(DW_LANG_C)
    5968                    DW$T$164        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
    5969                            .dwattr DW$T$164, DW_AT_address_class(0x20)
    5970                    DW$T$41 .dwtag  DW_TAG_base_type, DW_AT_name("signed char")
    5971                            .dwattr DW$T$41, DW_AT_encoding(DW_ATE_signed_char)
    5972                            .dwattr DW$T$41, DW_AT_byte_size(0x01)
    5973                    DW$T$211        .dwtag  DW_TAG_const_type
    5974                            .dwattr DW$T$211, DW_AT_type(*DW$T$41)
    5975                    DW$T$201        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
    5976                            .dwattr DW$T$201, DW_AT_address_class(0x20)
    5977                    
    5978                    DW$T$62 .dwtag  DW_TAG_structure_type
    5979                            .dwattr DW$T$62, DW_AT_name("GIO_Attrs")
    5980                            .dwattr DW$T$62, DW_AT_byte_size(0x08)
    5981                    DW$364  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    5982                            .dwattr DW$364, DW_AT_name("nPackets"), DW_AT_symbol_name("_nPackets")
    5983                            .dwattr DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  114

    5984                            .dwattr DW$364, DW_AT_accessibility(DW_ACCESS_public)
    5985                    DW$365  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    5986                            .dwattr DW$365, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    5987                            .dwattr DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    5988                            .dwattr DW$365, DW_AT_accessibility(DW_ACCESS_public)
    5989                            .dwendtag DW$T$62
    5990                    
    5991                    DW$T$207        .dwtag  DW_TAG_typedef, DW_AT_name("GIO_AppCallback"), DW_AT_type(*DW$T$66)
    5992                            .dwattr DW$T$207, DW_AT_language(DW_LANG_C)
    5993                    DW$T$179        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$67)
    5994                            .dwattr DW$T$179, DW_AT_address_class(0x20)
    5995                    
    5996                    DW$T$69 .dwtag  DW_TAG_structure_type
    5997                            .dwattr DW$T$69, DW_AT_name("BUF_Obj")
    5998                            .dwattr DW$T$69, DW_AT_byte_size(0x1c)
    5999                    DW$366  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6000                            .dwattr DW$366, DW_AT_name("startaddr"), DW_AT_symbol_name("_startaddr")
    6001                            .dwattr DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6002                            .dwattr DW$366, DW_AT_accessibility(DW_ACCESS_public)
    6003                    DW$367  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    6004                            .dwattr DW$367, DW_AT_name("size"), DW_AT_symbol_name("_size")
    6005                            .dwattr DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6006                            .dwattr DW$367, DW_AT_accessibility(DW_ACCESS_public)
    6007                    DW$368  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
    6008                            .dwattr DW$368, DW_AT_name("postalignsize"), DW_AT_symbol_name("_postalignsize")
    6009                            .dwattr DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6010                            .dwattr DW$368, DW_AT_accessibility(DW_ACCESS_public)
    6011                    DW$369  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6012                            .dwattr DW$369, DW_AT_name("nextfree"), DW_AT_symbol_name("_nextfree")
    6013                            .dwattr DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6014                            .dwattr DW$369, DW_AT_accessibility(DW_ACCESS_public)
    6015                    DW$370  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6016                            .dwattr DW$370, DW_AT_name("totalbuffers"), DW_AT_symbol_name("_totalbuffers")
    6017                            .dwattr DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6018                            .dwattr DW$370, DW_AT_accessibility(DW_ACCESS_public)
    6019                    DW$371  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6020                            .dwattr DW$371, DW_AT_name("freebuffers"), DW_AT_symbol_name("_freebuffers")
    6021                            .dwattr DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6022                            .dwattr DW$371, DW_AT_accessibility(DW_ACCESS_public)
    6023                    DW$372  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6024                            .dwattr DW$372, DW_AT_name("segid"), DW_AT_symbol_name("_segid")
    6025                            .dwattr DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6026                            .dwattr DW$372, DW_AT_accessibility(DW_ACCESS_public)
    6027                            .dwendtag DW$T$69
    6028                    
    6029                    DW$T$152        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$69)
    6030                            .dwattr DW$T$152, DW_AT_address_class(0x20)
    6031                    DW$T$73 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$71)
    6032                            .dwattr DW$T$73, DW_AT_address_class(0x20)
    6033                    DW$T$75 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$72)
    6034                            .dwattr DW$T$75, DW_AT_address_class(0x20)
    6035                    
    6036                    DW$T$79 .dwtag  DW_TAG_structure_type
    6037                            .dwattr DW$T$79, DW_AT_name("dsp_procimg_t")
    6038                            .dwattr DW$T$79, DW_AT_byte_size(0x1c)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  115

    6039                    DW$373  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$74)
    6040                            .dwattr DW$373, DW_AT_name("img_msg"), DW_AT_symbol_name("_img_msg")
    6041                            .dwattr DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6042                            .dwattr DW$373, DW_AT_accessibility(DW_ACCESS_public)
    6043                    DW$374  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$76)
    6044                            .dwattr DW$374, DW_AT_name("result_msg"), DW_AT_symbol_name("_result_msg")
    6045                            .dwattr DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6046                            .dwattr DW$374, DW_AT_accessibility(DW_ACCESS_public)
    6047                    DW$375  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6048                            .dwattr DW$375, DW_AT_name("last_flag"), DW_AT_symbol_name("_last_flag")
    6049                            .dwattr DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6050                            .dwattr DW$375, DW_AT_accessibility(DW_ACCESS_public)
    6051                    DW$376  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6052                            .dwattr DW$376, DW_AT_name("img_grab_count"), DW_AT_symbol_name("_img_grab_count")
    6053                            .dwattr DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6054                            .dwattr DW$376, DW_AT_accessibility(DW_ACCESS_public)
    6055                    DW$377  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$78)
    6056                            .dwattr DW$377, DW_AT_name("begin_quality"), DW_AT_symbol_name("_begin_quality")
    6057                            .dwattr DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6058                            .dwattr DW$377, DW_AT_accessibility(DW_ACCESS_public)
    6059                    DW$378  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6060                            .dwattr DW$378, DW_AT_name("need_eye"), DW_AT_symbol_name("_need_eye")
    6061                            .dwattr DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6062                            .dwattr DW$378, DW_AT_accessibility(DW_ACCESS_public)
    6063                    DW$379  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6064                            .dwattr DW$379, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    6065                            .dwattr DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6066                            .dwattr DW$379, DW_AT_accessibility(DW_ACCESS_public)
    6067                            .dwendtag DW$T$79
    6068                    
    6069                    
    6070                    DW$T$81 .dwtag  DW_TAG_structure_type
    6071                            .dwattr DW$T$81, DW_AT_byte_size(0x58)
    6072                    DW$380  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6073                            .dwattr DW$380, DW_AT_name("cmode"), DW_AT_symbol_name("_cmode")
    6074                            .dwattr DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6075                            .dwattr DW$380, DW_AT_accessibility(DW_ACCESS_public)
    6076                    DW$381  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6077                            .dwattr DW$381, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
    6078                            .dwattr DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6079                            .dwattr DW$381, DW_AT_accessibility(DW_ACCESS_public)
    6080                    DW$382  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6081                            .dwattr DW$382, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
    6082                            .dwattr DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6083                            .dwattr DW$382, DW_AT_accessibility(DW_ACCESS_public)
    6084                    DW$383  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6085                            .dwattr DW$383, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
    6086                            .dwattr DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6087                            .dwattr DW$383, DW_AT_accessibility(DW_ACCESS_public)
    6088                    DW$384  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6089                            .dwattr DW$384, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
    6090                            .dwattr DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6091                            .dwattr DW$384, DW_AT_accessibility(DW_ACCESS_public)
    6092                    DW$385  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6093                            .dwattr DW$385, DW_AT_name("hCtRst"), DW_AT_symbol_name("_hCtRst")
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  116

    6094                            .dwattr DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6095                            .dwattr DW$385, DW_AT_accessibility(DW_ACCESS_public)
    6096                    DW$386  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6097                            .dwattr DW$386, DW_AT_name("vCtRst"), DW_AT_symbol_name("_vCtRst")
    6098                            .dwattr DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6099                            .dwattr DW$386, DW_AT_accessibility(DW_ACCESS_public)
    6100                    DW$387  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6101                            .dwattr DW$387, DW_AT_name("fldDect"), DW_AT_symbol_name("_fldDect")
    6102                            .dwattr DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6103                            .dwattr DW$387, DW_AT_accessibility(DW_ACCESS_public)
    6104                    DW$388  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6105                            .dwattr DW$388, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
    6106                            .dwattr DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6107                            .dwattr DW$388, DW_AT_accessibility(DW_ACCESS_public)
    6108                    DW$389  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6109                            .dwattr DW$389, DW_AT_name("fldInv"), DW_AT_symbol_name("_fldInv")
    6110                            .dwattr DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6111                            .dwattr DW$389, DW_AT_accessibility(DW_ACCESS_public)
    6112                    DW$390  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6113                            .dwattr DW$390, DW_AT_name("sse"), DW_AT_symbol_name("_sse")
    6114                            .dwattr DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6115                            .dwattr DW$390, DW_AT_accessibility(DW_ACCESS_public)
    6116                    DW$391  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6117                            .dwattr DW$391, DW_AT_name("vcvblnkp"), DW_AT_symbol_name("_vcvblnkp")
    6118                            .dwattr DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    6119                            .dwattr DW$391, DW_AT_accessibility(DW_ACCESS_public)
    6120                    DW$392  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6121                            .dwattr DW$392, DW_AT_name("fldXStrt1"), DW_AT_symbol_name("_fldXStrt1")
    6122                            .dwattr DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6123                            .dwattr DW$392, DW_AT_accessibility(DW_ACCESS_public)
    6124                    DW$393  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6125                            .dwattr DW$393, DW_AT_name("fldYStrt1"), DW_AT_symbol_name("_fldYStrt1")
    6126                            .dwattr DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    6127                            .dwattr DW$393, DW_AT_accessibility(DW_ACCESS_public)
    6128                    DW$394  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6129                            .dwattr DW$394, DW_AT_name("fldXStrt2"), DW_AT_symbol_name("_fldXStrt2")
    6130                            .dwattr DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6131                            .dwattr DW$394, DW_AT_accessibility(DW_ACCESS_public)
    6132                    DW$395  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6133                            .dwattr DW$395, DW_AT_name("fldYStrt2"), DW_AT_symbol_name("_fldYStrt2")
    6134                            .dwattr DW$395, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    6135                            .dwattr DW$395, DW_AT_accessibility(DW_ACCESS_public)
    6136                    DW$396  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6137                            .dwattr DW$396, DW_AT_name("fldXStop1"), DW_AT_symbol_name("_fldXStop1")
    6138                            .dwattr DW$396, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6139                            .dwattr DW$396, DW_AT_accessibility(DW_ACCESS_public)
    6140                    DW$397  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6141                            .dwattr DW$397, DW_AT_name("fldYStop1"), DW_AT_symbol_name("_fldYStop1")
    6142                            .dwattr DW$397, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    6143                            .dwattr DW$397, DW_AT_accessibility(DW_ACCESS_public)
    6144                    DW$398  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6145                            .dwattr DW$398, DW_AT_name("fldXStop2"), DW_AT_symbol_name("_fldXStop2")
    6146                            .dwattr DW$398, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6147                            .dwattr DW$398, DW_AT_accessibility(DW_ACCESS_public)
    6148                    DW$399  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  117

    6149                            .dwattr DW$399, DW_AT_name("fldYStop2"), DW_AT_symbol_name("_fldYStop2")
    6150                            .dwattr DW$399, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    6151                            .dwattr DW$399, DW_AT_accessibility(DW_ACCESS_public)
    6152                    DW$400  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$80)
    6153                            .dwattr DW$400, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
    6154                            .dwattr DW$400, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6155                            .dwattr DW$400, DW_AT_accessibility(DW_ACCESS_public)
    6156                    DW$401  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6157                            .dwattr DW$401, DW_AT_name("numFrmBufs"), DW_AT_symbol_name("_numFrmBufs")
    6158                            .dwattr DW$401, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    6159                            .dwattr DW$401, DW_AT_accessibility(DW_ACCESS_public)
    6160                    DW$402  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6161                            .dwattr DW$402, DW_AT_name("alignment"), DW_AT_symbol_name("_alignment")
    6162                            .dwattr DW$402, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    6163                            .dwattr DW$402, DW_AT_accessibility(DW_ACCESS_public)
    6164                    DW$403  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6165                            .dwattr DW$403, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
    6166                            .dwattr DW$403, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    6167                            .dwattr DW$403, DW_AT_accessibility(DW_ACCESS_public)
    6168                    DW$404  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6169                            .dwattr DW$404, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
    6170                            .dwattr DW$404, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    6171                            .dwattr DW$404, DW_AT_accessibility(DW_ACCESS_public)
    6172                    DW$405  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6173                            .dwattr DW$405, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
    6174                            .dwattr DW$405, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    6175                            .dwattr DW$405, DW_AT_accessibility(DW_ACCESS_public)
    6176                    DW$406  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$28)
    6177                            .dwattr DW$406, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
    6178                            .dwattr DW$406, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6179                            .dwattr DW$406, DW_AT_accessibility(DW_ACCESS_public)
    6180                            .dwendtag DW$T$81
    6181                    
    6182                    DW$T$244        .dwtag  DW_TAG_typedef, DW_AT_name("FVID_Frame"), DW_AT_type(*DW$T$93)
    6183                            .dwattr DW$T$244, DW_AT_language(DW_LANG_C)
    6184                    DW$T$97 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_memory_t"), DW_AT_type(*DW$T$96)
    6185                            .dwattr DW$T$97, DW_AT_language(DW_LANG_C)
    6186                    DW$T$247        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_totalreg_t"), DW_AT_type(*DW$T$130)
    6187                            .dwattr DW$T$247, DW_AT_language(DW_LANG_C)
    6188                    
    6189                    DW$T$144        .dwtag  DW_TAG_structure_type
    6190                            .dwattr DW$T$144, DW_AT_name("dsp_reg_t")
    6191                            .dwattr DW$T$144, DW_AT_byte_size(0xb4)
    6192                    DW$407  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$138)
    6193                            .dwattr DW$407, DW_AT_name("status_reg"), DW_AT_symbol_name("_status_reg")
    6194                            .dwattr DW$407, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6195                            .dwattr DW$407, DW_AT_accessibility(DW_ACCESS_public)
    6196                    DW$408  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$139)
    6197                            .dwattr DW$408, DW_AT_name("distance_reg"), DW_AT_symbol_name("_distance_reg")
    6198                            .dwattr DW$408, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6199                            .dwattr DW$408, DW_AT_accessibility(DW_ACCESS_public)
    6200                    DW$409  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$140)
    6201                            .dwattr DW$409, DW_AT_name("policy_reg"), DW_AT_symbol_name("_policy_reg")
    6202                            .dwattr DW$409, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    6203                            .dwattr DW$409, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  118

    6204                    DW$410  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$141)
    6205                            .dwattr DW$410, DW_AT_name("sound_reg"), DW_AT_symbol_name("_sound_reg")
    6206                            .dwattr DW$410, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    6207                            .dwattr DW$410, DW_AT_accessibility(DW_ACCESS_public)
    6208                    DW$411  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$142)
    6209                            .dwattr DW$411, DW_AT_name("result_reg"), DW_AT_symbol_name("_result_reg")
    6210                            .dwattr DW$411, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    6211                            .dwattr DW$411, DW_AT_accessibility(DW_ACCESS_public)
    6212                    DW$412  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$143)
    6213                            .dwattr DW$412, DW_AT_name("quality_value"), DW_AT_symbol_name("_quality_value")
    6214                            .dwattr DW$412, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    6215                            .dwattr DW$412, DW_AT_accessibility(DW_ACCESS_public)
    6216                    DW$413  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6217                            .dwattr DW$413, DW_AT_name("quality_count"), DW_AT_symbol_name("_quality_count")
    6218                            .dwattr DW$413, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    6219                            .dwattr DW$413, DW_AT_accessibility(DW_ACCESS_public)
    6220                    DW$414  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6221                            .dwattr DW$414, DW_AT_name("alg_control_count"), DW_AT_symbol_name("_alg_control_count")
    6222                            .dwattr DW$414, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    6223                            .dwattr DW$414, DW_AT_accessibility(DW_ACCESS_public)
    6224                    DW$415  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6225                            .dwattr DW$415, DW_AT_name("last_img_quality"), DW_AT_symbol_name("_last_img_quality")
    6226                            .dwattr DW$415, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    6227                            .dwattr DW$415, DW_AT_accessibility(DW_ACCESS_public)
    6228                    DW$416  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6229                            .dwattr DW$416, DW_AT_name("last_icon_id"), DW_AT_symbol_name("_last_icon_id")
    6230                            .dwattr DW$416, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    6231                            .dwattr DW$416, DW_AT_accessibility(DW_ACCESS_public)
    6232                    DW$417  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6233                            .dwattr DW$417, DW_AT_name("match_input_count"), DW_AT_symbol_name("_match_input_count")
    6234                            .dwattr DW$417, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    6235                            .dwattr DW$417, DW_AT_accessibility(DW_ACCESS_public)
    6236                            .dwendtag DW$T$144
    6237                    
    6238                    DW$T$251        .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$145)
    6239                            .dwattr DW$T$251, DW_AT_address_class(0x20)
    6240                    DW$T$253        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_bmp_t"), DW_AT_type(*DW$T$146)
    6241                            .dwattr DW$T$253, DW_AT_language(DW_LANG_C)
    6242                    
    6243                    DW$T$156        .dwtag  DW_TAG_enumeration_type
    6244                            .dwattr DW$T$156, DW_AT_byte_size(0x04)
    6245                    DW$418  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
    6246                    DW$419  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
    6247                    DW$420  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
    6248                    DW$421  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
    6249                    DW$422  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
    6250                    DW$423  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
    6251                            .dwendtag DW$T$156
    6252                    
    6253                    
    6254                    DW$T$160        .dwtag  DW_TAG_enumeration_type
    6255                            .dwattr DW$T$160, DW_AT_byte_size(0x04)
    6256                    DW$424  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_NOWAIT"), DW_AT_const_value(0x00)
    6257                    DW$425  .dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_WAIT"), DW_AT_const_value(0x01)
    6258                            .dwendtag DW$T$160
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  119

    6259                    
    6260                    DW$T$78 .dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$77)
    6261                            .dwattr DW$T$78, DW_AT_language(DW_LANG_C)
    6262                    
    6263                    DW$T$143        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    6264                            .dwattr DW$T$143, DW_AT_language(DW_LANG_C)
    6265                            .dwattr DW$T$143, DW_AT_byte_size(0x28)
    6266                    DW$426  .dwtag  DW_TAG_subrange_type
    6267                            .dwattr DW$426, DW_AT_upper_bound(0x09)
    6268                            .dwendtag DW$T$143
    6269                    
    6270                    DW$T$68 .dwtag  DW_TAG_typedef, DW_AT_name("MEM_sizep"), DW_AT_type(*DW$T$11)
    6271                            .dwattr DW$T$68, DW_AT_language(DW_LANG_C)
    6272                    
    6273                    DW$T$22 .dwtag  DW_TAG_structure_type
    6274                            .dwattr DW$T$22, DW_AT_byte_size(0x0c)
    6275                    DW$427  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6276                            .dwattr DW$427, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    6277                            .dwattr DW$427, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6278                            .dwattr DW$427, DW_AT_accessibility(DW_ACCESS_public)
    6279                    DW$428  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6280                            .dwattr DW$428, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    6281                            .dwattr DW$428, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6282                            .dwattr DW$428, DW_AT_accessibility(DW_ACCESS_public)
    6283                    DW$429  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6284                            .dwattr DW$429, DW_AT_name("pinAllocMask"), DW_AT_symbol_name("_pinAllocMask")
    6285                            .dwattr DW$429, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6286                            .dwattr DW$429, DW_AT_accessibility(DW_ACCESS_public)
    6287                            .dwendtag DW$T$22
    6288                    
    6289                    
    6290                    DW$T$61 .dwtag  DW_TAG_structure_type
    6291                            .dwattr DW$T$61, DW_AT_name("GIO_Obj")
    6292                            .dwattr DW$T$61, DW_AT_byte_size(0x3c)
    6293                    DW$430  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$59)
    6294                            .dwattr DW$430, DW_AT_name("fxns"), DW_AT_symbol_name("_fxns")
    6295                            .dwattr DW$430, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6296                            .dwattr DW$430, DW_AT_accessibility(DW_ACCESS_public)
    6297                    DW$431  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6298                            .dwattr DW$431, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
    6299                            .dwattr DW$431, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6300                            .dwattr DW$431, DW_AT_accessibility(DW_ACCESS_public)
    6301                    DW$432  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
    6302                            .dwattr DW$432, DW_AT_name("timeout"), DW_AT_symbol_name("_timeout")
    6303                            .dwattr DW$432, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6304                            .dwattr DW$432, DW_AT_accessibility(DW_ACCESS_public)
    6305                    DW$433  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$45)
    6306                            .dwattr DW$433, DW_AT_name("syncPacket"), DW_AT_symbol_name("_syncPacket")
    6307                            .dwattr DW$433, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6308                            .dwattr DW$433, DW_AT_accessibility(DW_ACCESS_public)
    6309                    DW$434  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$60)
    6310                            .dwattr DW$434, DW_AT_name("freeList"), DW_AT_symbol_name("_freeList")
    6311                            .dwattr DW$434, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6312                            .dwattr DW$434, DW_AT_accessibility(DW_ACCESS_public)
    6313                    DW$435  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  120

    6314                            .dwattr DW$435, DW_AT_name("syncObj"), DW_AT_symbol_name("_syncObj")
    6315                            .dwattr DW$435, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6316                            .dwattr DW$435, DW_AT_accessibility(DW_ACCESS_public)
    6317                    DW$436  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6318                            .dwattr DW$436, DW_AT_name("mdChan"), DW_AT_symbol_name("_mdChan")
    6319                            .dwattr DW$436, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    6320                            .dwattr DW$436, DW_AT_accessibility(DW_ACCESS_public)
    6321                            .dwendtag DW$T$61
    6322                    
    6323                    
    6324                    DW$T$66 .dwtag  DW_TAG_structure_type
    6325                            .dwattr DW$T$66, DW_AT_name("GIO_AppCallback")
    6326                            .dwattr DW$T$66, DW_AT_byte_size(0x08)
    6327                    DW$437  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$65)
    6328                            .dwattr DW$437, DW_AT_name("fxn"), DW_AT_symbol_name("_fxn")
    6329                            .dwattr DW$437, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6330                            .dwattr DW$437, DW_AT_accessibility(DW_ACCESS_public)
    6331                    DW$438  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
    6332                            .dwattr DW$438, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
    6333                            .dwattr DW$438, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6334                            .dwattr DW$438, DW_AT_accessibility(DW_ACCESS_public)
    6335                            .dwendtag DW$T$66
    6336                    
    6337                    
    6338                    DW$T$67 .dwtag  DW_TAG_structure_type
    6339                            .dwattr DW$T$67, DW_AT_byte_size(0x14)
    6340                    DW$439  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6341                            .dwattr DW$439, DW_AT_name("allocated"), DW_AT_symbol_name("_allocated")
    6342                            .dwattr DW$439, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6343                            .dwattr DW$439, DW_AT_accessibility(DW_ACCESS_public)
    6344                    DW$440  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6345                            .dwattr DW$440, DW_AT_name("eventId"), DW_AT_symbol_name("_eventId")
    6346                            .dwattr DW$440, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6347                            .dwattr DW$440, DW_AT_accessibility(DW_ACCESS_public)
    6348                    DW$441  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
    6349                            .dwattr DW$441, DW_AT_name("baseAddr"), DW_AT_symbol_name("_baseAddr")
    6350                            .dwattr DW$441, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6351                            .dwattr DW$441, DW_AT_accessibility(DW_ACCESS_public)
    6352                    DW$442  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6353                            .dwattr DW$442, DW_AT_name("i2cdrrAddr"), DW_AT_symbol_name("_i2cdrrAddr")
    6354                            .dwattr DW$442, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6355                            .dwattr DW$442, DW_AT_accessibility(DW_ACCESS_public)
    6356                    DW$443  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
    6357                            .dwattr DW$443, DW_AT_name("i2cdxrAddr"), DW_AT_symbol_name("_i2cdxrAddr")
    6358                            .dwattr DW$443, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6359                            .dwattr DW$443, DW_AT_accessibility(DW_ACCESS_public)
    6360                            .dwendtag DW$T$67
    6361                    
    6362                    
    6363                    DW$T$71 .dwtag  DW_TAG_structure_type
    6364                            .dwattr DW$T$71, DW_AT_name("dsp_image_msg_t")
    6365                            .dwattr DW$T$71, DW_AT_byte_size(0x34)
    6366                    DW$444  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6367                            .dwattr DW$444, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    6368                            .dwattr DW$444, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  121

    6369                            .dwattr DW$444, DW_AT_accessibility(DW_ACCESS_public)
    6370                    DW$445  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6371                            .dwattr DW$445, DW_AT_name("img_saved_score_l"), DW_AT_symbol_name("_img_saved_score_l")
    6372                            .dwattr DW$445, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6373                            .dwattr DW$445, DW_AT_accessibility(DW_ACCESS_public)
    6374                    DW$446  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6375                            .dwattr DW$446, DW_AT_name("img_saved_score_r"), DW_AT_symbol_name("_img_saved_score_r")
    6376                            .dwattr DW$446, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6377                            .dwattr DW$446, DW_AT_accessibility(DW_ACCESS_public)
    6378                    DW$447  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    6379                            .dwattr DW$447, DW_AT_name("img_ptr_l"), DW_AT_symbol_name("_img_ptr_l")
    6380                            .dwattr DW$447, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6381                            .dwattr DW$447, DW_AT_accessibility(DW_ACCESS_public)
    6382                    DW$448  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
    6383                            .dwattr DW$448, DW_AT_name("img_ptr_r"), DW_AT_symbol_name("_img_ptr_r")
    6384                            .dwattr DW$448, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6385                            .dwattr DW$448, DW_AT_accessibility(DW_ACCESS_public)
    6386                    DW$449  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6387                            .dwattr DW$449, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    6388                            .dwattr DW$449, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6389                            .dwattr DW$449, DW_AT_accessibility(DW_ACCESS_public)
    6390                    DW$450  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6391                            .dwattr DW$450, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    6392                            .dwattr DW$450, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6393                            .dwattr DW$450, DW_AT_accessibility(DW_ACCESS_public)
    6394                    DW$451  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6395                            .dwattr DW$451, DW_AT_name("img_saved_count_l"), DW_AT_symbol_name("_img_saved_count_l")
    6396                            .dwattr DW$451, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6397                            .dwattr DW$451, DW_AT_accessibility(DW_ACCESS_public)
    6398                    DW$452  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6399                            .dwattr DW$452, DW_AT_name("img_saved_count_r"), DW_AT_symbol_name("_img_saved_count_r")
    6400                            .dwattr DW$452, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    6401                            .dwattr DW$452, DW_AT_accessibility(DW_ACCESS_public)
    6402                    DW$453  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6403                            .dwattr DW$453, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    6404                            .dwattr DW$453, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    6405                            .dwattr DW$453, DW_AT_accessibility(DW_ACCESS_public)
    6406                    DW$454  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6407                            .dwattr DW$454, DW_AT_name("data_type_l"), DW_AT_symbol_name("_data_type_l")
    6408                            .dwattr DW$454, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    6409                            .dwattr DW$454, DW_AT_accessibility(DW_ACCESS_public)
    6410                    DW$455  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6411                            .dwattr DW$455, DW_AT_name("data_type_r"), DW_AT_symbol_name("_data_type_r")
    6412                            .dwattr DW$455, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    6413                            .dwattr DW$455, DW_AT_accessibility(DW_ACCESS_public)
    6414                            .dwendtag DW$T$71
    6415                    
    6416                    
    6417                    DW$T$72 .dwtag  DW_TAG_structure_type
    6418                            .dwattr DW$T$72, DW_AT_name("dsp_result_msg_t")
    6419                            .dwattr DW$T$72, DW_AT_byte_size(0x1c)
    6420                    DW$456  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6421                            .dwattr DW$456, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    6422                            .dwattr DW$456, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6423                            .dwattr DW$456, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  122

    6424                    DW$457  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6425                            .dwattr DW$457, DW_AT_name("result_left"), DW_AT_symbol_name("_result_left")
    6426                            .dwattr DW$457, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6427                            .dwattr DW$457, DW_AT_accessibility(DW_ACCESS_public)
    6428                    DW$458  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6429                            .dwattr DW$458, DW_AT_name("result_right"), DW_AT_symbol_name("_result_right")
    6430                            .dwattr DW$458, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6431                            .dwattr DW$458, DW_AT_accessibility(DW_ACCESS_public)
    6432                    DW$459  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6433                            .dwattr DW$459, DW_AT_name("eye_flag"), DW_AT_symbol_name("_eye_flag")
    6434                            .dwattr DW$459, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6435                            .dwattr DW$459, DW_AT_accessibility(DW_ACCESS_public)
    6436                    DW$460  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6437                            .dwattr DW$460, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    6438                            .dwattr DW$460, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6439                            .dwattr DW$460, DW_AT_accessibility(DW_ACCESS_public)
    6440                    DW$461  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6441                            .dwattr DW$461, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    6442                            .dwattr DW$461, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6443                            .dwattr DW$461, DW_AT_accessibility(DW_ACCESS_public)
    6444                            .dwendtag DW$T$72
    6445                    
    6446                    
    6447                    DW$T$93 .dwtag  DW_TAG_structure_type
    6448                            .dwattr DW$T$93, DW_AT_name("FVID_Frame")
    6449                            .dwattr DW$T$93, DW_AT_byte_size(0x20)
    6450                    DW$462  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6451                            .dwattr DW$462, DW_AT_name("queElement"), DW_AT_symbol_name("_queElement")
    6452                            .dwattr DW$462, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6453                            .dwattr DW$462, DW_AT_accessibility(DW_ACCESS_public)
    6454                    DW$463  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$92)
    6455                            .dwattr DW$463, DW_AT_name("frame"), DW_AT_symbol_name("_frame")
    6456                            .dwattr DW$463, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6457                            .dwattr DW$463, DW_AT_accessibility(DW_ACCESS_public)
    6458                            .dwendtag DW$T$93
    6459                    
    6460                    
    6461                    DW$T$96 .dwtag  DW_TAG_structure_type
    6462                            .dwattr DW$T$96, DW_AT_name("dsp_tsk_memory_t")
    6463                            .dwattr DW$T$96, DW_AT_byte_size(0x08)
    6464                    DW$464  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6465                            .dwattr DW$464, DW_AT_name("dataptr_len"), DW_AT_symbol_name("_dataptr_len")
    6466                            .dwattr DW$464, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6467                            .dwattr DW$464, DW_AT_accessibility(DW_ACCESS_public)
    6468                    DW$465  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    6469                            .dwattr DW$465, DW_AT_name("data_ptr"), DW_AT_symbol_name("_data_ptr")
    6470                            .dwattr DW$465, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6471                            .dwattr DW$465, DW_AT_accessibility(DW_ACCESS_public)
    6472                            .dwendtag DW$T$96
    6473                    
    6474                    
    6475                    DW$T$130        .dwtag  DW_TAG_structure_type
    6476                            .dwattr DW$T$130, DW_AT_name("dsp_tsk_totalreg_t")
    6477                            .dwattr DW$T$130, DW_AT_byte_size(0x138)
    6478                    DW$466  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$117)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  123

    6479                            .dwattr DW$466, DW_AT_name("tsk_control_reg"), DW_AT_symbol_name("_tsk_control_reg")
    6480                            .dwattr DW$466, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6481                            .dwattr DW$466, DW_AT_accessibility(DW_ACCESS_public)
    6482                    DW$467  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    6483                            .dwattr DW$467, DW_AT_name("tsk_policy_reg"), DW_AT_symbol_name("_tsk_policy_reg")
    6484                            .dwattr DW$467, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6485                            .dwattr DW$467, DW_AT_accessibility(DW_ACCESS_public)
    6486                    DW$468  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$118)
    6487                            .dwattr DW$468, DW_AT_name("tsk_flag_reg"), DW_AT_symbol_name("_tsk_flag_reg")
    6488                            .dwattr DW$468, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6489                            .dwattr DW$468, DW_AT_accessibility(DW_ACCESS_public)
    6490                    DW$469  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$119)
    6491                            .dwattr DW$469, DW_AT_name("alg_result_reg"), DW_AT_symbol_name("_alg_result_reg")
    6492                            .dwattr DW$469, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    6493                            .dwattr DW$469, DW_AT_accessibility(DW_ACCESS_public)
    6494                    DW$470  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$120)
    6495                            .dwattr DW$470, DW_AT_name("alg_sound_reg"), DW_AT_symbol_name("_alg_sound_reg")
    6496                            .dwattr DW$470, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    6497                            .dwattr DW$470, DW_AT_accessibility(DW_ACCESS_public)
    6498                    DW$471  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$121)
    6499                            .dwattr DW$471, DW_AT_name("alg_devparam_reg"), DW_AT_symbol_name("_alg_devparam_reg")
    6500                            .dwattr DW$471, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    6501                            .dwattr DW$471, DW_AT_accessibility(DW_ACCESS_public)
    6502                    DW$472  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$122)
    6503                            .dwattr DW$472, DW_AT_name("tsk_watchdog_reg"), DW_AT_symbol_name("_tsk_watchdog_reg")
    6504                            .dwattr DW$472, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    6505                            .dwattr DW$472, DW_AT_accessibility(DW_ACCESS_public)
    6506                    DW$473  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$123)
    6507                            .dwattr DW$473, DW_AT_name("img_icon_reg"), DW_AT_symbol_name("_img_icon_reg")
    6508                            .dwattr DW$473, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    6509                            .dwattr DW$473, DW_AT_accessibility(DW_ACCESS_public)
    6510                    DW$474  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$124)
    6511                            .dwattr DW$474, DW_AT_name("dsp_mac_reg"), DW_AT_symbol_name("_dsp_mac_reg")
    6512                            .dwattr DW$474, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
    6513                            .dwattr DW$474, DW_AT_accessibility(DW_ACCESS_public)
    6514                    DW$475  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$125)
    6515                            .dwattr DW$475, DW_AT_name("dsp_copyimg_reg"), DW_AT_symbol_name("_dsp_copyimg_reg")
    6516                            .dwattr DW$475, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    6517                            .dwattr DW$475, DW_AT_accessibility(DW_ACCESS_public)
    6518                    DW$476  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$126)
    6519                            .dwattr DW$476, DW_AT_name("dsp_testimg_reg"), DW_AT_symbol_name("_dsp_testimg_reg")
    6520                            .dwattr DW$476, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    6521                            .dwattr DW$476, DW_AT_accessibility(DW_ACCESS_public)
    6522                    DW$477  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$127)
    6523                            .dwattr DW$477, DW_AT_name("dsp_distance_ctrl_reg"), DW_AT_symbol_name("_dsp_distance_ctrl_reg
    6524                            .dwattr DW$477, DW_AT_data_member_location[DW_OP_plus_uconst 0x104]
    6525                            .dwattr DW$477, DW_AT_accessibility(DW_ACCESS_public)
    6526                    DW$478  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$128)
    6527                            .dwattr DW$478, DW_AT_name("dsp_buildtime_reg"), DW_AT_symbol_name("_dsp_buildtime_reg")
    6528                            .dwattr DW$478, DW_AT_data_member_location[DW_OP_plus_uconst 0x114]
    6529                            .dwattr DW$478, DW_AT_accessibility(DW_ACCESS_public)
    6530                    DW$479  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$129)
    6531                            .dwattr DW$479, DW_AT_name("switch_control_reg"), DW_AT_symbol_name("_switch_control_reg")
    6532                            .dwattr DW$479, DW_AT_data_member_location[DW_OP_plus_uconst 0x134]
    6533                            .dwattr DW$479, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  124

    6534                            .dwendtag DW$T$130
    6535                    
    6536                    DW$T$138        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_status_t"), DW_AT_type(*DW$T$131)
    6537                            .dwattr DW$T$138, DW_AT_language(DW_LANG_C)
    6538                    DW$T$139        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_t"), DW_AT_type(*DW$T$132)
    6539                            .dwattr DW$T$139, DW_AT_language(DW_LANG_C)
    6540                    DW$T$140        .dwtag  DW_TAG_typedef, DW_AT_name("policy_t"), DW_AT_type(*DW$T$134)
    6541                            .dwattr DW$T$140, DW_AT_language(DW_LANG_C)
    6542                    DW$T$141        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_sound_t"), DW_AT_type(*DW$T$135)
    6543                            .dwattr DW$T$141, DW_AT_language(DW_LANG_C)
    6544                    DW$T$142        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_result_t"), DW_AT_type(*DW$T$137)
    6545                            .dwattr DW$T$142, DW_AT_language(DW_LANG_C)
    6546                    
    6547                    DW$T$145        .dwtag  DW_TAG_structure_type
    6548                            .dwattr DW$T$145, DW_AT_name("dsp_match_msg_t")
    6549                            .dwattr DW$T$145, DW_AT_byte_size(0x0c)
    6550                    DW$480  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
    6551                            .dwattr DW$480, DW_AT_name("elem"), DW_AT_symbol_name("_elem")
    6552                            .dwattr DW$480, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6553                            .dwattr DW$480, DW_AT_accessibility(DW_ACCESS_public)
    6554                    DW$481  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6555                            .dwattr DW$481, DW_AT_name("process_flag"), DW_AT_symbol_name("_process_flag")
    6556                            .dwattr DW$481, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6557                            .dwattr DW$481, DW_AT_accessibility(DW_ACCESS_public)
    6558                            .dwendtag DW$T$145
    6559                    
    6560                    
    6561                    DW$T$146        .dwtag  DW_TAG_structure_type
    6562                            .dwattr DW$T$146, DW_AT_name("dsp_bmp_t")
    6563                            .dwattr DW$T$146, DW_AT_byte_size(0x08)
    6564                    DW$482  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6565                            .dwattr DW$482, DW_AT_name("width"), DW_AT_symbol_name("_width")
    6566                            .dwattr DW$482, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6567                            .dwattr DW$482, DW_AT_accessibility(DW_ACCESS_public)
    6568                    DW$483  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6569                            .dwattr DW$483, DW_AT_name("height"), DW_AT_symbol_name("_height")
    6570                            .dwattr DW$483, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6571                            .dwattr DW$483, DW_AT_accessibility(DW_ACCESS_public)
    6572                            .dwendtag DW$T$146
    6573                    
    6574                    DW$T$65 .dwtag  DW_TAG_typedef, DW_AT_name("GIO_TappCallback"), DW_AT_type(*DW$T$64)
    6575                            .dwattr DW$T$65, DW_AT_language(DW_LANG_C)
    6576                    DW$T$77 .dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
    6577                            .dwattr DW$T$77, DW_AT_language(DW_LANG_C)
    6578                    DW$T$21 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$20)
    6579                            .dwattr DW$T$21, DW_AT_address_class(0x20)
    6580                    DW$T$25 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$24)
    6581                            .dwattr DW$T$25, DW_AT_language(DW_LANG_C)
    6582                    DW$T$60 .dwtag  DW_TAG_typedef, DW_AT_name("QUE_Obj"), DW_AT_type(*DW$T$24)
    6583                            .dwattr DW$T$60, DW_AT_language(DW_LANG_C)
    6584                    DW$T$45 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$44)
    6585                            .dwattr DW$T$45, DW_AT_language(DW_LANG_C)
    6586                    DW$T$59 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$58)
    6587                            .dwattr DW$T$59, DW_AT_address_class(0x20)
    6588                    
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  125

    6589                    DW$T$92 .dwtag  DW_TAG_union_type
    6590                            .dwattr DW$T$92, DW_AT_byte_size(0x18)
    6591                    DW$484  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$88)
    6592                            .dwattr DW$484, DW_AT_name("iFrm"), DW_AT_symbol_name("_iFrm")
    6593                            .dwattr DW$484, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6594                            .dwattr DW$484, DW_AT_accessibility(DW_ACCESS_public)
    6595                    DW$485  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$89)
    6596                            .dwattr DW$485, DW_AT_name("pFrm"), DW_AT_symbol_name("_pFrm")
    6597                            .dwattr DW$485, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6598                            .dwattr DW$485, DW_AT_accessibility(DW_ACCESS_public)
    6599                    DW$486  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$90)
    6600                            .dwattr DW$486, DW_AT_name("riFrm"), DW_AT_symbol_name("_riFrm")
    6601                            .dwattr DW$486, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6602                            .dwattr DW$486, DW_AT_accessibility(DW_ACCESS_public)
    6603                    DW$487  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$91)
    6604                            .dwattr DW$487, DW_AT_name("rpFrm"), DW_AT_symbol_name("_rpFrm")
    6605                            .dwattr DW$487, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6606                            .dwattr DW$487, DW_AT_accessibility(DW_ACCESS_public)
    6607                            .dwendtag DW$T$92
    6608                    
    6609                    DW$T$117        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_control_t"), DW_AT_type(*DW$T$94)
    6610                            .dwattr DW$T$117, DW_AT_language(DW_LANG_C)
    6611                    DW$T$99 .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_policy_t"), DW_AT_type(*DW$T$95)
    6612                            .dwattr DW$T$99, DW_AT_language(DW_LANG_C)
    6613                    DW$T$118        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_flag_t"), DW_AT_type(*DW$T$98)
    6614                            .dwattr DW$T$118, DW_AT_language(DW_LANG_C)
    6615                    DW$T$119        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_result_t"), DW_AT_type(*DW$T$100)
    6616                            .dwattr DW$T$119, DW_AT_language(DW_LANG_C)
    6617                    DW$T$120        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_sound_t"), DW_AT_type(*DW$T$101)
    6618                            .dwattr DW$T$120, DW_AT_language(DW_LANG_C)
    6619                    DW$T$121        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_algorithm_devparam_t"), DW_AT_type(*DW$T$103)
    6620                            .dwattr DW$T$121, DW_AT_language(DW_LANG_C)
    6621                    DW$T$122        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_tsk_watchdog_t"), DW_AT_type(*DW$T$104)
    6622                            .dwattr DW$T$122, DW_AT_language(DW_LANG_C)
    6623                    DW$T$123        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_icon_t"), DW_AT_type(*DW$T$105)
    6624                            .dwattr DW$T$123, DW_AT_language(DW_LANG_C)
    6625                    DW$T$124        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_mac_t"), DW_AT_type(*DW$T$107)
    6626                            .dwattr DW$T$124, DW_AT_language(DW_LANG_C)
    6627                    DW$T$125        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_copyimg_t"), DW_AT_type(*DW$T$109)
    6628                            .dwattr DW$T$125, DW_AT_language(DW_LANG_C)
    6629                    DW$T$126        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_testimg_t"), DW_AT_type(*DW$T$112)
    6630                            .dwattr DW$T$126, DW_AT_language(DW_LANG_C)
    6631                    DW$T$127        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_distance_ctrl_t"), DW_AT_type(*DW$T$113)
    6632                            .dwattr DW$T$127, DW_AT_language(DW_LANG_C)
    6633                    DW$T$128        .dwtag  DW_TAG_typedef, DW_AT_name("dsp_buildtime_t"), DW_AT_type(*DW$T$115)
    6634                            .dwattr DW$T$128, DW_AT_language(DW_LANG_C)
    6635                    DW$T$129        .dwtag  DW_TAG_typedef, DW_AT_name("switch_control_t"), DW_AT_type(*DW$T$116)
    6636                            .dwattr DW$T$129, DW_AT_language(DW_LANG_C)
    6637                    
    6638                    DW$T$131        .dwtag  DW_TAG_structure_type
    6639                            .dwattr DW$T$131, DW_AT_name("dsp_status_t")
    6640                            .dwattr DW$T$131, DW_AT_byte_size(0x18)
    6641                    DW$488  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6642                            .dwattr DW$488, DW_AT_name("tsk_img_status"), DW_AT_symbol_name("_tsk_img_status")
    6643                            .dwattr DW$488, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  126

    6644                            .dwattr DW$488, DW_AT_accessibility(DW_ACCESS_public)
    6645                    DW$489  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6646                            .dwattr DW$489, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    6647                            .dwattr DW$489, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6648                            .dwattr DW$489, DW_AT_accessibility(DW_ACCESS_public)
    6649                    DW$490  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6650                            .dwattr DW$490, DW_AT_name("tsk_alg_saved_status"), DW_AT_symbol_name("_tsk_alg_saved_status")
    6651                            .dwattr DW$490, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6652                            .dwattr DW$490, DW_AT_accessibility(DW_ACCESS_public)
    6653                    DW$491  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6654                            .dwattr DW$491, DW_AT_name("tsk_alg_inuse"), DW_AT_symbol_name("_tsk_alg_inuse")
    6655                            .dwattr DW$491, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6656                            .dwattr DW$491, DW_AT_accessibility(DW_ACCESS_public)
    6657                    DW$492  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6658                            .dwattr DW$492, DW_AT_name("proc_start_time"), DW_AT_symbol_name("_proc_start_time")
    6659                            .dwattr DW$492, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6660                            .dwattr DW$492, DW_AT_accessibility(DW_ACCESS_public)
    6661                    DW$493  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6662                            .dwattr DW$493, DW_AT_name("proc_timeout"), DW_AT_symbol_name("_proc_timeout")
    6663                            .dwattr DW$493, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6664                            .dwattr DW$493, DW_AT_accessibility(DW_ACCESS_public)
    6665                    DW$494  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6666                            .dwattr DW$494, DW_AT_name("tsk_testimg_tag_left"), DW_AT_symbol_name("_tsk_testimg_tag_left")
    6667                            .dwattr DW$494, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6668                            .dwattr DW$494, DW_AT_accessibility(DW_ACCESS_public)
    6669                    DW$495  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6670                            .dwattr DW$495, DW_AT_name("tsk_testimg_tag_right"), DW_AT_symbol_name("_tsk_testimg_tag_right
    6671                            .dwattr DW$495, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6672                            .dwattr DW$495, DW_AT_accessibility(DW_ACCESS_public)
    6673                            .dwendtag DW$T$131
    6674                    
    6675                    
    6676                    DW$T$132        .dwtag  DW_TAG_structure_type
    6677                            .dwattr DW$T$132, DW_AT_name("dsp_distance_t")
    6678                            .dwattr DW$T$132, DW_AT_byte_size(0x24)
    6679                    DW$496  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6680                            .dwattr DW$496, DW_AT_name("same_count"), DW_AT_symbol_name("_same_count")
    6681                            .dwattr DW$496, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6682                            .dwattr DW$496, DW_AT_accessibility(DW_ACCESS_public)
    6683                    DW$497  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6684                            .dwattr DW$497, DW_AT_name("last_distance"), DW_AT_symbol_name("_last_distance")
    6685                            .dwattr DW$497, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6686                            .dwattr DW$497, DW_AT_accessibility(DW_ACCESS_public)
    6687                    DW$498  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6688                            .dwattr DW$498, DW_AT_name("if_has_people"), DW_AT_symbol_name("_if_has_people")
    6689                            .dwattr DW$498, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6690                            .dwattr DW$498, DW_AT_accessibility(DW_ACCESS_public)
    6691                    DW$499  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6692                            .dwattr DW$499, DW_AT_name("last_if_has"), DW_AT_symbol_name("_last_if_has")
    6693                            .dwattr DW$499, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6694                            .dwattr DW$499, DW_AT_accessibility(DW_ACCESS_public)
    6695                    DW$500  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6696                            .dwattr DW$500, DW_AT_name("no_count"), DW_AT_symbol_name("_no_count")
    6697                            .dwattr DW$500, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6698                            .dwattr DW$500, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  127

    6699                    DW$501  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6700                            .dwattr DW$501, DW_AT_name("has_count"), DW_AT_symbol_name("_has_count")
    6701                            .dwattr DW$501, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6702                            .dwattr DW$501, DW_AT_accessibility(DW_ACCESS_public)
    6703                    DW$502  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6704                            .dwattr DW$502, DW_AT_name("disp_count"), DW_AT_symbol_name("_disp_count")
    6705                            .dwattr DW$502, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6706                            .dwattr DW$502, DW_AT_accessibility(DW_ACCESS_public)
    6707                    DW$503  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6708                            .dwattr DW$503, DW_AT_name("if_disp_image"), DW_AT_symbol_name("_if_disp_image")
    6709                            .dwattr DW$503, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6710                            .dwattr DW$503, DW_AT_accessibility(DW_ACCESS_public)
    6711                    DW$504  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6712                            .dwattr DW$504, DW_AT_name("wait_frame"), DW_AT_symbol_name("_wait_frame")
    6713                            .dwattr DW$504, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    6714                            .dwattr DW$504, DW_AT_accessibility(DW_ACCESS_public)
    6715                            .dwendtag DW$T$132
    6716                    
    6717                    
    6718                    DW$T$134        .dwtag  DW_TAG_structure_type
    6719                            .dwattr DW$T$134, DW_AT_name("policy_t")
    6720                            .dwattr DW$T$134, DW_AT_byte_size(0x28)
    6721                    DW$505  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6722                            .dwattr DW$505, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    6723                            .dwattr DW$505, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6724                            .dwattr DW$505, DW_AT_accessibility(DW_ACCESS_public)
    6725                    DW$506  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6726                            .dwattr DW$506, DW_AT_name("iden_count"), DW_AT_symbol_name("_iden_count")
    6727                            .dwattr DW$506, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6728                            .dwattr DW$506, DW_AT_accessibility(DW_ACCESS_public)
    6729                    DW$507  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6730                            .dwattr DW$507, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    6731                            .dwattr DW$507, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6732                            .dwattr DW$507, DW_AT_accessibility(DW_ACCESS_public)
    6733                    DW$508  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6734                            .dwattr DW$508, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    6735                            .dwattr DW$508, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6736                            .dwattr DW$508, DW_AT_accessibility(DW_ACCESS_public)
    6737                    DW$509  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
    6738                            .dwattr DW$509, DW_AT_name("enroll_score_l"), DW_AT_symbol_name("_enroll_score_l")
    6739                            .dwattr DW$509, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6740                            .dwattr DW$509, DW_AT_accessibility(DW_ACCESS_public)
    6741                    DW$510  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$133)
    6742                            .dwattr DW$510, DW_AT_name("enroll_score_r"), DW_AT_symbol_name("_enroll_score_r")
    6743                            .dwattr DW$510, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6744                            .dwattr DW$510, DW_AT_accessibility(DW_ACCESS_public)
    6745                            .dwendtag DW$T$134
    6746                    
    6747                    
    6748                    DW$T$135        .dwtag  DW_TAG_structure_type
    6749                            .dwattr DW$T$135, DW_AT_name("dsp_sound_t")
    6750                            .dwattr DW$T$135, DW_AT_byte_size(0x08)
    6751                    DW$511  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6752                            .dwattr DW$511, DW_AT_name("last_sound_time"), DW_AT_symbol_name("_last_sound_time")
    6753                            .dwattr DW$511, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  128

    6754                            .dwattr DW$511, DW_AT_accessibility(DW_ACCESS_public)
    6755                    DW$512  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6756                            .dwattr DW$512, DW_AT_name("last_sound_value"), DW_AT_symbol_name("_last_sound_value")
    6757                            .dwattr DW$512, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6758                            .dwattr DW$512, DW_AT_accessibility(DW_ACCESS_public)
    6759                            .dwendtag DW$T$135
    6760                    
    6761                    
    6762                    DW$T$137        .dwtag  DW_TAG_structure_type
    6763                            .dwattr DW$T$137, DW_AT_name("dsp_result_t")
    6764                            .dwattr DW$T$137, DW_AT_byte_size(0x0c)
    6765                    DW$513  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$136)
    6766                            .dwattr DW$513, DW_AT_name("count"), DW_AT_symbol_name("_count")
    6767                            .dwattr DW$513, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6768                            .dwattr DW$513, DW_AT_accessibility(DW_ACCESS_public)
    6769                    DW$514  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$136)
    6770                            .dwattr DW$514, DW_AT_name("result"), DW_AT_symbol_name("_result")
    6771                            .dwattr DW$514, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6772                            .dwattr DW$514, DW_AT_accessibility(DW_ACCESS_public)
    6773                    DW$515  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$136)
    6774                            .dwattr DW$515, DW_AT_name("grab_iden_result"), DW_AT_symbol_name("_grab_iden_result")
    6775                            .dwattr DW$515, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6776                            .dwattr DW$515, DW_AT_accessibility(DW_ACCESS_public)
    6777                            .dwendtag DW$T$137
    6778                    
    6779                    DW$T$64 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
    6780                            .dwattr DW$T$64, DW_AT_address_class(0x20)
    6781                    
    6782                    DW$T$136        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$8)
    6783                            .dwattr DW$T$136, DW_AT_language(DW_LANG_C)
    6784                            .dwattr DW$T$136, DW_AT_byte_size(0x04)
    6785                    DW$516  .dwtag  DW_TAG_subrange_type
    6786                            .dwattr DW$516, DW_AT_upper_bound(0x01)
    6787                            .dwendtag DW$T$136
    6788                    
    6789                    
    6790                    DW$T$133        .dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$10)
    6791                            .dwattr DW$T$133, DW_AT_language(DW_LANG_C)
    6792                            .dwattr DW$T$133, DW_AT_byte_size(0x10)
    6793                    DW$517  .dwtag  DW_TAG_subrange_type
    6794                            .dwattr DW$517, DW_AT_upper_bound(0x03)
    6795                            .dwendtag DW$T$133
    6796                    
    6797                    DW$T$20 .dwtag  DW_TAG_volatile_type
    6798                            .dwattr DW$T$20, DW_AT_type(*DW$T$19)
    6799                    
    6800                    DW$T$24 .dwtag  DW_TAG_structure_type
    6801                            .dwattr DW$T$24, DW_AT_name("QUE_Elem")
    6802                            .dwattr DW$T$24, DW_AT_byte_size(0x08)
    6803                    DW$518  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    6804                            .dwattr DW$518, DW_AT_name("next"), DW_AT_symbol_name("_next")
    6805                            .dwattr DW$518, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6806                            .dwattr DW$518, DW_AT_accessibility(DW_ACCESS_public)
    6807                    DW$519  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
    6808                            .dwattr DW$519, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  129

    6809                            .dwattr DW$519, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6810                            .dwattr DW$519, DW_AT_accessibility(DW_ACCESS_public)
    6811                            .dwendtag DW$T$24
    6812                    
    6813                    DW$T$23 .dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$24)
    6814                            .dwattr DW$T$23, DW_AT_address_class(0x20)
    6815                    DW$T$44 .dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$30)
    6816                            .dwattr DW$T$44, DW_AT_language(DW_LANG_C)
    6817                    DW$T$58 .dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$57)
    6818                            .dwattr DW$T$58, DW_AT_language(DW_LANG_C)
    6819                    DW$T$88 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_IFrame"), DW_AT_type(*DW$T$84)
    6820                            .dwattr DW$T$88, DW_AT_language(DW_LANG_C)
    6821                    DW$T$89 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_PFrame"), DW_AT_type(*DW$T$85)
    6822                            .dwattr DW$T$89, DW_AT_language(DW_LANG_C)
    6823                    DW$T$90 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawIFrame"), DW_AT_type(*DW$T$86)
    6824                            .dwattr DW$T$90, DW_AT_language(DW_LANG_C)
    6825                    DW$T$91 .dwtag  DW_TAG_typedef, DW_AT_name("FVID_RawPFrame"), DW_AT_type(*DW$T$87)
    6826                            .dwattr DW$T$91, DW_AT_language(DW_LANG_C)
    6827                    
    6828                    DW$T$94 .dwtag  DW_TAG_structure_type
    6829                            .dwattr DW$T$94, DW_AT_name("dsp_tsk_control_t")
    6830                            .dwattr DW$T$94, DW_AT_byte_size(0x0c)
    6831                    DW$520  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6832                            .dwattr DW$520, DW_AT_name("tsk_img_control"), DW_AT_symbol_name("_tsk_img_control")
    6833                            .dwattr DW$520, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6834                            .dwattr DW$520, DW_AT_accessibility(DW_ACCESS_public)
    6835                    DW$521  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6836                            .dwattr DW$521, DW_AT_name("tsk_img_control_count"), DW_AT_symbol_name("_tsk_img_control_count
    6837                            .dwattr DW$521, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    6838                            .dwattr DW$521, DW_AT_accessibility(DW_ACCESS_public)
    6839                    DW$522  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6840                            .dwattr DW$522, DW_AT_name("tsk_alg_control"), DW_AT_symbol_name("_tsk_alg_control")
    6841                            .dwattr DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6842                            .dwattr DW$522, DW_AT_accessibility(DW_ACCESS_public)
    6843                    DW$523  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6844                            .dwattr DW$523, DW_AT_name("tsk_alg_control_count"), DW_AT_symbol_name("_tsk_alg_control_count
    6845                            .dwattr DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6846                            .dwattr DW$523, DW_AT_accessibility(DW_ACCESS_public)
    6847                    DW$524  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6848                            .dwattr DW$524, DW_AT_name("tsk_adc_value"), DW_AT_symbol_name("_tsk_adc_value")
    6849                            .dwattr DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6850                            .dwattr DW$524, DW_AT_accessibility(DW_ACCESS_public)
    6851                            .dwendtag DW$T$94
    6852                    
    6853                    
    6854                    DW$T$95 .dwtag  DW_TAG_structure_type
    6855                            .dwattr DW$T$95, DW_AT_name("dsp_tsk_policy_t")
    6856                            .dwattr DW$T$95, DW_AT_byte_size(0x0c)
    6857                    DW$525  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6858                            .dwattr DW$525, DW_AT_name("policy_control"), DW_AT_symbol_name("_policy_control")
    6859                            .dwattr DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6860                            .dwattr DW$525, DW_AT_accessibility(DW_ACCESS_public)
    6861                    DW$526  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6862                            .dwattr DW$526, DW_AT_name("try_count"), DW_AT_symbol_name("_try_count")
    6863                            .dwattr DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  130

    6864                            .dwattr DW$526, DW_AT_accessibility(DW_ACCESS_public)
    6865                    DW$527  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6866                            .dwattr DW$527, DW_AT_name("iden_mode"), DW_AT_symbol_name("_iden_mode")
    6867                            .dwattr DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6868                            .dwattr DW$527, DW_AT_accessibility(DW_ACCESS_public)
    6869                    DW$528  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6870                            .dwattr DW$528, DW_AT_name("data_type"), DW_AT_symbol_name("_data_type")
    6871                            .dwattr DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6872                            .dwattr DW$528, DW_AT_accessibility(DW_ACCESS_public)
    6873                    DW$529  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6874                            .dwattr DW$529, DW_AT_name("policy_flag"), DW_AT_symbol_name("_policy_flag")
    6875                            .dwattr DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6876                            .dwattr DW$529, DW_AT_accessibility(DW_ACCESS_public)
    6877                            .dwendtag DW$T$95
    6878                    
    6879                    
    6880                    DW$T$98 .dwtag  DW_TAG_structure_type
    6881                            .dwattr DW$T$98, DW_AT_name("dsp_tsk_flag_t")
    6882                            .dwattr DW$T$98, DW_AT_byte_size(0x1c)
    6883                    DW$530  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6884                            .dwattr DW$530, DW_AT_name("tsk_img_resp"), DW_AT_symbol_name("_tsk_img_resp")
    6885                            .dwattr DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6886                            .dwattr DW$530, DW_AT_accessibility(DW_ACCESS_public)
    6887                    DW$531  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6888                            .dwattr DW$531, DW_AT_name("tsk_alg_status"), DW_AT_symbol_name("_tsk_alg_status")
    6889                            .dwattr DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6890                            .dwattr DW$531, DW_AT_accessibility(DW_ACCESS_public)
    6891                    DW$532  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6892                            .dwattr DW$532, DW_AT_name("tsk_alg_status_count"), DW_AT_symbol_name("_tsk_alg_status_count")
    6893                            .dwattr DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    6894                            .dwattr DW$532, DW_AT_accessibility(DW_ACCESS_public)
    6895                    DW$533  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6896                            .dwattr DW$533, DW_AT_name("req_tsk_alg_control"), DW_AT_symbol_name("_req_tsk_alg_control")
    6897                            .dwattr DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    6898                            .dwattr DW$533, DW_AT_accessibility(DW_ACCESS_public)
    6899                    DW$534  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$9)
    6900                            .dwattr DW$534, DW_AT_name("req_tsk_alg_control_count"), DW_AT_symbol_name("_req_tsk_alg_contr
    6901                            .dwattr DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    6902                            .dwattr DW$534, DW_AT_accessibility(DW_ACCESS_public)
    6903                    DW$535  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    6904                            .dwattr DW$535, DW_AT_name("left_data"), DW_AT_symbol_name("_left_data")
    6905                            .dwattr DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    6906                            .dwattr DW$535, DW_AT_accessibility(DW_ACCESS_public)
    6907                    DW$536  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$97)
    6908                            .dwattr DW$536, DW_AT_name("right_data"), DW_AT_symbol_name("_right_data")
    6909                            .dwattr DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6910                            .dwattr DW$536, DW_AT_accessibility(DW_ACCESS_public)
    6911                            .dwendtag DW$T$98
    6912                    
    6913                    
    6914                    DW$T$100        .dwtag  DW_TAG_structure_type
    6915                            .dwattr DW$T$100, DW_AT_name("dsp_algorithm_result_t")
    6916                            .dwattr DW$T$100, DW_AT_byte_size(0x20)
    6917                    DW$537  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6918                            .dwattr DW$537, DW_AT_name("result_type"), DW_AT_symbol_name("_result_type")
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  131

    6919                            .dwattr DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6920                            .dwattr DW$537, DW_AT_accessibility(DW_ACCESS_public)
    6921                    DW$538  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$99)
    6922                            .dwattr DW$538, DW_AT_name("policy"), DW_AT_symbol_name("_policy")
    6923                            .dwattr DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6924                            .dwattr DW$538, DW_AT_accessibility(DW_ACCESS_public)
    6925                    DW$539  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6926                            .dwattr DW$539, DW_AT_name("feature_tag"), DW_AT_symbol_name("_feature_tag")
    6927                            .dwattr DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    6928                            .dwattr DW$539, DW_AT_accessibility(DW_ACCESS_public)
    6929                    DW$540  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6930                            .dwattr DW$540, DW_AT_name("left_result"), DW_AT_symbol_name("_left_result")
    6931                            .dwattr DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    6932                            .dwattr DW$540, DW_AT_accessibility(DW_ACCESS_public)
    6933                    DW$541  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
    6934                            .dwattr DW$541, DW_AT_name("right_result"), DW_AT_symbol_name("_right_result")
    6935                            .dwattr DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    6936                            .dwattr DW$541, DW_AT_accessibility(DW_ACCESS_public)
    6937                    DW$542  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
    6938                            .dwattr DW$542, DW_AT_name("result_data"), DW_AT_symbol_name("_result_data")
    6939                            .dwattr DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    6940                            .dwattr DW$542, DW_AT_accessibility(DW_ACCESS_public)
    6941                            .dwendtag DW$T$100
    6942                    
    6943                    
    6944                    DW$T$101        .dwtag  DW_TAG_structure_type
    6945                            .dwattr DW$T$101, DW_AT_name("dsp_algorithm_sound_t")
    6946                            .dwattr DW$T$101, DW_AT_byte_size(0x08)
    6947                    DW$543  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6948                            .dwattr DW$543, DW_AT_name("sound_value"), DW_AT_symbol_name("_sound_value")
    6949                            .dwattr DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6950                            .dwattr DW$543, DW_AT_accessibility(DW_ACCESS_public)
    6951                    DW$544  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6952                            .dwattr DW$544, DW_AT_name("sound_count"), DW_AT_symbol_name("_sound_count")
    6953                            .dwattr DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6954                            .dwattr DW$544, DW_AT_accessibility(DW_ACCESS_public)
    6955                            .dwendtag DW$T$101
    6956                    
    6957                    
    6958                    DW$T$103        .dwtag  DW_TAG_structure_type
    6959                            .dwattr DW$T$103, DW_AT_name("dsp_algorithm_devparam_t")
    6960                            .dwattr DW$T$103, DW_AT_byte_size(0x54)
    6961                    DW$545  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6962                            .dwattr DW$545, DW_AT_name("param_count"), DW_AT_symbol_name("_param_count")
    6963                            .dwattr DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6964                            .dwattr DW$545, DW_AT_accessibility(DW_ACCESS_public)
    6965                    DW$546  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$102)
    6966                            .dwattr DW$546, DW_AT_name("device_param"), DW_AT_symbol_name("_device_param")
    6967                            .dwattr DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6968                            .dwattr DW$546, DW_AT_accessibility(DW_ACCESS_public)
    6969                            .dwendtag DW$T$103
    6970                    
    6971                    
    6972                    DW$T$104        .dwtag  DW_TAG_structure_type
    6973                            .dwattr DW$T$104, DW_AT_name("dsp_tsk_watchdog_t")
TMS320C6x COFF Assembler PC v5.1.0 Fri Mar 25 16:51:07 2011

Tools Copyright (c) 1996-2005 Texas Instruments Incorporated
C:\DOCUME~1\yqhe\LOCALS~1\Temp\TI2522                                PAGE  132

    6974                            .dwattr DW$T$104, DW_AT_byte_size(0x08)
    6975                    DW$547  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6976                            .dwattr DW$547, DW_AT_name("tsk_img_watchdog"), DW_AT_symbol_name("_tsk_img_watchdog")
    6977                            .dwattr DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    6978                            .dwattr DW$547, DW_AT_accessibility(DW_ACCESS_public)
    6979                    DW$548  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6980                            .dwattr DW$548, DW_AT_name("tsk_alg_watchdog"), DW_AT_symbol_name("_tsk_alg_watchdog")
    6981                            .dwattr DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    6982                            .dwattr DW$548, DW_AT_accessibility(DW_ACCESS_public)
    6983                            .dwendtag DW$T$104
    6984                    
    6985                    
    6986                    DW$T$105        .dwtag  DW_TAG_structure_type
    6987                            .dwattr DW$T$105, DW_AT_name("dsp_icon_t")
    6988                            .dwattr DW$T$105, DW_AT_byte_size(0x14)
    6989                    DW$549  .dwtag  DW_TAG_member, DW_AT_type(*DW$T$11)
    6990                            .dwattr DW$549, DW_AT_name("req_icon_control"), DW_AT_symbol_name("_req_icon_control")
    6991                            .dwattr DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
