;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Thu Feb 17 13:27:16 2011                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

DW$156	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$51)
DW$157	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
	.dwendtag DW$T$52


DW$T$56	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)
DW$158	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$159	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$48)
	.dwendtag DW$T$56


DW$T$128	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$128, DW_AT_language(DW_LANG_C)

DW$T$129	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$129, DW_AT_language(DW_LANG_C)
DW$160	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$161	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
	.dwendtag DW$T$129


DW$T$132	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$132, DW_AT_language(DW_LANG_C)
DW$162	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$163	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$131)
	.dwendtag DW$T$132


DW$T$133	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$133, DW_AT_language(DW_LANG_C)
DW$164	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$131)
	.dwendtag DW$T$133


DW$T$135	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$134)
	.dwattr DW$T$135, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$135, DW_AT_byte_size(0x10)
DW$165	.dwtag  DW_TAG_subrange_type
	.dwattr DW$165, DW_AT_upper_bound(0x03)
	.dwendtag DW$T$135


DW$T$138	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$138, DW_AT_language(DW_LANG_C)
DW$166	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$138


DW$T$140	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$140, DW_AT_language(DW_LANG_C)
DW$167	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$168	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$169	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$140


DW$T$142	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$10)
	.dwattr DW$T$142, DW_AT_language(DW_LANG_C)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("Uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
DW$T$67	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Handle"), DW_AT_type(*DW$T$19)
	.dwattr DW$T$67, DW_AT_language(DW_LANG_C)

DW$T$172	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$172, DW_AT_language(DW_LANG_C)
DW$170	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$171	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$19)
	.dwendtag DW$T$172


DW$T$173	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$173, DW_AT_language(DW_LANG_C)
DW$172	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$173


DW$T$174	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$174, DW_AT_language(DW_LANG_C)
DW$T$175	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$175, DW_AT_address_class(0x20)

DW$T$176	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$176, DW_AT_language(DW_LANG_C)
DW$173	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$174	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$29)
DW$175	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$175)
	.dwendtag DW$T$176


DW$T$177	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$177, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$177, DW_AT_byte_size(0x84)
DW$176	.dwtag  DW_TAG_subrange_type
	.dwattr DW$176, DW_AT_upper_bound(0x20)
	.dwendtag DW$T$177

DW$T$25	.dwtag  DW_TAG_typedef, DW_AT_name("Uns"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$T$179	.dwtag  DW_TAG_volatile_type
	.dwattr DW$T$179, DW_AT_type(*DW$T$11)
DW$T$111	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$110)
	.dwattr DW$T$111, DW_AT_address_class(0x20)
DW$T$48	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$47)
	.dwattr DW$T$48, DW_AT_address_class(0x20)
DW$T$131	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$130)
	.dwattr DW$T$131, DW_AT_address_class(0x20)
DW$T$45	.dwtag  DW_TAG_typedef, DW_AT_name("String"), DW_AT_type(*DW$T$44)
	.dwattr DW$T$45, DW_AT_language(DW_LANG_C)
DW$T$103	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$102)
	.dwattr DW$T$103, DW_AT_address_class(0x20)
DW$T$200	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Fxns"), DW_AT_type(*DW$T$59)
	.dwattr DW$T$200, DW_AT_language(DW_LANG_C)

DW$T$204	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$203)
	.dwattr DW$T$204, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$204, DW_AT_byte_size(0x27c)
DW$177	.dwtag  DW_TAG_subrange_type
	.dwattr DW$177, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$204

DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("CACHE_Region"), DW_AT_type(*DW$T$114)
	.dwattr DW$T$115, DW_AT_language(DW_LANG_C)
DW$T$50	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$49)
	.dwattr DW$T$50, DW_AT_address_class(0x20)
DW$T$9	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned short")
	.dwattr DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$9, DW_AT_byte_size(0x02)
DW$T$134	.dwtag  DW_TAG_const_type
	.dwattr DW$T$134, DW_AT_type(*DW$T$26)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$110	.dwtag  DW_TAG_typedef, DW_AT_name("EDMA_Config"), DW_AT_type(*DW$T$20)
	.dwattr DW$T$110, DW_AT_language(DW_LANG_C)
DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_Packet"), DW_AT_type(*DW$T$46)
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
DW$T$130	.dwtag  DW_TAG_typedef, DW_AT_name("VPORTDIS_Params"), DW_AT_type(*DW$T$32)
	.dwattr DW$T$130, DW_AT_language(DW_LANG_C)
DW$T$44	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$43)
	.dwattr DW$T$44, DW_AT_address_class(0x20)
DW$T$102	.dwtag  DW_TAG_const_type
	.dwattr DW$T$102, DW_AT_type(*DW$T$43)

DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$59, DW_AT_name("IOM_Fxns")
	.dwattr DW$T$59, DW_AT_byte_size(0x18)
DW$178	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$36)
	.dwattr DW$178, DW_AT_name("mdBindDev"), DW_AT_symbol_name("_mdBindDev")
	.dwattr DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$178, DW_AT_accessibility(DW_ACCESS_public)
DW$179	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$39)
	.dwattr DW$179, DW_AT_name("mdUnBindDev"), DW_AT_symbol_name("_mdUnBindDev")
	.dwattr DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$179, DW_AT_accessibility(DW_ACCESS_public)
DW$180	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$42)
	.dwattr DW$180, DW_AT_name("mdControlChan"), DW_AT_symbol_name("_mdControlChan")
	.dwattr DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$180, DW_AT_accessibility(DW_ACCESS_public)
DW$181	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$54)
	.dwattr DW$181, DW_AT_name("mdCreateChan"), DW_AT_symbol_name("_mdCreateChan")
	.dwattr DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$181, DW_AT_accessibility(DW_ACCESS_public)
DW$182	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$55)
	.dwattr DW$182, DW_AT_name("mdDeleteChan"), DW_AT_symbol_name("_mdDeleteChan")
	.dwattr DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$182, DW_AT_accessibility(DW_ACCESS_public)
DW$183	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$58)
	.dwattr DW$183, DW_AT_name("mdSubmitChan"), DW_AT_symbol_name("_mdSubmitChan")
	.dwattr DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$183, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$59

DW$T$203	.dwtag  DW_TAG_typedef, DW_AT_name("_VPORT_ChanObj"), DW_AT_type(*DW$T$78)
	.dwattr DW$T$203, DW_AT_language(DW_LANG_C)

DW$T$114	.dwtag  DW_TAG_enumeration_type
	.dwattr DW$T$114, DW_AT_byte_size(0x04)
DW$184	.dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2"), DW_AT_const_value(0x00)
DW$185	.dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L2ALL"), DW_AT_const_value(0x01)
DW$186	.dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1P"), DW_AT_const_value(0x02)
DW$187	.dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1PALL"), DW_AT_const_value(0x03)
DW$188	.dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1D"), DW_AT_const_value(0x04)
DW$189	.dwtag  DW_TAG_enumerator, DW_AT_name("CACHE_L1DALL"), DW_AT_const_value(0x05)
	.dwendtag DW$T$114


DW$T$49	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$49, DW_AT_language(DW_LANG_C)
DW$190	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$191	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$48)
	.dwendtag DW$T$49

DW$T$36	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdBindDev"), DW_AT_type(*DW$T$35)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)
DW$T$39	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdUnBindDev"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$T$55	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdDeleteChan"), DW_AT_type(*DW$T$38)
	.dwattr DW$T$55, DW_AT_language(DW_LANG_C)
DW$T$42	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdControlChan"), DW_AT_type(*DW$T$41)
	.dwattr DW$T$42, DW_AT_language(DW_LANG_C)
DW$T$54	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdCreateChan"), DW_AT_type(*DW$T$53)
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)
DW$T$58	.dwtag  DW_TAG_typedef, DW_AT_name("IOM_TmdSubmitChan"), DW_AT_type(*DW$T$57)
	.dwattr DW$T$58, DW_AT_language(DW_LANG_C)

DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$20, DW_AT_byte_size(0x18)
DW$192	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$192, DW_AT_name("opt"), DW_AT_symbol_name("_opt")
	.dwattr DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$192, DW_AT_accessibility(DW_ACCESS_public)
DW$193	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$193, DW_AT_name("src"), DW_AT_symbol_name("_src")
	.dwattr DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$193, DW_AT_accessibility(DW_ACCESS_public)
DW$194	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$194, DW_AT_name("cnt"), DW_AT_symbol_name("_cnt")
	.dwattr DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$194, DW_AT_accessibility(DW_ACCESS_public)
DW$195	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$195, DW_AT_name("dst"), DW_AT_symbol_name("_dst")
	.dwattr DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$195, DW_AT_accessibility(DW_ACCESS_public)
DW$196	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$196, DW_AT_name("idx"), DW_AT_symbol_name("_idx")
	.dwattr DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$196, DW_AT_accessibility(DW_ACCESS_public)
DW$197	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$197, DW_AT_name("rld"), DW_AT_symbol_name("_rld")
	.dwattr DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$197, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$20

DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("DEV_Frame"), DW_AT_type(*DW$T$28)
	.dwattr DW$T$46, DW_AT_language(DW_LANG_C)

DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$32, DW_AT_byte_size(0x90)
DW$198	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$198, DW_AT_name("dmode"), DW_AT_symbol_name("_dmode")
	.dwattr DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$198, DW_AT_accessibility(DW_ACCESS_public)
DW$199	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$199, DW_AT_name("fldOp"), DW_AT_symbol_name("_fldOp")
	.dwattr DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$199, DW_AT_accessibility(DW_ACCESS_public)
DW$200	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$200, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$200, DW_AT_accessibility(DW_ACCESS_public)
DW$201	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$201, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$201, DW_AT_accessibility(DW_ACCESS_public)
DW$202	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$202, DW_AT_name("defValEn"), DW_AT_symbol_name("_defValEn")
	.dwattr DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$202, DW_AT_accessibility(DW_ACCESS_public)
DW$203	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$203, DW_AT_name("bpk10Bit"), DW_AT_symbol_name("_bpk10Bit")
	.dwattr DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$203, DW_AT_accessibility(DW_ACCESS_public)
DW$204	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$204, DW_AT_name("vctl1Config"), DW_AT_symbol_name("_vctl1Config")
	.dwattr DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$204, DW_AT_accessibility(DW_ACCESS_public)
DW$205	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$205, DW_AT_name("vctl2Config"), DW_AT_symbol_name("_vctl2Config")
	.dwattr DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$205, DW_AT_accessibility(DW_ACCESS_public)
DW$206	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$206, DW_AT_name("vctl3Config"), DW_AT_symbol_name("_vctl3Config")
	.dwattr DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$206, DW_AT_accessibility(DW_ACCESS_public)
DW$207	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$207, DW_AT_name("extCtl"), DW_AT_symbol_name("_extCtl")
	.dwattr DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr DW$207, DW_AT_accessibility(DW_ACCESS_public)
DW$208	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$208, DW_AT_name("frmHSize"), DW_AT_symbol_name("_frmHSize")
	.dwattr DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$208, DW_AT_accessibility(DW_ACCESS_public)
DW$209	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$209, DW_AT_name("frmVSize"), DW_AT_symbol_name("_frmVSize")
	.dwattr DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
	.dwattr DW$209, DW_AT_accessibility(DW_ACCESS_public)
DW$210	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$210, DW_AT_name("imgHOffsetFld1"), DW_AT_symbol_name("_imgHOffsetFld1")
	.dwattr DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$210, DW_AT_accessibility(DW_ACCESS_public)
DW$211	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$211, DW_AT_name("imgVOffsetFld1"), DW_AT_symbol_name("_imgVOffsetFld1")
	.dwattr DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
	.dwattr DW$211, DW_AT_accessibility(DW_ACCESS_public)
DW$212	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$212, DW_AT_name("imgHSizeFld1"), DW_AT_symbol_name("_imgHSizeFld1")
	.dwattr DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr DW$212, DW_AT_accessibility(DW_ACCESS_public)
DW$213	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$213, DW_AT_name("imgVSizeFld1"), DW_AT_symbol_name("_imgVSizeFld1")
	.dwattr DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
	.dwattr DW$213, DW_AT_accessibility(DW_ACCESS_public)
DW$214	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$214, DW_AT_name("imgHOffsetFld2"), DW_AT_symbol_name("_imgHOffsetFld2")
	.dwattr DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr DW$214, DW_AT_accessibility(DW_ACCESS_public)
DW$215	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$30)
	.dwattr DW$215, DW_AT_name("imgVOffsetFld2"), DW_AT_symbol_name("_imgVOffsetFld2")
	.dwattr DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
	.dwattr DW$215, DW_AT_accessibility(DW_ACCESS_public)
DW$216	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$216, DW_AT_name("imgHSizeFld2"), DW_AT_symbol_name("_imgHSizeFld2")
	.dwattr DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$216, DW_AT_accessibility(DW_ACCESS_public)
DW$217	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$217, DW_AT_name("imgVSizeFld2"), DW_AT_symbol_name("_imgVSizeFld2")
	.dwattr DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
	.dwattr DW$217, DW_AT_accessibility(DW_ACCESS_public)
DW$218	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$218, DW_AT_name("hBlnkStart"), DW_AT_symbol_name("_hBlnkStart")
	.dwattr DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
	.dwattr DW$218, DW_AT_accessibility(DW_ACCESS_public)
DW$219	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$219, DW_AT_name("hBlnkStop"), DW_AT_symbol_name("_hBlnkStop")
	.dwattr DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
	.dwattr DW$219, DW_AT_accessibility(DW_ACCESS_public)
DW$220	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$220, DW_AT_name("vBlnkXStartFld1"), DW_AT_symbol_name("_vBlnkXStartFld1")
	.dwattr DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
	.dwattr DW$220, DW_AT_accessibility(DW_ACCESS_public)
DW$221	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$221, DW_AT_name("vBlnkYStartFld1"), DW_AT_symbol_name("_vBlnkYStartFld1")
	.dwattr DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
	.dwattr DW$221, DW_AT_accessibility(DW_ACCESS_public)
DW$222	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$222, DW_AT_name("vBlnkXStopFld1"), DW_AT_symbol_name("_vBlnkXStopFld1")
	.dwattr DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
	.dwattr DW$222, DW_AT_accessibility(DW_ACCESS_public)
DW$223	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$223, DW_AT_name("vBlnkYStopFld1"), DW_AT_symbol_name("_vBlnkYStopFld1")
	.dwattr DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
	.dwattr DW$223, DW_AT_accessibility(DW_ACCESS_public)
DW$224	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$224, DW_AT_name("vBlnkXStartFld2"), DW_AT_symbol_name("_vBlnkXStartFld2")
	.dwattr DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
	.dwattr DW$224, DW_AT_accessibility(DW_ACCESS_public)
DW$225	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$225, DW_AT_name("vBlnkYStartFld2"), DW_AT_symbol_name("_vBlnkYStartFld2")
	.dwattr DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
	.dwattr DW$225, DW_AT_accessibility(DW_ACCESS_public)
DW$226	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$226, DW_AT_name("vBlnkXStopFld2"), DW_AT_symbol_name("_vBlnkXStopFld2")
	.dwattr DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
	.dwattr DW$226, DW_AT_accessibility(DW_ACCESS_public)
DW$227	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$227, DW_AT_name("vBlnkYStopFld2"), DW_AT_symbol_name("_vBlnkYStopFld2")
	.dwattr DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
	.dwattr DW$227, DW_AT_accessibility(DW_ACCESS_public)
DW$228	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$228, DW_AT_name("xStartFld1"), DW_AT_symbol_name("_xStartFld1")
	.dwattr DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
	.dwattr DW$228, DW_AT_accessibility(DW_ACCESS_public)
DW$229	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$229, DW_AT_name("yStartFld1"), DW_AT_symbol_name("_yStartFld1")
	.dwattr DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
	.dwattr DW$229, DW_AT_accessibility(DW_ACCESS_public)
DW$230	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$230, DW_AT_name("xStartFld2"), DW_AT_symbol_name("_xStartFld2")
	.dwattr DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
	.dwattr DW$230, DW_AT_accessibility(DW_ACCESS_public)
DW$231	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$231, DW_AT_name("yStartFld2"), DW_AT_symbol_name("_yStartFld2")
	.dwattr DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
	.dwattr DW$231, DW_AT_accessibility(DW_ACCESS_public)
DW$232	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$232, DW_AT_name("hSyncStart"), DW_AT_symbol_name("_hSyncStart")
	.dwattr DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
	.dwattr DW$232, DW_AT_accessibility(DW_ACCESS_public)
DW$233	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$233, DW_AT_name("hSyncStop"), DW_AT_symbol_name("_hSyncStop")
	.dwattr DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
	.dwattr DW$233, DW_AT_accessibility(DW_ACCESS_public)
DW$234	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$234, DW_AT_name("vSyncXStartFld1"), DW_AT_symbol_name("_vSyncXStartFld1")
	.dwattr DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
	.dwattr DW$234, DW_AT_accessibility(DW_ACCESS_public)
DW$235	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$235, DW_AT_name("vSyncYStartFld1"), DW_AT_symbol_name("_vSyncYStartFld1")
	.dwattr DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
	.dwattr DW$235, DW_AT_accessibility(DW_ACCESS_public)
DW$236	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$236, DW_AT_name("vSyncXStopFld1"), DW_AT_symbol_name("_vSyncXStopFld1")
	.dwattr DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr DW$236, DW_AT_accessibility(DW_ACCESS_public)
DW$237	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$237, DW_AT_name("vSyncYStopFld1"), DW_AT_symbol_name("_vSyncYStopFld1")
	.dwattr DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
	.dwattr DW$237, DW_AT_accessibility(DW_ACCESS_public)
DW$238	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$238, DW_AT_name("vSyncXStartFld2"), DW_AT_symbol_name("_vSyncXStartFld2")
	.dwattr DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr DW$238, DW_AT_accessibility(DW_ACCESS_public)
DW$239	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$239, DW_AT_name("vSyncYStartFld2"), DW_AT_symbol_name("_vSyncYStartFld2")
	.dwattr DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
	.dwattr DW$239, DW_AT_accessibility(DW_ACCESS_public)
DW$240	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$240, DW_AT_name("vSyncXStopFld2"), DW_AT_symbol_name("_vSyncXStopFld2")
	.dwattr DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr DW$240, DW_AT_accessibility(DW_ACCESS_public)
DW$241	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$241, DW_AT_name("vSyncYStopFld2"), DW_AT_symbol_name("_vSyncYStopFld2")
	.dwattr DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
	.dwattr DW$241, DW_AT_accessibility(DW_ACCESS_public)
DW$242	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$242, DW_AT_name("yClipLow"), DW_AT_symbol_name("_yClipLow")
	.dwattr DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
	.dwattr DW$242, DW_AT_accessibility(DW_ACCESS_public)
DW$243	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$243, DW_AT_name("yClipHigh"), DW_AT_symbol_name("_yClipHigh")
	.dwattr DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x6d]
	.dwattr DW$243, DW_AT_accessibility(DW_ACCESS_public)
DW$244	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$244, DW_AT_name("cClipLow"), DW_AT_symbol_name("_cClipLow")
	.dwattr DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
	.dwattr DW$244, DW_AT_accessibility(DW_ACCESS_public)
DW$245	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$245, DW_AT_name("cClipHigh"), DW_AT_symbol_name("_cClipHigh")
	.dwattr DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x6f]
	.dwattr DW$245, DW_AT_accessibility(DW_ACCESS_public)
DW$246	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$246, DW_AT_name("yDefVal"), DW_AT_symbol_name("_yDefVal")
	.dwattr DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
	.dwattr DW$246, DW_AT_accessibility(DW_ACCESS_public)
DW$247	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$247, DW_AT_name("cbDefVal"), DW_AT_symbol_name("_cbDefVal")
	.dwattr DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x71]
	.dwattr DW$247, DW_AT_accessibility(DW_ACCESS_public)
DW$248	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$248, DW_AT_name("crDefVal"), DW_AT_symbol_name("_crDefVal")
	.dwattr DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
	.dwattr DW$248, DW_AT_accessibility(DW_ACCESS_public)
DW$249	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$249, DW_AT_name("rgbX"), DW_AT_symbol_name("_rgbX")
	.dwattr DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr DW$249, DW_AT_accessibility(DW_ACCESS_public)
DW$250	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$250, DW_AT_name("incPix"), DW_AT_symbol_name("_incPix")
	.dwattr DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr DW$250, DW_AT_accessibility(DW_ACCESS_public)
DW$251	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$251, DW_AT_name("thrld"), DW_AT_symbol_name("_thrld")
	.dwattr DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr DW$251, DW_AT_accessibility(DW_ACCESS_public)
DW$252	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$3)
	.dwattr DW$252, DW_AT_name("buf_addr"), DW_AT_symbol_name("_buf_addr")
	.dwattr DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr DW$252, DW_AT_accessibility(DW_ACCESS_public)
DW$253	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$253, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr DW$253, DW_AT_accessibility(DW_ACCESS_public)
DW$254	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$254, DW_AT_name("edmaPri"), DW_AT_symbol_name("_edmaPri")
	.dwattr DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr DW$254, DW_AT_accessibility(DW_ACCESS_public)
DW$255	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$255, DW_AT_name("irqId"), DW_AT_symbol_name("_irqId")
	.dwattr DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr DW$255, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32

DW$T$43	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$43, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$43, DW_AT_byte_size(0x01)

DW$T$78	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$78, DW_AT_byte_size(0xd4)
DW$256	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$256, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$256, DW_AT_accessibility(DW_ACCESS_public)
DW$257	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$257, DW_AT_name("portNum"), DW_AT_symbol_name("_portNum")
	.dwattr DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$257, DW_AT_accessibility(DW_ACCESS_public)
DW$258	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$258, DW_AT_name("chanNum"), DW_AT_symbol_name("_chanNum")
	.dwattr DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$258, DW_AT_accessibility(DW_ACCESS_public)
DW$259	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$259, DW_AT_name("base"), DW_AT_symbol_name("_base")
	.dwattr DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$259, DW_AT_accessibility(DW_ACCESS_public)
DW$260	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$260, DW_AT_name("edmaChanNum"), DW_AT_symbol_name("_edmaChanNum")
	.dwattr DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$260, DW_AT_accessibility(DW_ACCESS_public)
DW$261	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$66)
	.dwattr DW$261, DW_AT_name("edmaAddr"), DW_AT_symbol_name("_edmaAddr")
	.dwattr DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$261, DW_AT_accessibility(DW_ACCESS_public)
DW$262	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$262, DW_AT_name("vIntMask"), DW_AT_symbol_name("_vIntMask")
	.dwattr DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr DW$262, DW_AT_accessibility(DW_ACCESS_public)
DW$263	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$68)
	.dwattr DW$263, DW_AT_name("hEdma"), DW_AT_symbol_name("_hEdma")
	.dwattr DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr DW$263, DW_AT_accessibility(DW_ACCESS_public)
DW$264	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$69)
	.dwattr DW$264, DW_AT_name("hRld"), DW_AT_symbol_name("_hRld")
	.dwattr DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr DW$264, DW_AT_accessibility(DW_ACCESS_public)
DW$265	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$70)
	.dwattr DW$265, DW_AT_name("tcc"), DW_AT_symbol_name("_tcc")
	.dwattr DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr DW$265, DW_AT_accessibility(DW_ACCESS_public)
DW$266	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
	.dwattr DW$266, DW_AT_name("mergeFlds"), DW_AT_symbol_name("_mergeFlds")
	.dwattr DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
	.dwattr DW$266, DW_AT_accessibility(DW_ACCESS_public)
DW$267	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$51)
	.dwattr DW$267, DW_AT_name("cbFxn"), DW_AT_symbol_name("_cbFxn")
	.dwattr DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
	.dwattr DW$267, DW_AT_accessibility(DW_ACCESS_public)
DW$268	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$268, DW_AT_name("cbArg"), DW_AT_symbol_name("_cbArg")
	.dwattr DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
	.dwattr DW$268, DW_AT_accessibility(DW_ACCESS_public)
DW$269	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$75)
	.dwattr DW$269, DW_AT_name("vIntFxn"), DW_AT_symbol_name("_vIntFxn")
	.dwattr DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
	.dwattr DW$269, DW_AT_accessibility(DW_ACCESS_public)
DW$270	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
	.dwattr DW$270, DW_AT_name("scale"), DW_AT_symbol_name("_scale")
	.dwattr DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
	.dwattr DW$270, DW_AT_accessibility(DW_ACCESS_public)
DW$271	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$72)
	.dwattr DW$271, DW_AT_name("resmpl"), DW_AT_symbol_name("_resmpl")
	.dwattr DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
	.dwattr DW$271, DW_AT_accessibility(DW_ACCESS_public)
DW$272	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$272, DW_AT_name("yPitch"), DW_AT_symbol_name("_yPitch")
	.dwattr DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
	.dwattr DW$272, DW_AT_accessibility(DW_ACCESS_public)
DW$273	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$273, DW_AT_name("cPitch"), DW_AT_symbol_name("_cPitch")
	.dwattr DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
	.dwattr DW$273, DW_AT_accessibility(DW_ACCESS_public)
DW$274	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$274, DW_AT_name("numLines"), DW_AT_symbol_name("_numLines")
	.dwattr DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
	.dwattr DW$274, DW_AT_accessibility(DW_ACCESS_public)
DW$275	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$275, DW_AT_name("numPixels"), DW_AT_symbol_name("_numPixels")
	.dwattr DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
	.dwattr DW$275, DW_AT_accessibility(DW_ACCESS_public)
DW$276	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$276, DW_AT_name("numLinesFld1"), DW_AT_symbol_name("_numLinesFld1")
	.dwattr DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
	.dwattr DW$276, DW_AT_accessibility(DW_ACCESS_public)
DW$277	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$277, DW_AT_name("numFrms"), DW_AT_symbol_name("_numFrms")
	.dwattr DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
	.dwattr DW$277, DW_AT_accessibility(DW_ACCESS_public)
DW$278	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$278, DW_AT_name("numEvents"), DW_AT_symbol_name("_numEvents")
	.dwattr DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
	.dwattr DW$278, DW_AT_accessibility(DW_ACCESS_public)
DW$279	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$279, DW_AT_name("numEventsFld1"), DW_AT_symbol_name("_numEventsFld1")
	.dwattr DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
	.dwattr DW$279, DW_AT_accessibility(DW_ACCESS_public)
DW$280	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$280, DW_AT_name("yThrld"), DW_AT_symbol_name("_yThrld")
	.dwattr DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
	.dwattr DW$280, DW_AT_accessibility(DW_ACCESS_public)
DW$281	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$281, DW_AT_name("cThrld"), DW_AT_symbol_name("_cThrld")
	.dwattr DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
	.dwattr DW$281, DW_AT_accessibility(DW_ACCESS_public)
DW$282	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$282, DW_AT_name("mode"), DW_AT_symbol_name("_mode")
	.dwattr DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
	.dwattr DW$282, DW_AT_accessibility(DW_ACCESS_public)
DW$283	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$77)
	.dwattr DW$283, DW_AT_name("edcFxns"), DW_AT_symbol_name("_edcFxns")
	.dwattr DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
	.dwattr DW$283, DW_AT_accessibility(DW_ACCESS_public)
DW$284	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$284, DW_AT_name("edcHandle"), DW_AT_symbol_name("_edcHandle")
	.dwattr DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
	.dwattr DW$284, DW_AT_accessibility(DW_ACCESS_public)
DW$285	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$48)
	.dwattr DW$285, DW_AT_name("packetIOM"), DW_AT_symbol_name("_packetIOM")
	.dwattr DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
	.dwattr DW$285, DW_AT_accessibility(DW_ACCESS_public)
DW$286	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$286, DW_AT_name("vIntCbArg"), DW_AT_symbol_name("_vIntCbArg")
	.dwattr DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
	.dwattr DW$286, DW_AT_accessibility(DW_ACCESS_public)
DW$287	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$287, DW_AT_name("segId"), DW_AT_symbol_name("_segId")
	.dwattr DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
	.dwattr DW$287, DW_AT_accessibility(DW_ACCESS_public)
DW$288	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$288, DW_AT_name("bufSz"), DW_AT_symbol_name("_bufSz")
	.dwattr DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
	.dwattr DW$288, DW_AT_accessibility(DW_ACCESS_public)
DW$289	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$289, DW_AT_name("lastLineNum"), DW_AT_symbol_name("_lastLineNum")
	.dwattr DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
	.dwattr DW$289, DW_AT_accessibility(DW_ACCESS_public)
DW$290	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$290, DW_AT_name("nextEDMARlds"), DW_AT_symbol_name("_nextEDMARlds")
	.dwattr DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
	.dwattr DW$290, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$78

DW$T$75	.dwtag  DW_TAG_typedef, DW_AT_name("VPORT_IntCallBack"), DW_AT_type(*DW$T$74)
	.dwattr DW$T$75, DW_AT_language(DW_LANG_C)
DW$T$31	.dwtag  DW_TAG_typedef, DW_AT_name("Uint8"), DW_AT_type(*DW$T$6)
	.dwattr DW$T$31, DW_AT_language(DW_LANG_C)
DW$T$30	.dwtag  DW_TAG_typedef, DW_AT_name("Int16"), DW_AT_type(*DW$T$8)
	.dwattr DW$T$30, DW_AT_language(DW_LANG_C)
DW$T$72	.dwtag  DW_TAG_typedef, DW_AT_name("Bool"), DW_AT_type(*DW$T$71)
	.dwattr DW$T$72, DW_AT_language(DW_LANG_C)
DW$T$27	.dwtag  DW_TAG_typedef, DW_AT_name("Arg"), DW_AT_type(*DW$T$26)
	.dwattr DW$T$27, DW_AT_language(DW_LANG_C)
DW$T$35	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$34)
	.dwattr DW$T$35, DW_AT_address_class(0x20)
DW$T$38	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$37)
	.dwattr DW$T$38, DW_AT_address_class(0x20)
DW$T$41	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$40)
	.dwattr DW$T$41, DW_AT_address_class(0x20)
DW$T$53	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$52)
	.dwattr DW$T$53, DW_AT_address_class(0x20)
DW$T$57	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$56)
	.dwattr DW$T$57, DW_AT_address_class(0x20)

DW$T$70	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$70, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$70, DW_AT_byte_size(0x0c)
DW$291	.dwtag  DW_TAG_subrange_type
	.dwattr DW$291, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$70


DW$T$68	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$68, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$68, DW_AT_byte_size(0x0c)
DW$292	.dwtag  DW_TAG_subrange_type
	.dwattr DW$292, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$68


DW$T$69	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$67)
	.dwattr DW$T$69, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$69, DW_AT_byte_size(0x30)
DW$293	.dwtag  DW_TAG_subrange_type
	.dwattr DW$293, DW_AT_upper_bound(0x0b)
	.dwendtag DW$T$69


DW$T$66	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$25)
	.dwattr DW$T$66, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$66, DW_AT_byte_size(0x0c)
DW$294	.dwtag  DW_TAG_subrange_type
	.dwattr DW$294, DW_AT_upper_bound(0x02)
	.dwendtag DW$T$66


DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$28, DW_AT_name("DEV_Frame")
	.dwattr DW$T$28, DW_AT_byte_size(0x20)
DW$295	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$23)
	.dwattr DW$295, DW_AT_name("link"), DW_AT_symbol_name("_link")
	.dwattr DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$295, DW_AT_accessibility(DW_ACCESS_public)
DW$296	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$296, DW_AT_name("addr"), DW_AT_symbol_name("_addr")
	.dwattr DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$296, DW_AT_accessibility(DW_ACCESS_public)
DW$297	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$297, DW_AT_name("size"), DW_AT_symbol_name("_size")
	.dwattr DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$297, DW_AT_accessibility(DW_ACCESS_public)
DW$298	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$298, DW_AT_name("misc"), DW_AT_symbol_name("_misc")
	.dwattr DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$298, DW_AT_accessibility(DW_ACCESS_public)
DW$299	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$27)
	.dwattr DW$299, DW_AT_name("arg"), DW_AT_symbol_name("_arg")
	.dwattr DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr DW$299, DW_AT_accessibility(DW_ACCESS_public)
DW$300	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$25)
	.dwattr DW$300, DW_AT_name("cmd"), DW_AT_symbol_name("_cmd")
	.dwattr DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr DW$300, DW_AT_accessibility(DW_ACCESS_public)
DW$301	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$301, DW_AT_name("status"), DW_AT_symbol_name("_status")
	.dwattr DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr DW$301, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$28

DW$T$77	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$76)
	.dwattr DW$T$77, DW_AT_address_class(0x20)
DW$T$74	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$73)
	.dwattr DW$T$74, DW_AT_address_class(0x20)
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)
DW$T$8	.dwtag  DW_TAG_base_type, DW_AT_name("short")
	.dwattr DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$8, DW_AT_byte_size(0x02)
DW$T$71	.dwtag  DW_TAG_typedef, DW_AT_name("MdUns"), DW_AT_type(*DW$T$9)
	.dwattr DW$T$71, DW_AT_language(DW_LANG_C)
DW$T$23	.dwtag  DW_TAG_typedef, DW_AT_name("QUE_Elem"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)
DW$T$76	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Fxns"), DW_AT_type(*DW$T$65)
	.dwattr DW$T$76, DW_AT_language(DW_LANG_C)

DW$T$73	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$73, DW_AT_language(DW_LANG_C)
DW$302	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
DW$303	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$73


DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_name("QUE_Elem")
	.dwattr DW$T$22, DW_AT_byte_size(0x08)
DW$304	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$304, DW_AT_name("next"), DW_AT_symbol_name("_next")
	.dwattr DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$304, DW_AT_accessibility(DW_ACCESS_public)
DW$305	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$305, DW_AT_name("prev"), DW_AT_symbol_name("_prev")
	.dwattr DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$305, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22

DW$T$21	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$22)
	.dwattr DW$T$21, DW_AT_address_class(0x20)

DW$T$65	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$65, DW_AT_name("EDC_Fxns")
	.dwattr DW$T$65, DW_AT_byte_size(0x0c)
DW$306	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$62)
	.dwattr DW$306, DW_AT_name("open"), DW_AT_symbol_name("_open")
	.dwattr DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$306, DW_AT_accessibility(DW_ACCESS_public)
DW$307	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$38)
	.dwattr DW$307, DW_AT_name("close"), DW_AT_symbol_name("_close")
	.dwattr DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$307, DW_AT_accessibility(DW_ACCESS_public)
DW$308	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$64)
	.dwattr DW$308, DW_AT_name("ctrl"), DW_AT_symbol_name("_ctrl")
	.dwattr DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$308, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$65

DW$T$62	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$61)
	.dwattr DW$T$62, DW_AT_address_class(0x20)
DW$T$64	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$63)
	.dwattr DW$T$64, DW_AT_address_class(0x20)

DW$T$61	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$60)
	.dwattr DW$T$61, DW_AT_language(DW_LANG_C)
DW$309	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$45)
DW$310	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$61


DW$T$63	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$26)
	.dwattr DW$T$63, DW_AT_language(DW_LANG_C)
DW$311	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$24)
DW$312	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$25)
DW$313	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$63

DW$T$60	.dwtag  DW_TAG_typedef, DW_AT_name("EDC_Handle"), DW_AT_type(*DW$T$3)
	.dwattr DW$T$60, DW_AT_language(DW_LANG_C)

	.dwattr DW$59, DW_AT_type(*DW$T$26)
	.dwattr DW$56, DW_AT_type(*DW$T$26)
	.dwattr DW$44, DW_AT_type(*DW$T$26)
	.dwattr DW$50, DW_AT_type(*DW$T$26)
	.dwattr DW$94, DW_AT_type(*DW$T$26)
	.dwattr DW$123, DW_AT_type(*DW$T$26)
	.dwattr DW$100, DW_AT_type(*DW$T$26)
	.dwattr DW$127, DW_AT_type(*DW$T$26)
	.dwattr DW$41, DW_AT_type(*DW$T$26)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$314	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$314, DW_AT_location[DW_OP_reg0]
DW$315	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$315, DW_AT_location[DW_OP_reg1]
DW$316	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$316, DW_AT_location[DW_OP_reg2]
DW$317	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$317, DW_AT_location[DW_OP_reg3]
DW$318	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$318, DW_AT_location[DW_OP_reg4]
DW$319	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$319, DW_AT_location[DW_OP_reg5]
DW$320	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$320, DW_AT_location[DW_OP_reg6]
DW$321	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$321, DW_AT_location[DW_OP_reg7]
DW$322	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$322, DW_AT_location[DW_OP_reg8]
DW$323	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$323, DW_AT_location[DW_OP_reg9]
DW$324	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$324, DW_AT_location[DW_OP_reg10]
DW$325	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$325, DW_AT_location[DW_OP_reg11]
DW$326	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$326, DW_AT_location[DW_OP_reg12]
DW$327	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$327, DW_AT_location[DW_OP_reg13]
DW$328	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$328, DW_AT_location[DW_OP_reg14]
DW$329	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$329, DW_AT_location[DW_OP_reg15]
DW$330	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$330, DW_AT_location[DW_OP_reg16]
DW$331	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$331, DW_AT_location[DW_OP_reg17]
DW$332	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$332, DW_AT_location[DW_OP_reg18]
DW$333	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$333, DW_AT_location[DW_OP_reg19]
DW$334	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$334, DW_AT_location[DW_OP_reg20]
DW$335	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$335, DW_AT_location[DW_OP_reg21]
DW$336	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$336, DW_AT_location[DW_OP_reg22]
DW$337	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
