;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v5.1.0 *
;* Date/Time created: Thu Mar 31 17:03:37 2011                                *
;******************************************************************************
	.compiler_opts --endian=little --mem_model:code=near --mem_model:data=far --quiet --silicon_version=6400 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C64xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : Disabled                                             *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *
;*   Speculate Loads   : Disabled                                             *
;*   Memory Aliases    : Presume are aliases (pessimistic)                    *

||         LDW     .D2T2   *+SP(116),B13     ; |187| 

           LDW     .D2T1   *++SP(120),A10    ; |187| 
	.dwpsn	"SSHSH256.C",187,1
           NOP             4
           ; BRANCH OCCURS {B3}              ; |187| 
	.dwattr DW$50, DW_AT_end_file("SSHSH256.C")
	.dwattr DW$50, DW_AT_end_line(0xbb)
	.dwattr DW$50, DW_AT_end_column(0x01)
	.dwendtag DW$50

;; Inlined function references:
;; [  6] SHA256_Init
;******************************************************************************
;* STRINGS                                                                    *
;******************************************************************************
	.sect	".const"
SL1:	.string	"SHA-256",0
;******************************************************************************
;* UNDEFINED EXTERNAL REFERENCES                                              *
;******************************************************************************
	.global	_memset
	.global	_safemalloc
	.global	_safefree
	.global	_memcpy

;******************************************************************************
;* TYPE INFORMATION                                                           *
;******************************************************************************
DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr DW$T$3, DW_AT_address_class(0x20)

DW$T$23	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$23, DW_AT_language(DW_LANG_C)

DW$T$36	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$36, DW_AT_language(DW_LANG_C)
DW$54	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$55	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
DW$56	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
	.dwendtag DW$T$36


DW$T$37	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$37, DW_AT_language(DW_LANG_C)
DW$57	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$58	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$59	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
	.dwendtag DW$T$37


DW$T$39	.dwtag  DW_TAG_subroutine_type, DW_AT_type(*DW$T$3)
	.dwattr DW$T$39, DW_AT_language(DW_LANG_C)
DW$60	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
DW$61	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$35)
	.dwendtag DW$T$39


DW$T$25	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$25, DW_AT_language(DW_LANG_C)
DW$62	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$63	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$64	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$25


DW$T$28	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$28, DW_AT_language(DW_LANG_C)
DW$65	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
DW$66	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$28

DW$T$34	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$33)
	.dwattr DW$T$34, DW_AT_address_class(0x20)

DW$T$43	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$43, DW_AT_language(DW_LANG_C)
DW$67	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$3)
	.dwendtag DW$T$43


DW$T$47	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$47, DW_AT_language(DW_LANG_C)
DW$68	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$46)
	.dwendtag DW$T$47


DW$T$50	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$50, DW_AT_language(DW_LANG_C)
DW$69	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$46)
DW$70	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$49)
	.dwendtag DW$T$50


DW$T$52	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$52, DW_AT_language(DW_LANG_C)
DW$71	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$46)
DW$72	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
DW$73	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
	.dwendtag DW$T$52


DW$T$54	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$54, DW_AT_language(DW_LANG_C)
DW$74	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$46)
DW$75	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$54


DW$T$56	.dwtag  DW_TAG_subroutine_type
	.dwattr DW$T$56, DW_AT_language(DW_LANG_C)
DW$76	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$34)
DW$77	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$10)
DW$78	.dwtag  DW_TAG_formal_parameter, DW_AT_type(*DW$T$27)
	.dwendtag DW$T$56

DW$T$27	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$27, DW_AT_address_class(0x20)
DW$T$10	.dwtag  DW_TAG_base_type, DW_AT_name("int")
	.dwattr DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr DW$T$10, DW_AT_byte_size(0x04)

DW$T$61	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$60)
	.dwattr DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$61, DW_AT_byte_size(0x100)
DW$79	.dwtag  DW_TAG_subrange_type
	.dwattr DW$79, DW_AT_upper_bound(0x3f)
	.dwendtag DW$T$61

DW$T$49	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$49, DW_AT_address_class(0x20)
DW$T$35	.dwtag  DW_TAG_typedef, DW_AT_name("size_t"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$35, DW_AT_language(DW_LANG_C)
DW$T$46	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$45)
	.dwattr DW$T$46, DW_AT_address_class(0x20)
DW$T$76	.dwtag  DW_TAG_const_type
	.dwattr DW$T$76, DW_AT_type(*DW$T$32)
DW$T$33	.dwtag  DW_TAG_const_type
DW$T$6	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned char")
	.dwattr DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr DW$T$6, DW_AT_byte_size(0x01)
DW$T$60	.dwtag  DW_TAG_const_type
	.dwattr DW$T$60, DW_AT_type(*DW$T$10)
DW$T$11	.dwtag  DW_TAG_base_type, DW_AT_name("unsigned int")
	.dwattr DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr DW$T$11, DW_AT_byte_size(0x04)
DW$T$19	.dwtag  DW_TAG_typedef, DW_AT_name("uint32"), DW_AT_type(*DW$T$11)
	.dwattr DW$T$19, DW_AT_language(DW_LANG_C)
DW$T$45	.dwtag  DW_TAG_typedef, DW_AT_name("SHA256_State"), DW_AT_type(*DW$T$22)
	.dwattr DW$T$45, DW_AT_language(DW_LANG_C)

DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$32, DW_AT_name("ssh_hash")
	.dwattr DW$T$32, DW_AT_byte_size(0x14)
DW$80	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$24)
	.dwattr DW$80, DW_AT_name("init"), DW_AT_symbol_name("_init")
	.dwattr DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$80, DW_AT_accessibility(DW_ACCESS_public)
DW$81	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$26)
	.dwattr DW$81, DW_AT_name("bytes"), DW_AT_symbol_name("_bytes")
	.dwattr DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr DW$81, DW_AT_accessibility(DW_ACCESS_public)
DW$82	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$29)
	.dwattr DW$82, DW_AT_name("final"), DW_AT_symbol_name("_final")
	.dwattr DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr DW$82, DW_AT_accessibility(DW_ACCESS_public)
DW$83	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$83, DW_AT_name("hlen"), DW_AT_symbol_name("_hlen")
	.dwattr DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr DW$83, DW_AT_accessibility(DW_ACCESS_public)
DW$84	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$31)
	.dwattr DW$84, DW_AT_name("text_name"), DW_AT_symbol_name("_text_name")
	.dwattr DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr DW$84, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$32

DW$T$24	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$23)
	.dwattr DW$T$24, DW_AT_address_class(0x20)
DW$T$26	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$25)
	.dwattr DW$T$26, DW_AT_address_class(0x20)
DW$T$29	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$28)
	.dwattr DW$T$29, DW_AT_address_class(0x20)

DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr DW$T$22, DW_AT_byte_size(0x6c)
DW$85	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$20)
	.dwattr DW$85, DW_AT_name("h"), DW_AT_symbol_name("_h")
	.dwattr DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr DW$85, DW_AT_accessibility(DW_ACCESS_public)
DW$86	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$21)
	.dwattr DW$86, DW_AT_name("block"), DW_AT_symbol_name("_block")
	.dwattr DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr DW$86, DW_AT_accessibility(DW_ACCESS_public)
DW$87	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$10)
	.dwattr DW$87, DW_AT_name("blkused"), DW_AT_symbol_name("_blkused")
	.dwattr DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
	.dwattr DW$87, DW_AT_accessibility(DW_ACCESS_public)
DW$88	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$88, DW_AT_name("lenhi"), DW_AT_symbol_name("_lenhi")
	.dwattr DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
	.dwattr DW$88, DW_AT_accessibility(DW_ACCESS_public)
DW$89	.dwtag  DW_TAG_member, DW_AT_type(*DW$T$19)
	.dwattr DW$89, DW_AT_name("lenlo"), DW_AT_symbol_name("_lenlo")
	.dwattr DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
	.dwattr DW$89, DW_AT_accessibility(DW_ACCESS_public)
	.dwendtag DW$T$22

DW$T$31	.dwtag  DW_TAG_pointer_type, DW_AT_type(*DW$T$30)
	.dwattr DW$T$31, DW_AT_address_class(0x20)

DW$T$21	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$6)
	.dwattr DW$T$21, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$21, DW_AT_byte_size(0x40)
DW$90	.dwtag  DW_TAG_subrange_type
	.dwattr DW$90, DW_AT_upper_bound(0x3f)
	.dwendtag DW$T$21


DW$T$20	.dwtag  DW_TAG_array_type, DW_AT_type(*DW$T$19)
	.dwattr DW$T$20, DW_AT_language(DW_LANG_C)
	.dwattr DW$T$20, DW_AT_byte_size(0x20)
DW$91	.dwtag  DW_TAG_subrange_type
	.dwattr DW$91, DW_AT_upper_bound(0x07)
	.dwendtag DW$T$20

DW$T$30	.dwtag  DW_TAG_base_type, DW_AT_name("signed char")
	.dwattr DW$T$30, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr DW$T$30, DW_AT_byte_size(0x01)

	.dwattr DW$20, DW_AT_external(0x01)
	.dwattr DW$28, DW_AT_external(0x01)
	.dwattr DW$15, DW_AT_external(0x01)
	.dwattr DW$36, DW_AT_external(0x01)
	.dwattr DW$17, DW_AT_external(0x01)
	.dwattr DW$50, DW_AT_external(0x01)
	.dwattr DW$19, DW_AT_type(*DW$T$3)
	.dwattr DW$CU, DW_AT_language(DW_LANG_C)

;***************************************************************
;* DWARF REGISTER MAP                                          *
;***************************************************************

DW$92	.dwtag  DW_TAG_assign_register, DW_AT_name("A0")
	.dwattr DW$92, DW_AT_location[DW_OP_reg0]
DW$93	.dwtag  DW_TAG_assign_register, DW_AT_name("A1")
	.dwattr DW$93, DW_AT_location[DW_OP_reg1]
DW$94	.dwtag  DW_TAG_assign_register, DW_AT_name("A2")
	.dwattr DW$94, DW_AT_location[DW_OP_reg2]
DW$95	.dwtag  DW_TAG_assign_register, DW_AT_name("A3")
	.dwattr DW$95, DW_AT_location[DW_OP_reg3]
DW$96	.dwtag  DW_TAG_assign_register, DW_AT_name("A4")
	.dwattr DW$96, DW_AT_location[DW_OP_reg4]
DW$97	.dwtag  DW_TAG_assign_register, DW_AT_name("A5")
	.dwattr DW$97, DW_AT_location[DW_OP_reg5]
DW$98	.dwtag  DW_TAG_assign_register, DW_AT_name("A6")
	.dwattr DW$98, DW_AT_location[DW_OP_reg6]
DW$99	.dwtag  DW_TAG_assign_register, DW_AT_name("A7")
	.dwattr DW$99, DW_AT_location[DW_OP_reg7]
DW$100	.dwtag  DW_TAG_assign_register, DW_AT_name("A8")
	.dwattr DW$100, DW_AT_location[DW_OP_reg8]
DW$101	.dwtag  DW_TAG_assign_register, DW_AT_name("A9")
	.dwattr DW$101, DW_AT_location[DW_OP_reg9]
DW$102	.dwtag  DW_TAG_assign_register, DW_AT_name("A10")
	.dwattr DW$102, DW_AT_location[DW_OP_reg10]
DW$103	.dwtag  DW_TAG_assign_register, DW_AT_name("A11")
	.dwattr DW$103, DW_AT_location[DW_OP_reg11]
DW$104	.dwtag  DW_TAG_assign_register, DW_AT_name("A12")
	.dwattr DW$104, DW_AT_location[DW_OP_reg12]
DW$105	.dwtag  DW_TAG_assign_register, DW_AT_name("A13")
	.dwattr DW$105, DW_AT_location[DW_OP_reg13]
DW$106	.dwtag  DW_TAG_assign_register, DW_AT_name("A14")
	.dwattr DW$106, DW_AT_location[DW_OP_reg14]
DW$107	.dwtag  DW_TAG_assign_register, DW_AT_name("A15")
	.dwattr DW$107, DW_AT_location[DW_OP_reg15]
DW$108	.dwtag  DW_TAG_assign_register, DW_AT_name("B0")
	.dwattr DW$108, DW_AT_location[DW_OP_reg16]
DW$109	.dwtag  DW_TAG_assign_register, DW_AT_name("B1")
	.dwattr DW$109, DW_AT_location[DW_OP_reg17]
DW$110	.dwtag  DW_TAG_assign_register, DW_AT_name("B2")
	.dwattr DW$110, DW_AT_location[DW_OP_reg18]
DW$111	.dwtag  DW_TAG_assign_register, DW_AT_name("B3")
	.dwattr DW$111, DW_AT_location[DW_OP_reg19]
DW$112	.dwtag  DW_TAG_assign_register, DW_AT_name("B4")
	.dwattr DW$112, DW_AT_location[DW_OP_reg20]
DW$113	.dwtag  DW_TAG_assign_register, DW_AT_name("B5")
	.dwattr DW$113, DW_AT_location[DW_OP_reg21]
DW$114	.dwtag  DW_TAG_assign_register, DW_AT_name("B6")
	.dwattr DW$114, DW_AT_location[DW_OP_reg22]
DW$115	.dwtag  DW_TAG_assign_register, DW_AT_name("B7")
	.dwattr DW$115, DW_AT_location[DW_OP_reg23]
DW$116	.dwtag  DW_TAG_assign_register, DW_AT_name("B8")
	.dwattr DW$116, DW_AT_location[DW_OP_reg24]
DW$117	.dwtag  DW_TAG_assign_register, DW_AT_name("B9")
	.dwattr DW$117, DW_AT_location[DW_OP_reg25]
